--[[ @i18n map ]]
local _t = require("i18n").context("map")
--------------------------------------------
-- 寻径孤岛配置 
-- Created by Fengbo
--[[
当在同地图内寻径时，若直接移动到目的地点找不到路径，则尝试在以下配置中查找目标点所在的管辖区域是否是孤岛。
若起点在孤岛内，则寻径目的地修改为孤岛出口；
若终点在孤岛内，则寻径目的地修改为孤岛入口；

目前存在以下限制，如有需要可扩展：
1.每个孤岛只有一个入口和一个出口
2.该孤岛的寻径图所占区域一定被管辖区域完全包含

route_island[1] =			-- 配置1号地图中的孤岛
{
	[107] = 				-- 管辖区域编号
	{
		-- 孤岛入口配置
		enter = {name = "观星楼入口", x = 83.8, y = 435, z = 214},
		-- 孤岛出口配置
		exit = {name = "观星楼出口", x = 113,8, y = 420.6, z = 329.6},
	},
}
--]]
--------------------------------------------
route_island = {}

route_island[1] =
{
	-- 观星楼
	[107] = 
	{
		enter = {name = _t"观星楼入口", x = 83.5, y = 346.7, z = 217},
		exit = {name = _t"观星楼出口", x = 110.5, y = 420.5, z = 339},
	},
	-- 观星楼裂隙后面
	[111] = 
	{
		enter = {name = _t"观星楼裂隙后面入口", x = 83.5, y = 346.7, z = 217},
		exit = {name = _t"观星楼裂隙后面出口", x = 65.4, y = 370.5, z = 251.7},
	},	
}
route_island[7] =
{
	-- 蓝冰堡
	[714] = 
	{
		enter = {name = _t"蓝冰堡入口", x = 38.44, y = 297.921, z = 217.928},
		exit = {name = _t"蓝冰堡出口", x = 112.759, y = 386.643, z = 249.485},
	},
	-- 海皇宫遗址
	[715] = 
	{
		enter = {name = _t"蓝冰堡入口", x = 38.44, y = 297.921, z = 217.928},
		exit = {name = _t"蓝冰堡出口", x = 112.759, y = 386.643, z = 249.485},
	},
}
route_island[8] =
{
	-- 哨岗顶部
	[811] = 
	{
		exit = {name = _t"哨岗顶部出口", x = 81.2774, y = 424.906, z = -68.4486},
	},
}
route_island[11] =
{
	-- 寒冰地狱与天上建筑
	[1121] = 
	{
		enter = {name = _t"前往该隐之厅", x = 684, y = 401, z = 859},
		exit = {name = _t"回到寒冰地狱", x = -547, y = 824, z = 161},
	},
	[1122] = 
	{
		enter = {name = _t"前往安第诺拉之厅", x = 684, y = 401, z = 859},
		exit = {name = _t"回到寒冰地狱", x = -547, y = 824, z = 161},
	},
	[1123] = 
	{
		enter = {name = _t"前往多罗梅之厅", x = 684, y = 401, z = 859},
		exit = {name = _t"回到寒冰地狱", x = -547, y = 824, z = 161},
	},
	[1124] = 
	{
		enter = {name = _t"前往犹大之厅", x = 684, y = 401, z = 859},
		exit = {name = _t"回到寒冰地狱", x = -547, y = 824, z = 161},
	},
	[1125] = 
	{
		enter = {name = _t"前往叹息之墙", x = 684, y = 401, z = 859},
		exit = {name = _t"回到寒冰地狱", x = -547, y = 824, z = 161},
	},
}