
TemplPos =
{
--------怪物-----------------------------------------------------------------------------
[100000]={
            {
                mapId = 2,x = 100,y = 100,z = 100,     --(填法示例)一般填法
            },
        },
[100001]={
            {
                mapId = 2,
                { x = 1,y = 1,z = 1,},     --(填法示例)100001对应区域中心点1随机点1——中心点具体坐标没填就算出来
                { x = 1,y = 2,z = 1,},     --(填法示例)100001对应区域中心点1随机点2
            },
            {
                mapId = 1,
                { x = 13,y = 2,z = 10,},     --(填法示例)100001对应区域中心点2随机点1——中心点具体坐标没填就算出来
                { x = 3,y = 5,z = 6,},     --(填法示例)100001对应区域中心点2随机点2
            },
            {
                mapId = 2,x = 50,y = 50,z = 50,r = 10,
                { x = 13,y = 2,z = 10,},     --(填法示例)100001对应区域中心点3随机点1——此中心填了中心点
                { x = 3,y = 5,z = 6,},     --(填法示例)100001对应区域中心点3随机点2
            },
            {
                mapId = 2,x = 100,y = 100,z = 100,r = 1,     --(填法示例)100001对应区域中心点4
            },
        },
[100002]={
            {
                mapId = 1,x = 105,y = 123,z = 124,     --(填法示例)一般填法
            },
        },
[567]={
            {
                mapId = 1,x = -305,y = 329,z = 101,     --(新手村)主线01圣斗士学员
            },
        },
[568]={
            {
                mapId = 1,x = -272,y = 309,z = -55,     --(新手村)主线02圣斗士候补生
            },
        },
[569]={
            {
                mapId = 1,x = -150,y = 351,z = 147,     --(新手村)主线03卡西欧士
            },
        },
[570]={
            {
                mapId = 1,x = -98,y = 365,z = 415,     --(新手村)主线04圣斗士英灵
            },
        },
[571]={
            {
                mapId = 1,x = 142,y = 421,z = 327,     --(新手村)主线05冥界骷髅兵
            },
        },
[572]={
            {
                mapId = 1,x = 132,y = 430,z = 309,     --(新手村)主线06艾德
            },
        },
[573]={
            {
                mapId = 1,x = -372,y = 318,z = 170,     --(新手村)主线07白银侍从
            },
        },
[10052]={
            {
                mapId = 1,x = -169,y = 351,z = 135,     --(新手村)主线卡西欧士追随者
            },
        },
[9128]={
            {
                mapId = 1,x = 142,y = 421,z = 327,     --(新手村)主线小怪骷髅小兵
            },
        },
[9127]={
            {
                mapId = 1,x = -98,y = 365,z = 415,     --(新手村)主线小怪游荡的英灵
            },
        },
[9126]={
            {
                mapId = 1,x = -272,y = 309,z = -55,     --(新手村)主线小怪圣斗士候补生
            },
        },
[9129]={
            {
                mapId = 1,x = -377,y = 318,z = 172,     --(新手村)主线小怪圣斗士学员
            },
        },
[8615]={
            {
                mapId = 3,x = -162,y = 337,z = 23,     --(庐山)庐山支线燕子
            },
        },
[8585]={
            {
                mapId = 3,x = -256,y = 311,z = 60,     --(庐山)庐山支线大老鼠
            },
        },
[8584]={
            {
                mapId = 3,x = -41,y = 320,z = -138,     --(庐山)庐山支线蜜蜂
            },
        },
[1671]={
            {
                mapId = 3,x = -285,y = 313,z = -30,     --(庐山)庐山支线小鸡
            },
        },
[10259]={
            {
                mapId = 3,x = 166,y = 462,z = 295,r = 1,     --(庐山)库任务英灵马雷萨斯
            },
        },
[10260]={
            {
                mapId = 3,x = 155,y = 462,z = 282,r = 1,     --(庐山)库任务英灵塔吉
            },
        },
[10261]={
            {
                mapId = 3,x = 148,y = 459,z = 296,r = 1,     --(庐山)库任务英灵马戈
            },
        },
[1515]={
            {
                mapId = 3,x = -59,y = 334,z = -84,r = 1,     --(庐山)主线黄金侍从
            },
        },
[1533]={
            {
                mapId = 3,x = 49,y = 372,z = 108,r = 1,     --(庐山)主线不死衣魂
            },
        },
[1519]={
            {
                mapId = 3,x = 107,y = 390,z = 146,r = 1,     --(庐山)主线青铜衣魂
            },
        },
[1491]={
            {
                mapId = 3,x = -157,y = 313,z = -233,r = 1,     --(庐山)主线毒蛇
            },
        },
[1512]={
            {
                mapId = 3,x = -283,y = 316,z = -11,r = 1,     --(庐山)主线中毒的村民
            },
        },
[10296]={
            {
                mapId = 1,x = -169,y = 351,z = 135,     --(新手村)主线竞技场守卫
            },
        },
[1530]={
            {
                mapId = 3,x = -190,y = 313,z = -24,     --(庐山)主线逝去的战士
            },
        },
[1511]={
            {
                mapId = 3,x = -137,y = 312,z = -74,     --(庐山)主线青铜傀儡
            },
        },
[1516]={
            {
                mapId = 3,x = -103,y = 312,z = -170,     --(庐山)主线圣域侍卫
            },
        },
[1524]={
            {
                mapId = 3,x = -23,y = 315,z = -160,     --(庐山)主线尸气傀儡
            },
        },
[1513]={
            {
                mapId = 3,x = -99,y = 313,z = -8,     --(庐山)主线失控的村民
            },
        },
[1514]={
            {
                mapId = 3,x = 2,y = 340,z = -78,     --(庐山)主线中毒的学员
            },
        },
[1518]={
            {
                mapId = 3,x = -30,y = 336,z = 47,     --(庐山)主线游荡的衣魂
            },
        },
[9199]={
            {
                mapId = 3,x = 6,y = 361,z = 113,     --(庐山)主线受伤的庐山学员
            },
        },
[1520]={
            {
                mapId = 3,x = 105,y = 391,z = 151,     --(庐山)主线积尸气源
            },
        },
[1525]={
            {
                mapId = 3,x = 18,y = 450,z = 293,     --(庐山)主线神龙岭英灵
            },
        },
[1527]={
            {
                mapId = 3,x = -129,y = 484,z = 249,     --(庐山)主线暴躁的龙龟
            },
        },
[1522]={
            {
                mapId = 3,x = -168,y = 482,z = 204,     --(庐山)主线白银衣魂
            },
        },
[1536]={
            {
                mapId = 3,x = 119,y = 445,z = 289,     --(庐山)主线复活的冥兵
            },
        },
[1534]={
            {
                mapId = 3,x = 156,y = 463,z = 328,     --(庐山)主线复活的圣斗士
            },
        },
[10234]={
            {
                mapId = 4,x = -284,y = 282,z = -387,r = 1,     --(银河竞技场)库任务海妖丝西娜
            },
        },
[10237]={
            {
                mapId = 4,x = -330,y = 282,z = -387,r = 1,     --(银河竞技场)库任务海妖尤瑞艾莉
            },
        },
[10238]={
            {
                mapId = 4,x = -320,y = 282,z = -368,r = 1,     --(银河竞技场)库任务海妖美杜莎
            },
        },
[1436]={
            {
                mapId = 4,x = 402,y = 304,z = -89,     --(银河竞技场)邪恶之灵
            },
        },
[1439]={
            {
                mapId = 4,x = 401,y = 307,z = -160,     --(银河竞技场)扭曲空间兽
            },
        },
[1459]={
            {
                mapId = 4,x = -269,y = 299,z = -142,     --(银河竞技场)黑暗防御者
            },
        },
[1467]={
            {
                mapId = 4,x = -421,y = 339,z = -192,     --(银河竞技场)黑暗冲击者
            },
        },
[1463]={
            {
                mapId = 4,x = -343,y = 315,z = -130,     --(银河竞技场)黑暗霜冻者
            },
        },
[1441]={
            {
                mapId = 4,x = 227,y = 313,z = -140,     --(银河竞技场)燃梦师
            },
        },
[1429]={
            {
                mapId = 4,x = 222,y = 326,z = 385,     --(银河竞技场)邪武
            },
        },
[1430]={
            {
                mapId = 4,x = 209,y = 316,z = 331,     --(银河竞技场)古拉杜财团打手
            },
        },
[1431]={
            {
                mapId = 4,x = 295,y = 317,z = 235,     --(银河竞技场)黑衣人
            },
        },
[1434]={
            {
                mapId = 4,x = 384,y = 308,z = -50,     --(银河竞技场)黑暗防守者
            },
        },
[1435]={
            {
                mapId = 4,x = 453,y = 314,z = -91,     --(银河竞技场)黑暗凤凰
            },
        },
[1437]={
            {
                mapId = 4,x = 418,y = 305,z = -142,     --(银河竞技场)幽冥侍从
            },
        },
[1438]={
            {
                mapId = 4,x = 417,y = 305,z = -118,     --(银河竞技场)幻象编制者
            },
        },
[1440]={
            {
                mapId = 4,x = 426,y = 306,z = -138,     --(银河竞技场)尼里伊斯
            },
        },
[1442]={
            {
                mapId = 4,x = 229,y = 311,z = -132,     --(银河竞技场)星矢
            },
        },
[1443]={
            {
                mapId = 4,x = 215,y = 310,z = -142,     --(银河竞技场)俄尼奥斯
            },
        },
[1445]={
            {
                mapId = 4,x = 317,y = 304,z = -206,     --(银河竞技场)黑暗随从
            },
        },
[1446]={
            {
                mapId = 4,x = 324,y = 309,z = -259,     --(银河竞技场)黑暗凤凰
            },
        },
[1447]={
            {
                mapId = 4,x = 283,y = 297,z = -339,     --(银河竞技场)圣域士兵
            },
        },
[1448]={
            {
                mapId = 4,x = 317,y = 296,z = -310,     --(银河竞技场)冥界士兵
            },
        },
[1449]={
            {
                mapId = 4,x = 308,y = 295,z = -300,     --(银河竞技场)哈迪斯
            },
        },
[1450]={
            {
                mapId = 4,x = 308,y = 295,z = -300,     --(银河竞技场)墨菲斯
            },
        },
[1451]={
            {
                mapId = 4,x = -100,y = 298,z = -338,     --(银河竞技场)黑暗侍从
            },
        },
[1452]={
            {
                mapId = 4,x = -13,y = 282,z = -126,     --(银河竞技场)黑暗大力士
            },
        },
[1453]={
            {
                mapId = 4,x = -6,y = 284,z = -12,     --(银河竞技场)黑暗护卫
            },
        },
[1454]={
            {
                mapId = 4,x = -5,y = 285,z = -38,     --(银河竞技场)黑暗天龙
            },
        },
[1455]={
            {
                mapId = 4,x = -46,y = 282,z = 31,     --(银河竞技场)黑暗潜伏者
            },
        },
[1456]={
            {
                mapId = 4,x = -130,y = 285,z = 38,     --(银河竞技场)白银随从
            },
        },
[1457]={
            {
                mapId = 4,x = -225,y = 283,z = -4,     --(银河竞技场)白银制裁者
            },
        },
[1458]={
            {
                mapId = 4,x = -232,y = 284,z = 17,     --(银河竞技场)索恩斯
            },
        },
[1460]={
            {
                mapId = 4,x = -315,y = 311,z = -117,     --(银河竞技场)黑暗无懈首领
            },
        },
[1462]={
            {
                mapId = 4,x = -328,y = 311,z = -98,     --(银河竞技场)黑暗仙女
            },
        },
[1464]={
            {
                mapId = 4,x = -364,y = 322,z = -150,     --(银河竞技场)黑暗极寒首领
            },
        },
[1466]={
            {
                mapId = 4,x = -390,y = 335,z = -215,     --(银河竞技场)黑暗白鸟
            },
        },
[1467]={
            {
                mapId = 4,x = -419,y = 338,z = -196,     --(银河竞技场)黑暗冲击者
            },
        },
[1468]={
            {
                mapId = 4,x = -438,y = 347,z = -127,     --(银河竞技场)黑暗碎击首领
            },
        },
[1469]={
            {
                mapId = 4,x = -414,y = 360,z = -55,     --(银河竞技场)黑暗天马
            },
        },
[1470]={
            {
                mapId = 4,x = -214,y = 283,z = -370,     --(银河竞技场)圣域士兵
            },
        },
[1471]={
            {
                mapId = 4,x = -274,y = 283,z = -371,     --(银河竞技场)摩西斯
            },
        },
[1472]={
            {
                mapId = 4,x = -354,y = 361,z = 75,     --(银河竞技场)乌鸦
            },
        },
[1473]={
            {
                mapId = 4,x = -311,y = 341,z = 57,     --(银河竞技场)加米安
            },
        },
[1474]={
            {
                mapId = 4,x = -312,y = 342,z = 97,     --(银河竞技场)圣域追兵
            },
        },
[1475]={
            {
                mapId = 4,x = -381,y = 359,z = 178,     --(银河竞技场)圣域追兵队长
            },
        },
[10611]={
            {
                mapId = 4,x = 276,y = 309,z = -149,     --(环任务)环任务邪武传记_幻之铃兰
            },
        },
[11518]={
            {
                mapId = 4,x = 314,y = 307,z = -162,     --(环任务)环任务邪武传记_树海梦灵
            },
        },
[1532]={
            {
                mapId = 3,x = -190,y = 411,z = 241,     --(庐山)庐山福地英灵
            },
        },
[1675]={
            {
                mapId = 3,x = 9,y = 340,z = -3,     --(庐山)支线挑战BOSSA
            },
        },
[1676]={
            {
                mapId = 3,x = 153,y = 464,z = 381,     --(庐山)支线挑战BOSSB
            },
        },
[9852]={
            {
                mapId = 3,x = -81,y = 326,z = -256,     --(庐山)庐山地龙
            },
        },
[11282]={
            {
                mapId = 3,x = -157,y = 313,z = -233,     --(庐山)庐山毒蛇小怪
            },
        },
[11283]={
            {
                mapId = 3,x = -103,y = 312,z = -170,     --(庐山)庐山圣域追击者小怪
            },
        },
[11284]={
            {
                mapId = 3,x = -23,y = 315,z = -160,     --(庐山)庐山尸气傀儡小怪
            },
        },
[11285]={
            {
                mapId = 3,x = -137,y = 312,z = -74,     --(庐山)庐山青铜傀儡小怪
            },
        },
[11286]={
            {
                mapId = 3,x = -190,y = 313,z = -24,     --(庐山)庐山逝去的战士小怪
            },
        },
[11287]={
            {
                mapId = 3,x = -59,y = 334,z = -84,     --(庐山)庐山黄金侍从小怪
            },
        },
[11288]={
            {
                mapId = 3,x = 2,y = 340,z = -78,     --(庐山)庐山中毒的庐山学员小怪
            },
        },
[11289]={
            {
                mapId = 3,x = -30,y = 336,z = 47,     --(庐山)庐山游荡的傀儡小怪
            },
        },
[11290]={
            {
                mapId = 3,x = 49,y = 372,z = 108,     --(庐山)庐山青铜衣魂小怪
            },
        },
[11291]={
            {
                mapId = 3,x = 107,y = 390,z = 146,     --(庐山)庐山不死衣魂小怪
            },
        },
[11292]={
            {
                mapId = 3,x = 18,y = 450,z = 293,     --(庐山)庐山神龙岭英灵小怪
            },
        },
[11293]={
            {
                mapId = 3,x = -129,y = 484,z = 249,     --(庐山)庐山龙龟小怪
            },
        },
[11294]={
            {
                mapId = 3,x = -168,y = 482,z = 204,     --(庐山)庐山白银衣魂小怪
            },
        },
[11295]={
            {
                mapId = 3,x = 119,y = 445,z = 289,     --(庐山)庐山复活的冥兵小怪
            },
        },
[11296]={
            {
                mapId = 3,x = 156,y = 463,z = 328,     --(庐山)庐山复活的圣斗士小怪
            },
        },
[10692]={
            {
                mapId = 2,x = 132,y = 290,z = -170,     --(圣域)星座1失控的学员
            },
        },
[10693]={
            {
                mapId = 4,x = 280,y = 318,z = 116,     --(银河竞技场)星座1伪装圣斗士的蒙脸人
            },
        },
[10698]={
            {
                mapId = 4,x = 445,y = 312,z = 175,     --(银河竞技场)星座1假扮圣斗士的学员
            },
        },
[12200]={
            {
                mapId = 4,x = 251,y = 312,z = -198,     --(银河竞技场)星座1梦神幻影
            },
        },
[10703]={
            {
                mapId = 4,x = 54,y = 294,z = -285,     --(银河竞技场)星座1母蛇
            },
        },
[10706]={
            {
                mapId = 4,x = 1,y = 295,z = -337,     --(银河竞技场)星座1顽皮的猴子
            },
        },
[10707]={
            {
                mapId = 3,x = -307,y = 330,z = 19,     --(庐山)星座1云凯的师弟
            },
        },
[10708]={
            {
                mapId = 3,x = -93,y = 314,z = 70,     --(庐山)星座1云凯的师兄
            },
        },
[10709]={
            {
                mapId = 3,x = -36,y = 329,z = -4,     --(庐山)星座1云凯
            },
        },
[10710]={
            {
                mapId = 3,x = -38,y = 335,z = -101,     --(庐山)星座1神秘杂兵
            },
        },
[10714]={
            {
                mapId = 3,x = -4,y = 342,z = 51,     --(庐山)星座1妖灵
            },
        },
[10717]={
            {
                mapId = 3,x = 117,y = 455,z = 309,     --(庐山)星座1黑暗兽影的分身
            },
        },
[10718]={
            {
                mapId = 3,x = 128,y = 456,z = 305,     --(庐山)星座1地狱幽灵
            },
        },
[12356]={
            {
                mapId = 4,x = 112,y = 285,z = -297,     --(环任务)棕熊兽
            },
        },
[12358]={
            {
                mapId = 4,x = -47,y = 282,z = -150,     --(环任务)神隐之狼
            },
        },
[12362]={
            {
                mapId = 2,x = -160,y = 309,z = -56,     --(环任务)图腾狼
            },
        },
[12363]={
            {
                mapId = 2,x = 272,y = 297,z = -31,     --(环任务)邪恶炼金术士
            },
        },
[12366]={
            {
                mapId = 3,x = -42,y = 326,z = -269,     --(环任务)圣域刺客
            },
        },
[12375]={
            {
                mapId = 3,x = -163,y = 310,z = -11,     --(环任务)黄泉怨灵
            },
        },
[12376]={
            {
                mapId = 3,x = -177,y = 311,z = -172,     --(环任务)螃蟹
            },
        },
[12367]={
            {
                mapId = 4,x = 418,y = 304,z = -134,     --(环任务)贪婪行者
            },
        },
[12377]={
            {
                mapId = 3,x = -47,y = 320,z = -136,     --(环任务)邪恶修炼者
            },
        },
[12652]={
            {
                mapId = 2,x = 363,y = 304,z = -174,     --(环任务)泰坦的邪念
            },
        },
[12359]={
            {
                mapId = 4,x = 16,y = 282,z = -153,     --(环任务)堕落修炼者
            },
        },
[12877]={
            {
                mapId = 3,x = 2,y = 340,z = -97,     --(庐山)竹笋
            },
        },
[12876]={
            {
                mapId = 3,x = 2,y = 340,z = -97,     --(庐山)竹苗
            },
        },
[12875]={
            {
                mapId = 3,x = 2,y = 340,z = -97,     --(庐山)竹子
            },
        },
[1672]={
            {
                mapId = 3,x = 5,y = 340,z = -89,     --(庐山)竹枝小蜂
            },
        },
[4824]={
            {
                mapId = 4,x = 180,y = 320,z = 310,     --(银河竞技场)支线01银都市_未上色的画
            },
        },
[4825]={
            {
                mapId = 4,x = 180,y = 320,z = 310,     --(银河竞技场)支线02银都市_上色的画
            },
        },
[4826]={
            {
                mapId = 4,x = 374,y = 305,z = -75,     --(银河竞技场)支线03青木原树海_冥界进犯者
            },
        },
[20621]={
            {
                mapId = 4,x = 36,y = 284,z = -163,     --(银河竞技场)支线04红叶断崖_卡泰林
            },
        },
[12848]={
            {
                mapId = 4,x = 167,y = 285,z = -342,     --(银河竞技场)支线30青木原树海_邪恶守卫
            },
        },
[12425]={
            {
                mapId = 4,x = -382,y = 363,z = 79,     --(银河竞技场)支线05红叶断崖_水罐策略
            },
        },
[12563]={
            {
                mapId = 4,x = 287,y = 312,z = 38,     --(银河竞技场)星座三熊
            },
        },
[12574]={
            {
                mapId = 3,x = -71,y = 314,z = 79,     --(银河竞技场)星座三云光的好友
            },
        },
[12562]={
            {
                mapId = 4,x = 210,y = 315,z = 175,     --(银河竞技场)星座三斗篷人弱
            },
        },
[12567]={
            {
                mapId = 4,x = 206,y = 315,z = 171,     --(银河竞技场)星座三斗篷人强
            },
        },
[12573]={
            {
                mapId = 4,x = 303,y = 303,z = -282,     --(银河竞技场)星座三黑色身影
            },
        },
[12607]={
            {
                mapId = 4,x = 88,y = 283,z = -360,     --(银河竞技场)星座三斗篷人精英
            },
        },
[12575]={
            {
                mapId = 3,x = 24,y = 340,z = -13,     --(银河竞技场)星座三中毒的庐山学员
            },
        },
[12576]={
            {
                mapId = 3,x = 17,y = 339,z = -1,     --(银河竞技场)星座三残暴的庐山学员
            },
        },
[12588]={
            {
                mapId = 3,x = 144,y = 463,z = 372,     --(银河竞技场)星座三黑色气息
            },
        },
[12587]={
            {
                mapId = 3,x = -85,y = 326,z = -245,     --(银河竞技场)星座三黑暗幽灵
            },
        },
[12561]={
            {
                mapId = 2,x = 80,y = 300,z = -165,     --(圣域)星座三邪恶怪物
            },
        },
[12560]={
            {
                mapId = 2,x = 265,y = 300,z = -1,     --(圣域)星座三师父
            },
        },
[11261]={
            {
                mapId = 4,x = 209,y = 316,z = 332,     --(银河竞技场)小怪_01古拉杜财团猎犬
            },
        },
[11262]={
            {
                mapId = 4,x = 402,y = 313,z = 204,     --(银河竞技场)小怪_02黑暗修炼者
            },
        },
[11263]={
            {
                mapId = 4,x = 299,y = 317,z = 232,     --(银河竞技场)小怪_03黑暗预备生
            },
        },
[11264]={
            {
                mapId = 4,x = 398,y = 305,z = -70,     --(银河竞技场)小怪_04幻灵
            },
        },
[11265]={
            {
                mapId = 4,x = 211,y = 310,z = -130,     --(银河竞技场)小怪_05亡魂
            },
        },
[11266]={
            {
                mapId = 4,x = 293,y = 297,z = -335,     --(银河竞技场)小怪_06圣斗士预备生
            },
        },
[11267]={
            {
                mapId = 4,x = -145,y = 286,z = 32,     --(银河竞技场)小怪_07圣域修炼者
            },
        },
[11268]={
            {
                mapId = 4,x = -209,y = 283,z = -366,     --(银河竞技场)小怪_08圣域护卫军
            },
        },
[11552]={
            {
                mapId = 4,x = -96,y = 298,z = -340,     --(银河竞技场)小怪_09天龙随从
            },
        },
[11553]={
            {
                mapId = 4,x = 423,y = 310,z = -60,     --(银河竞技场)小怪_10黑暗军团喽啰
            },
        },
[11554]={
            {
                mapId = 4,x = -338,y = 313,z = -125,     --(银河竞技场)小怪_11黑暗军团战士
            },
        },
[13406]={
            {
                mapId = 4,x = 325,y = 305,z = -211,     --(银河竞技场)小怪_13黑暗军团士兵
            },
        },
[13407]={
            {
                mapId = 4,x = -7,y = 282,z = -123,     --(银河竞技场)小怪_14黑暗军团随从
            },
        },
[13408]={
            {
                mapId = 4,x = -45,y = 283,z = 24,     --(银河竞技场)小怪_15黑暗军团护卫
            },
        },
[13409]={
            {
                mapId = 4,x = -8,y = 284,z = -15,     --(银河竞技场)小怪_16黑暗军团杂兵
            },
        },
[13410]={
            {
                mapId = 4,x = -211,y = 283,z = 4,     --(银河竞技场)小怪_17圣斗士候补生
            },
        },
[10751]={
            {
                mapId = 4,x = 245,y = 314,z = 133,     --(银河竞技场)主线72银都市_警犬
            },
        },
[13404]={
            {
                mapId = 4,x = 129,y = 285,z = -321,     --(银河竞技场)支线31铃之村狂暴野狼
            },
        },
[13405]={
            {
                mapId = 4,x = 129,y = 285,z = -321,     --(银河竞技场)小怪12铃之村幼狼
            },
        },
[13507]={
            {
                mapId = LEAGUE_BASE,x = -93,y = 350,z = -240,     --(军团基地)圣斗士英灵
            },
        },
[13067]={
            {
                mapId = 2,x = -162,y = 339,z = 412,     --(圣域)圣域士兵
            },
        },
[13068]={
            {
                mapId = 2,x = 36,y = 291,z = 60,     --(圣域)发狂的侍从
            },
        },
[13070]={
            {
                mapId = 2,x = 27,y = 289,z = 79,     --(圣域)发狂的候补生
            },
        },
[13071]={
            {
                mapId = 2,x = 291,y = 298,z = -59,     --(圣域)发狂的营地守卫
            },
        },
[13072]={
            {
                mapId = 2,x = 291,y = 298,z = -59,     --(圣域)暴躁的营地守卫
            },
        },
[13073]={
            {
                mapId = 2,x = 372,y = 289,z = -353,     --(圣域)冥蝮蛇
            },
        },
[13074]={
            {
                mapId = 2,x = 372,y = 289,z = -353,     --(圣域)冥蛇
            },
        },
[13075]={
            {
                mapId = 2,x = 393,y = 318,z = -91,     --(圣域)血腥英灵
            },
        },
[13077]={
            {
                mapId = 2,x = 393,y = 318,z = -91,     --(圣域)污秽英灵
            },
        },
[13078]={
            {
                mapId = 2,x = 270,y = 303,z = -263,     --(圣域)灵魂追猎者
            },
        },
[13079]={
            {
                mapId = 2,x = 270,y = 303,z = -263,     --(圣域)灵魂搜寻者
            },
        },
[13081]={
            {
                mapId = 2,x = 3,y = 317,z = -404,     --(圣域)冥界突击兵
            },
        },
[13082]={
            {
                mapId = 2,x = 3,y = 317,z = -404,     --(圣域)冥界先锋
            },
        },
[13083]={
            {
                mapId = 2,x = 115,y = 305,z = -394,     --(圣域)再生银甲
            },
        },
[13084]={
            {
                mapId = 2,x = 115,y = 305,z = -394,     --(圣域)再生铁甲
            },
        },
[13085]={
            {
                mapId = 2,x = -13,y = 297,z = 297,     --(圣域)发狂的圣域士兵
            },
        },
[13087]={
            {
                mapId = 2,x = -13,y = 297,z = 297,     --(圣域)暴躁的圣域士兵
            },
        },
[13088]={
            {
                mapId = 2,x = 181,y = 321,z = 308,     --(圣域)冥界嗔怒者
            },
        },
[13089]={
            {
                mapId = 2,x = 181,y = 321,z = 308,     --(圣域)冥界贪婪者
            },
        },
[13090]={
            {
                mapId = 2,x = 95,y = 324,z = 396,     --(圣域)撒密安的侍从
            },
        },
[13091]={
            {
                mapId = 2,x = 95,y = 324,z = 396,     --(圣域)乌鸦
            },
        },
[13092]={
            {
                mapId = 2,x = 138,y = 322,z = 342,     --(圣域)渗透者
            },
        },
[13093]={
            {
                mapId = 2,x = 283,y = 314,z = 148,     --(圣域)地狱守门人
            },
        },
[13094]={
            {
                mapId = 2,x = 283,y = 314,z = 148,     --(圣域)地狱卫士
            },
        },
[13095]={
            {
                mapId = 2,x = 290,y = 350,z = 264,     --(圣域)冥界近卫队长
            },
        },
[13096]={
            {
                mapId = 2,x = 290,y = 350,z = 264,     --(圣域)冥界近卫军
            },
        },
[13097]={
            {
                mapId = 2,x = 178,y = 293,z = -6,     --(圣域)发狂的炼金师
            },
        },
[13098]={
            {
                mapId = 2,x = 332,y = 289,z = -345,     --(圣域)冥蝮蛇王
            },
        },
[13099]={
            {
                mapId = 2,x = 419,y = 314,z = -59,     --(圣域)天马星魂
            },
        },
[13100]={
            {
                mapId = 2,x = 221,y = 313,z = -259,     --(圣域)阿历克斯
            },
        },
[13101]={
            {
                mapId = 2,x = 115,y = 291,z = 64,     --(圣域)达巴兰西
            },
        },
[13102]={
            {
                mapId = 2,x = 184,y = 328,z = 194,     --(圣域)赛巴斯蒂安
            },
        },
[13103]={
            {
                mapId = 2,x = 183,y = 323,z = 247,     --(圣域)冥界三头犬
            },
        },
[13104]={
            {
                mapId = 2,x = 302,y = 361,z = 300,     --(圣域)约尔曼冈德
            },
        },
[13105]={
            {
                mapId = 2,x = 387,y = 397,z = 397,     --(圣域)阿历克斯
            },
        },
[13607]={
            {
                mapId = 2,x = 377,y = 396,z = 349,     --(圣域)冥王神衣
            },
        },
[10691]={
            {
                mapId = 2,x = 43,y = 291,z = 96,     --(圣域)尼亚怪物
            },
        },
[432]={
            {
                mapId = 303,x = 608,y = 68,z = -1846,     --(剧本：勇闯十二宫)白羊宫守卫
            },
        },
[434]={
            {
                mapId = 303,x = 513,y = 74,z = -1854,     --(剧本：勇闯十二宫)水晶墙
            },
        },
[440]={
            {
                mapId = 303,x = 207,y = 96,z = -1608,     --(剧本：勇闯十二宫)金牛宫守卫
            },
        },
[443]={
            {
                mapId = 303,x = 335,y = 108,z = -1495,     --(剧本：勇闯十二宫)阿鲁迪巴
            },
        },
[15505]={
            {
                mapId = 309,x = -419,y = 311,z = -11,     --(剧情副本：欺瞒神的男人)
            },
        },
[15506]={
            {
                mapId = 309,x = -419,y = 311,z = -11,     --(剧情副本：欺瞒神的男人)
            },
        },
[15507]={
            {
                mapId = 309,x = -399,y = 311,z = 82,     --(剧情副本：欺瞒神的男人)
            },
        },
[15508]={
            {
                mapId = 309,x = -399,y = 311,z = 82,     --(剧情副本：欺瞒神的男人)
            },
        },
[15879]={
            {
                mapId = 5,x = -135,y = 288,z = -398,     --(遗忘之路)支线01流放峡谷_灰鼠
            },
        },
[15880]={
            {
                mapId = 5,x = -64,y = 288,z = -414,     --(遗忘之路)支线02流放峡谷_峡谷狼
            },
        },
[15881]={
            {
                mapId = 5,x = -136,y = 290,z = -388,     --(遗忘之路)支线03流放峡谷_佐拉顿
            },
        },
[15882]={
            {
                mapId = 5,x = -70,y = 313,z = -152,     --(遗忘之路)支线04遗忘之村_冥界异化者
            },
        },
[15883]={
            {
                mapId = 5,x = -68,y = 311,z = -133,     --(遗忘之路)支线05遗忘之村_彭索斯冥化
            },
        },
[15884]={
            {
                mapId = 5,x = 26,y = 308,z = -141,     --(遗忘之路)支线06遗忘之村_拉格雷斯异化
            },
        },
[15885]={
            {
                mapId = 5,x = 57,y = 307,z = -108,     --(遗忘之路)支线07遗忘之村_冥界隐匿者
            },
        },
[15886]={
            {
                mapId = 5,x = 57,y = 307,z = -108,     --(遗忘之路)支线08遗忘之村_冥界隐匿者显形
            },
        },
[15887]={
            {
                mapId = 5,x = -63,y = 294,z = -383,     --(遗忘之路)支线09流放峡谷_米莲娜
            },
        },
[15888]={
            {
                mapId = 5,x = 4,y = 314,z = -420,     --(遗忘之路)支线10流放峡谷_埃雷
            },
        },
[15892]={
            {
                mapId = 5,x = -130,y = 340,z = 73,     --(遗忘之路)支线14遗忘之村_异变的村民
            },
        },
[15893]={
            {
                mapId = 5,x = -100,y = 330,z = 43,     --(遗忘之路)支线15海滩_海妖纳格雅
            },
        },
[15894]={
            {
                mapId = 5,x = -293,y = 365,z = 126,     --(遗忘之路)支线16波塞冬神殿_海斗士灵魂
            },
        },
[15897]={
            {
                mapId = 5,x = -126,y = 340,z = 135,     --(遗忘之路)支线19波塞冬神殿_白夜
            },
        },
[15898]={
            {
                mapId = 5,x = 18,y = 308,z = -129,     --(遗忘之路)支线20遗忘之村_异兽
            },
        },
[15901]={
            {
                mapId = 5,x = -71,y = 287,z = -418,     --(遗忘之路)支线23流放峡谷_食腐秃鹫
            },
        },
[15903]={
            {
                mapId = 5,x = 12,y = 308,z = -143,     --(遗忘之路)支线25遗忘之村_地鼠策略
            },
        },
[15904]={
            {
                mapId = 5,x = -2,y = 305,z = -193,     --(遗忘之路)支线26遗忘之村_火焰策略
            },
        },
[15906]={
            {
                mapId = 5,x = -84,y = 307,z = 243,     --(遗忘之路)支线28海滩_鱼策略
            },
        },
[15909]={
            {
                mapId = 5,x = -22,y = 313,z = -159,     --(遗忘之路)支线31遗忘之村_彭索斯病倒策略
            },
        },
[15916]={
            {
                mapId = 5,x = 268,y = 388,z = -283,     --(遗忘之路)支线38命运神殿_嗜血的艾欧里亚策略
            },
        },
[16908]={
            {
                mapId = 1,x = -339,y = 329,z = 77,     --(群星之地)群星_01嚣张的候补生
            },
        },
[16909]={
            {
                mapId = 1,x = -257,y = 308,z = -69,     --(群星之地)群星_02狡诈的候补生
            },
        },
[16910]={
            {
                mapId = 1,x = -80,y = 375,z = 425,     --(群星之地)群星_03狂暴的英灵
            },
        },
[16911]={
            {
                mapId = 1,x = 152,y = 421,z = 326,     --(群星之地)群星_04星楼怨灵
            },
        },
[16912]={
            {
                mapId = 1,x = 128,y = 421,z = 311,     --(群星之地)群星_05冥界暗影
            },
        },
[16913]={
            {
                mapId = 1,x = -322,y = 332,z = 182,     --(群星之地)群星_06白银追击者
            },
        },
[16914]={
            {
                mapId = 1,x = -322,y = 332,z = 182,     --(群星之地)群星_07白银侍从
            },
        },
[17226]={
            {
                mapId = 2,x = -165,y = 339,z = 347,     --(新版圣域)01训练中的士兵大
            },
        },
[17227]={
            {
                mapId = 2,x = 35,y = 289,z = 87,     --(新版圣域)02疯狂的候补生1群
            },
        },
[17228]={
            {
                mapId = 2,x = 35,y = 289,z = 87,     --(新版圣域)03疯狂的候补生2群
            },
        },
[17229]={
            {
                mapId = 2,x = 169,y = 292,z = -10,     --(新版圣域)04冥界黑影头目
            },
        },
[17230]={
            {
                mapId = 2,x = 292,y = 297,z = -68,     --(新版圣域)05疯狂的士兵1大
            },
        },
[17231]={
            {
                mapId = 2,x = 292,y = 297,z = -68,     --(新版圣域)06疯狂的士兵2小
            },
        },
[17232]={
            {
                mapId = 2,x = 420,y = 318,z = -104,     --(新版圣域)07圣斗士英灵群
            },
        },
[17233]={
            {
                mapId = 2,x = 421,y = 314,z = -54,     --(新版圣域)08天马圣衣英灵头目
            },
        },
[17234]={
            {
                mapId = 2,x = 291,y = 303,z = -251,     --(新版圣域)09冥界喽啰1群
            },
        },
[17235]={
            {
                mapId = 2,x = 291,y = 303,z = -251,     --(新版圣域)10冥界喽啰2群
            },
        },
[17236]={
            {
                mapId = 2,x = 222,y = 313,z = -257,     --(新版圣域)11阿历克斯古战场头目
            },
        },
[17237]={
            {
                mapId = 2,x = -13,y = 297,z = 296,     --(新版圣域)12冥蝮蛇群
            },
        },
[17238]={
            {
                mapId = 2,x = 186,y = 323,z = 243,     --(新版圣域)13冥界士兵群
            },
        },
[17239]={
            {
                mapId = 2,x = 184,y = 326,z = 212,     --(新版圣域)14冥兵队长头目
            },
        },
[17240]={
            {
                mapId = 2,x = 80,y = 324,z = 395,     --(新版圣域)15加米安的侍从大
            },
        },
[17241]={
            {
                mapId = 2,x = 80,y = 324,z = 395,     --(新版圣域)16加米安的乌鸦小
            },
        },
[17242]={
            {
                mapId = 2,x = -31,y = 297,z = 328,     --(新版圣域)18冥界刺客头目
            },
        },
[17243]={
            {
                mapId = 2,x = 180,y = 334,z = 414,     --(新版圣域)19阿历克斯神殿头目
            },
        },
[17244]={
            {
                mapId = 2,x = 267,y = 319,z = 151,     --(新版圣域)20冥界战士群
            },
        },
[17245]={
            {
                mapId = 2,x = 283,y = 349,z = 265,     --(新版圣域)21冥界精兵1群
            },
        },
[17246]={
            {
                mapId = 2,x = 283,y = 349,z = 265,     --(新版圣域)22冥界精兵2群
            },
        },
[17247]={
            {
                mapId = 2,x = 302,y = 361,z = 304,     --(新版圣域)23冥界巨蟒头目
            },
        },
[17248]={
            {
                mapId = 2,x = 362,y = 397,z = 403,     --(新版圣域)24冥界念力师
            },
        },
[17249]={
            {
                mapId = 2,x = 375,y = 396,z = 405,     --(新版圣域)25阿历克斯山顶BOSS
            },
        },
[17250]={
            {
                mapId = 2,x = 76,y = 294,z = 6,     --(新版圣域)龙套01受伤的候补生营地
            },
        },
[18002]={
            {
                mapId = 1,x = -444,y = 371,z = -16,     --(群星之地)群星_08训练石块怪
            },
        },
[18121]={
            {
                mapId = 4,x = -107,y = 311,z = -267,     --(银河竞技场)支线单人挑战boss铃之村白虎
            },
        },
[18122]={
            {
                mapId = 4,x = 403,y = 313,z = 414,     --(银河竞技场)支线单人挑战boss银都市崔恩科
            },
        },
[17574]={
            {
                mapId = 5,x = -123,y = 308,z = 226,     --(环任务)陶罐邪念
            },
        },
[17575]={
            {
                mapId = 4,x = 2,y = 284,z = 0,     --(环任务)迷之刺杀者
            },
        },
[17576]={
            {
                mapId = 6,x = -149,y = 336,z = -312,     --(环任务)淘金侍卫
            },
        },
[17577]={
            {
                mapId = 6,x = -232,y = 351,z = -57,     --(环任务)黑暗守卫
            },
        },
[17578]={
            {
                mapId = 6,x = 198,y = 346,z = -225,     --(环任务)黑暗游荡者
            },
        },
[17579]={
            {
                mapId = 6,x = -108,y = 348,z = -252,     --(环任务)残酷监工
            },
        },
[17580]={
            {
                mapId = 6,x = -199,y = 328,z = -395,     --(环任务)游荡监工
            },
        },
[17581]={
            {
                mapId = 6,x = 10,y = 334,z = 7,     --(环任务)黑暗斗士
            },
        },
[17582]={
            {
                mapId = 6,x = 118,y = 355,z = -225,     --(环任务)杀戮监工
            },
        },
[17583]={
            {
                mapId = 5,x = -57,y = 310,z = -127,     --(环任务)影斗士
            },
        },
[16434]={
            {
                mapId = 5,x = -179,y = 294,z = -363,     --(遗忘之路)放逐者
            },
        },
[16435]={
            {
                mapId = 5,x = 113,y = 321,z = -425,     --(遗忘之路)远古灵魂
            },
        },
[16436]={
            {
                mapId = 5,x = 197,y = 373,z = -277,     --(遗忘之路)遗忘强盗
            },
        },
[16437]={
            {
                mapId = 5,x = 95,y = 330,z = -254,     --(遗忘之路)狼
            },
        },
[16438]={
            {
                mapId = 5,x = -189,y = 326,z = -221,     --(遗忘之路)影斗士小
            },
        },
[16439]={
            {
                mapId = 5,x = -189,y = 326,z = -221,     --(遗忘之路)影斗士大
            },
        },
[16440]={
            {
                mapId = 5,x = -39,y = 308,z = -222,     --(遗忘之路)圣域镇压者
            },
        },
[16441]={
            {
                mapId = 5,x = 66,y = 308,z = 166,     --(遗忘之路)海魔
            },
        },
[16444]={
            {
                mapId = 5,x = -23,y = 310,z = 111,     --(遗忘之路)海盗水手
            },
        },
[16445]={
            {
                mapId = 5,x = 74,y = 317,z = 67,     --(遗忘之路)海盗战士
            },
        },
[16443]={
            {
                mapId = 5,x = 223,y = 335,z = -16,     --(遗忘之路)索罗侍卫
            },
        },
[16446]={
            {
                mapId = 5,x = 91,y = 319,z = 5,     --(遗忘之路)海盗船长
            },
        },
[16447]={
            {
                mapId = 5,x = 91,y = 319,z = 5,     --(遗忘之路)海盗队长
            },
        },
[16448]={
            {
                mapId = 5,x = -97,y = 308,z = 233,     --(遗忘之路)影子凤凰
            },
        },
[16449]={
            {
                mapId = 5,x = -194,y = 306,z = 260,     --(遗忘之路)狱灵
            },
        },
[16450]={
            {
                mapId = 5,x = -191,y = 355,z = 193,     --(遗忘之路)圣域杀手小
            },
        },
[16451]={
            {
                mapId = 5,x = -191,y = 355,z = 193,     --(遗忘之路)圣域杀手大
            },
        },
[19911]={
            {
                mapId = 5,x = 106,y = 310,z = -161,     --(遗忘之路)支线45遗忘之村_法比奥
            },
        },
[19912]={
            {
                mapId = 5,x = 37,y = 325,z = 48,     --(遗忘之路)支线46海滩_布莱克·沃特
            },
        },
[19913]={
            {
                mapId = 5,x = -197,y = 294,z = -366,     --(遗忘之路)支线47流放峡谷_多米尼克
            },
        },
[19914]={
            {
                mapId = 5,x = 39,y = 305,z = -239,     --(遗忘之路)支线48遗忘之村_费尔南
            },
        },
[19915]={
            {
                mapId = 5,x = -41,y = 306,z = 223,     --(遗忘之路)支线49海滩_利维坦
            },
        },
[19916]={
            {
                mapId = 5,x = -88.2794,y = 340.221,z = 120.503,     --(遗忘之路)支线50海滩_哈罗德
            },
        },
[19162]={
            {
                mapId = 6,x = 327,y = 319,z = -410,     --(死亡皇后岛)01黑暗爪牙
            },
        },
[19163]={
            {
                mapId = 6,x = 391,y = 339,z = -484,     --(死亡皇后岛)02黑暗监督者
            },
        },
[19164]={
            {
                mapId = 6,x = 208,y = 337,z = -326,     --(死亡皇后岛)03奴隶监工
            },
        },
[19165]={
            {
                mapId = 6,x = 159,y = 356,z = -220,     --(死亡皇后岛)04黑暗虐杀者
            },
        },
[19166]={
            {
                mapId = 6,x = 197,y = 346,z = -225,     --(死亡皇后岛)05黑暗豺狼座
            },
        },
[19167]={
            {
                mapId = 6,x = 122,y = 343,z = -408,     --(死亡皇后岛)06黑暗追击者
            },
        },
[19168]={
            {
                mapId = 6,x = -12,y = 351,z = -408,     --(死亡皇后岛)07食骨秃鹫
            },
        },
[19170]={
            {
                mapId = 6,x = -24,y = 360,z = -253,     --(死亡皇后岛)09血之黑暗斗士弱化前
            },
        },
[19171]={
            {
                mapId = 6,x = -24,y = 360,z = -253,     --(死亡皇后岛)10血之黑暗斗士弱化后
            },
        },
[19172]={
            {
                mapId = 6,x = 47,y = 363,z = -351,     --(死亡皇后岛)11黑暗守卫
            },
        },
[19173]={
            {
                mapId = 6,x = 70,y = 356,z = -139,     --(死亡皇后岛)12矿坑守卫
            },
        },
[19174]={
            {
                mapId = 6,x = -17,y = 355,z = -158,     --(死亡皇后岛)13黑暗水蛇座
            },
        },
[19175]={
            {
                mapId = 6,x = -156,y = 336,z = -248,     --(死亡皇后岛)14黑暗巡查者
            },
        },
[19176]={
            {
                mapId = 6,x = -146,y = 336,z = -304,     --(死亡皇后岛)15猎犬
            },
        },
[19177]={
            {
                mapId = 6,x = -204,y = 329,z = -403,     --(死亡皇后岛)16黑暗暗杀者
            },
        },
[19178]={
            {
                mapId = 6,x = -194,y = 331,z = -294,     --(死亡皇后岛)17黑暗裁决者
            },
        },
[19179]={
            {
                mapId = 6,x = -237,y = 352,z = -209,     --(死亡皇后岛)18矿道守护者
            },
        },
[19180]={
            {
                mapId = 6,x = -339,y = 365,z = 44,     --(死亡皇后岛)19暴虐的黑暗斗士
            },
        },
[19181]={
            {
                mapId = 6,x = -373,y = 368,z = 3,     --(死亡皇后岛)20黑暗搜查者
            },
        },
[19182]={
            {
                mapId = 6,x = -375,y = 368,z = 120,     --(死亡皇后岛)21犹疑的炼金术士
            },
        },
[19183]={
            {
                mapId = 6,x = -388,y = 367,z = 181,     --(死亡皇后岛)22邪恶的炼金术士
            },
        },
[19186]={
            {
                mapId = 6,x = -325,y = 345,z = 210,     --(死亡皇后岛)25黑暗狂斗士
            },
        },
[19187]={
            {
                mapId = 6,x = -264,y = 342,z = 316,     --(死亡皇后岛)26黑暗大熊座
            },
        },
[19188]={
            {
                mapId = 6,x = -181,y = 352,z = 20,     --(死亡皇后岛)27迷失的皇后岛学员变身前
            },
        },
[19189]={
            {
                mapId = 6,x = -181,y = 352,z = 20,     --(死亡皇后岛)28迷失的皇后岛学员变身后
            },
        },
[19190]={
            {
                mapId = 6,x = -61,y = 352,z = 10,     --(死亡皇后岛)29黑暗咆哮者
            },
        },
[19192]={
            {
                mapId = 6,x = 12,y = 308,z = 130,     --(死亡皇后岛)31嗜血的黑暗斗士
            },
        },
[19193]={
            {
                mapId = 6,x = 2,y = 327,z = 201,     --(死亡皇后岛)32黑暗幼狮座
            },
        },
[19194]={
            {
                mapId = 6,x = -116,y = 365,z = -124,     --(死亡皇后岛)33奴隶主
            },
        },
[19195]={
            {
                mapId = 6,x = -423,y = 370,z = 222,     --(死亡皇后岛)34黑暗独角兽座
            },
        },
[19196]={
            {
                mapId = 6,x = 87,y = 367,z = 225,     --(死亡皇后岛)35姜戈
            },
        },
[19255]={
            {
                mapId = 6,x = 100,y = 325,z = -16,     --(死亡皇后岛)94黑暗圣斗士的尸体
            },
        },
[20015]={
            {
                mapId = 6,x = 116,y = 343,z = -416,     --(死亡皇后岛)96被治疗的候补生
            },
        },
[19989]={
            {
                mapId = 6,x = -156,y = 355,z = -207,     --(死亡皇后岛)支线14奥贝斯坦
            },
        },
[19990]={
            {
                mapId = 6,x = -232,y = 352,z = -67,     --(死亡皇后岛)支线15毛毛
            },
        },
[19991]={
            {
                mapId = 6,x = -360,y = 368,z = 94,     --(死亡皇后岛)支线16销金
            },
        },
[19992]={
            {
                mapId = 6,x = -260,y = 370,z = 63,     --(死亡皇后岛)支线17银狼
            },
        },
[19993]={
            {
                mapId = 6,x = -124,y = 356,z = -176,     --(死亡皇后岛)支线18维达
            },
        },
[19994]={
            {
                mapId = 6,x = -488,y = 368,z = 102,     --(死亡皇后岛)支线19贤者之石
            },
        },
[16455]={
            {
                mapId = 5,x = 144,y = 319,z = -402,     --(遗忘之路)漂泊王
            },
        },
[16459]={
            {
                mapId = 5,x = 202,y = 310,z = -407,     --(遗忘之路)羊
            },
        },
[18833]={
            {
                mapId = 6,x = -123,y = 349,z = -229,     --(死亡皇后岛)支线卡耐尔变身boss 罗森达
            },
        },
[18834]={
            {
                mapId = 6,x = 144,y = 356,z = -223,     --(死亡皇后岛)支线监工队长
            },
        },
[18835]={
            {
                mapId = 6,x = -243,y = 352,z = -219,     --(死亡皇后岛)支线守护侍卫
            },
        },
[18836]={
            {
                mapId = 6,x = 29,y = 362,z = -358,     --(死亡皇后岛)支线赛普路斯
            },
        },
[18837]={
            {
                mapId = 6,x = -116,y = 347,z = -264,     --(死亡皇后岛)支线黑暗斗士
            },
        },
[18838]={
            {
                mapId = 6,x = -340,y = 335,z = -335,     --(死亡皇后岛)支线奴隶主侍者
            },
        },
[18839]={
            {
                mapId = 6,x = -319,y = 335,z = -357,     --(死亡皇后岛)支线黑暗影卫
            },
        },
[18840]={
            {
                mapId = 6,x = -67,y = 364,z = -50,     --(死亡皇后岛)支线黑暗血卫
            },
        },
[18841]={
            {
                mapId = 6,x = 6,y = 356,z = -204,     --(死亡皇后岛)支线黑暗天王
            },
        },
[18842]={
            {
                mapId = 6,x = -443,y = 368,z = -16,     --(死亡皇后岛)支线移民叛徒
            },
        },
[18843]={
            {
                mapId = 6,x = -131,y = 340,z = 49,     --(死亡皇后岛)支线麦里森
            },
        },
[18844]={
            {
                mapId = 6,x = -112,y = 345,z = 61,     --(死亡皇后岛)支线艾里
            },
        },
[18845]={
            {
                mapId = 6,x = -372,y = 356,z = 231,     --(死亡皇后岛)支线洪赛斯
            },
        },
[9860]={
            {
                mapId = 3,x = -82,y = 334,z = -100,     --(庐山)庐山李云异化
            },
        },
[19458]={
            {
                mapId = 3,x = -41,y = 326,z = -277,     --(庐山)庐山个人挑战BOSS1川宁
            },
        },
[19459]={
            {
                mapId = 3,x = -206,y = 483,z = 198,     --(庐山)庐山个人挑战BOSS2汀布拉
            },
        },
[19456]={
            {
                mapId = 3,x = -134,y = 313,z = -262,     --(庐山)庐山组队挑战BOSS1
            },
        },
[19457]={
            {
                mapId = 3,x = -148,y = 483,z = 294,     --(庐山)庐山组队挑战BOSS2
            },
        },
[16465]={
            {
                mapId = 5,x = -292,y = 355,z = 128,     --(遗忘之路)黄金幻像
            },
        },
[1427]={
            {
                mapId = 4,x = 222,y = 326,z = 383,     --(银河竞技场)银河竞技场主线邪武
            },
        },
[19460]={
            {
                mapId = 5,x = -125,y = 289,z = -406,     --(个人库)人形猛兽肖恩
            },
        },
[19461]={
            {
                mapId = 3,x = 143,y = 462,z = 331,     --(个人库)圣斗士英灵马雷萨斯
            },
        },
[19462]={
            {
                mapId = 4,x = 376,y = 301,z = -122,     --(个人库)恐惧梦魇
            },
        },
[19463]={
            {
                mapId = 5,x = 205,y = 312,z = -385,     --(个人库)邪神的化身
            },
        },
[19464]={
            {
                mapId = 4,x = -4,y = 285,z = -37,     --(个人库)地狱岛战士
            },
        },
[19465]={
            {
                mapId = 6,x = -228,y = 351,z = -74,     --(个人库)洞窟魅影
            },
        },
[19466]={
            {
                mapId = 6,x = 349,y = 320,z = -334,     --(个人库)人偶师爱德华
            },
        },
[19467]={
            {
                mapId = 2,x = 178.93,y = 293.406,z = -392.11,     --(个人库)黄泉恶灵
            },
        },
[19184]={
            {
                mapId = 6,x = -424,y = 371,z = 221,     --(死亡皇后岛)黑暗叛徒罗
            },
        },
[17301]={
            {
                mapId = 1,x = -142,y = 351,z = 147,     --(群星之地)艾德
            },
        },
[1499]={
            {
                mapId = 4,x = -224,y = 287,z = -85,     --(银河竞技场)拉娜
            },
        },
[20382]={
            {
                mapId = 5,x = 204,y = 318,z = -368,     --(遗忘之路)堕落宇宙
            },
        },
[18499]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)面具枫
            },
        },
[18500]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)巨蟹座
            },
        },
[18501]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)雷虎
            },
        },
[18502]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)梦神
            },
        },
[18503]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)空间兽
            },
        },
[18504]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)强戈
            },
        },
[18505]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)三头犬
            },
        },
[18506]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)尸王
            },
        },
[18507]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)乌鸦座
            },
        },
[18508]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)战神圣蛇
            },
        },
[10297]={
            {
                mapId = 4,x = 21,y = 284,z = 6,     --(银河竞技场)黑暗布雷者
            },
        },
[16442]={
            {
                mapId = 5,x = -13,y = 308,z = 156,     --(遗忘之路)海盗传令兵
            },
        },
[18672]={
            {
                mapId = 5,x = 245,y = 389,z = -256,     --(遗忘之路)命运线团
            },
        },
[18673]={
            {
                mapId = 5,x = 248,y = 389,z = -292,     --(遗忘之路)命运线头
            },
        },
[18674]={
            {
                mapId = 5,x = 300,y = 389,z = -270,     --(遗忘之路)命运线段
            },
        },
[20670]={
            {
                mapId = 5,x = -122,y = 290,z = -385,     --(遗忘之路)支线安德鲁森
            },
        },
[20685]={
            {
                mapId = 6,x = 70,y = 356,z = -139,     --(死亡皇后岛)恶奴
            },
        },
[20686]={
            {
                mapId = 6,x = -237,y = 352,z = -209,     --(死亡皇后岛)矿道黑鸦
            },
        },
[20684]={
            {
                mapId = 6,x = 327,y = 319,z = -410,     --(死亡皇后岛)黑暗守望者（主线）
            },
        },
[12354]={
            {
                mapId = 4,x = 121,y = 284,z = -355,     --(环任务)乐平
            },
        },
[12355]={
            {
                mapId = 4,x = 16,y = 282,z = -151,     --(环任务)黑暗老人
            },
        },
[12357]={
            {
                mapId = 4,x = 31,y = 285,z = -158,     --(环任务)翔
            },
        },
[12360]={
            {
                mapId = 2,x = -74,y = 307,z = -2,     --(环任务)卡西欧士
            },
        },
[12361]={
            {
                mapId = 2,x = 76,y = 302,z = -206,     --(环任务)命运斗士
            },
        },
[12374]={
            {
                mapId = 4,x = 334,y = 305,z = -223,     --(环任务)暗涌之灵
            },
        },
[12364]={
            {
                mapId = 2,x = 104,y = 291,z = 82,     --(环任务)斗篷人
            },
        },
[12365]={
            {
                mapId = 3,x = -119,y = 321,z = -221,     --(环任务)乌鸦
            },
        },
[12368]={
            {
                mapId = 3,x = 177,y = 324,z = 340,     --(环任务)斗篷人
            },
        },
[12369]={
            {
                mapId = 4,x = 347,y = 305,z = -156,     --(环任务)市--召唤
            },
        },
[12370]={
            {
                mapId = 4,x = 408,y = 304,z = -131,     --(环任务)黑暗劫掠者
            },
        },
[12371]={
            {
                mapId = 2,x = 39,y = 289,z = 77,     --(环任务)天马之魂
            },
        },
[12372]={
            {
                mapId = 2,x = 148,y = 291,z = -33,     --(环任务)古代巨狼
            },
        },
[12373]={
            {
                mapId = 2,x = 125,y = 289,z = -170,     --(环任务)古代巨狼
            },
        },
[12378]={
            {
                mapId = 3,x = -250,y = 313,z = -237,     --(环任务)暴君熊
            },
        },
[12379]={
            {
                mapId = 2,x = 328,y = 299,z = 171,     --(环任务)前圣域队长
            },
        },
[12651]={
            {
                mapId = 2,x = 378,y = 306,z = -160,     --(环任务)黑化的塞克斯塔
            },
        },
[17563]={
            {
                mapId = 5,x = -147,y = 326,z = -157,     --(环任务)铸剑大师
            },
        },
[17564]={
            {
                mapId = 5,x = -129,y = 308,z = 225,     --(环任务)海怪
            },
        },
[17565]={
            {
                mapId = 4,x = -4,y = 285,z = -42,     --(环任务)玛尔斯
            },
        },
[17566]={
            {
                mapId = 6,x = -332,y = 364,z = 51,     --(环任务)黑暗杂兵
            },
        },
[17567]={
            {
                mapId = 6,x = -301,y = 367,z = 135,     --(环任务)劳伦斯
            },
        },
[17568]={
            {
                mapId = 6,x = -238,y = 351,z = -79,     --(环任务)黑暗喽啰
            },
        },
[17569]={
            {
                mapId = 6,x = -246,y = 351,z = -231,     --(环任务)黑暗杂兵队长
            },
        },
[17570]={
            {
                mapId = 6,x = -237,y = 352,z = -219,     --(环任务)黑暗传令兵
            },
        },
[17571]={
            {
                mapId = 6,x = -225,y = 363,z = 28,     --(环任务)奴隶监工
            },
        },
[17572]={
            {
                mapId = 6,x = 189,y = 325,z = 3,     --(环任务)鸦
            },
        },
[17573]={
            {
                mapId = 6,x = 73,y = 356,z = -150,     --(环任务)矿坑守卫
            },
        },
[1461]={
            {
                mapId = 4,x = -322,y = 311,z = -100,     --(银河竞技场)小黑蛇
            },
        },
[20855]={
            {
                mapId = 3,x = -164,y = 483,z = 156,     --(庐山)庐山积尸气
            },
        },
[20912]={
            {
                mapId = 1,x = -142,y = 351,z = 147,     --(群星之地)艾德天马用
            },
        },
[20913]={
            {
                mapId = 1,x = -142,y = 351,z = 147,     --(群星之地)艾德白鸟用
            },
        },
[20914]={
            {
                mapId = 1,x = -142,y = 351,z = 147,     --(群星之地)艾德天龙用
            },
        },
[20915]={
            {
                mapId = 1,x = -142,y = 351,z = 147,     --(群星之地)艾德仙女用
            },
        },
[20916]={
            {
                mapId = 1,x = -142,y = 351,z = 147,     --(群星之地)艾德凤凰用
            },
        },
[18437]={
            {
                mapId = 302,x = 369,y = 294,z = -268,     --(剧本：黄泉之井)冥界喽啰
            },
        },
[18439]={
            {
                mapId = 302,x = 369,y = 289,z = -354,     --(剧本：黄泉之井)冥蝮蛇
            },
        },
[18440]={
            {
                mapId = 302,x = 355,y = 289,z = -359,     --(剧本：黄泉之井)冥蝮蛇王
            },
        },
[16250]={
            {
                mapId = 303,x = 588,y = 71,z = -1849,     --(剧本：勇闯十二宫)白羊宫守卫壮
            },
        },
[432]={
            {
                mapId = 303,x = 607,y = 68,z = -1847,     --(剧本：勇闯十二宫)白羊宫守卫
            },
        },
[15514]={
            {
                mapId = 303,x = 607,y = 68,z = -1847,     --(剧本：勇闯十二宫)白羊宫小兵
            },
        },
[434]={
            {
                mapId = 303,x = 513,y = 75,z = -1854,     --(剧本：勇闯十二宫)水晶墙
            },
        },
[441]={
            {
                mapId = 303,x = 243,y = 99,z = -1562,     --(剧本：勇闯十二宫)金牛宫守卫长
            },
        },
[16251]={
            {
                mapId = 303,x = 208,y = 96,z = -1610,     --(剧本：勇闯十二宫)金牛宫守卫壮
            },
        },
[440]={
            {
                mapId = 303,x = 243,y = 99,z = -1562,     --(剧本：勇闯十二宫)金牛宫守卫
            },
        },
[15515]={
            {
                mapId = 303,x = 208,y = 96,z = -1610,     --(剧本：勇闯十二宫)金牛宫小兵
            },
        },
[443]={
            {
                mapId = 303,x = 330,y = 108,z = -1499,     --(剧本：勇闯十二宫)阿鲁迪巴
            },
        },
[21000]={
            {
                mapId = 4,x = 361.667,y = 329.034,z = 302.629,     --(剧本：银河战争大地图版)大熊座檄
            },
        },
[21002]={
            {
                mapId = 4,x = 376.008,y = 331.132,z = 313.906,     --(剧本：银河战争大地图版)水蛇座市
            },
        },
[21003]={
            {
                mapId = 4,x = 383.595,y = 331.132,z = 316.65,     --(剧本：银河战争大地图版)天龙座紫龙
            },
        },
[21004]={
            {
                mapId = 4,x = 383.595,y = 331.132,z = 316.65,     --(剧本：银河战争大地图版)天狼座那智
            },
        },
[15505]={
            {
                mapId = 309,x = -418,y = 311,z = -11,     --(剧本:欺瞒神的男人)
            },
        },
[15506]={
            {
                mapId = 309,x = -418,y = 311,z = -11,     --(剧本:欺瞒神的男人)
            },
        },
[21403]={
            {
                mapId = 7,x = -278,y = 292,z = 288,     --(东西伯利亚)主线01科霍提克村_饥饿的熊
            },
        },
[21404]={
            {
                mapId = 7,x = -100,y = 300,z = 294,     --(东西伯利亚)主线02修炼地_掉落的冰块
            },
        },
[21405]={
            {
                mapId = 7,x = -305,y = 295,z = 218,     --(东西伯利亚)主线03黑暗森林_森林狼
            },
        },
[21406]={
            {
                mapId = 7,x = -305,y = 295,z = 218,     --(东西伯利亚)主线04黑暗森林_森林幼狼
            },
        },
[21407]={
            {
                mapId = 7,x = -87,y = 297,z = 133,     --(东西伯利亚)主线05雪落村_暗冰搜索者
            },
        },
[21408]={
            {
                mapId = 7,x = -280,y = 300,z = -109,     --(东西伯利亚)主线06雪落村_暗冰入侵者
            },
        },
[21409]={
            {
                mapId = 7,x = -334,y = 294,z = -197,     --(东西伯利亚)主线07冰点哨塔_暗冰哨兵
            },
        },
[21410]={
            {
                mapId = 7,x = -235,y = 300,z = -208,     --(东西伯利亚)主线08冰点哨塔_冰刺
            },
        },
[21411]={
            {
                mapId = 7,x = -142,y = 318,z = -138,     --(东西伯利亚)主线09冰点哨塔_艾尔扎克
            },
        },
[21412]={
            {
                mapId = 7,x = -246,y = 296,z = -238,     --(东西伯利亚)主线10魔鬼礁群_暗冰黒礁斗士
            },
        },
[21413]={
            {
                mapId = 7,x = -344,y = 296,z = -284,     --(东西伯利亚)主线11魔鬼礁群_暗冰看守者
            },
        },
[21414]={
            {
                mapId = 7,x = 263,y = 258,z = -315,     --(东西伯利亚)主线12世界之树_海界入侵者
            },
        },
[21415]={
            {
                mapId = 7,x = 350,y = 261,z = -317,     --(东西伯利亚)主线13世界之树_帕尔塞涅
            },
        },
[21416]={
            {
                mapId = 7,x = 380,y = 320,z = -100,     --(东西伯利亚)主线14风息谷_北欧神狼
            },
        },
[21417]={
            {
                mapId = 7,x = 360,y = 320,z = 80,     --(东西伯利亚)主线15暗冰前哨_暗冰北风斗士
            },
        },
[21418]={
            {
                mapId = 7,x = 221,y = 327,z = 107,     --(东西伯利亚)主线16暗冰前哨_撒卡迪
            },
        },
[21419]={
            {
                mapId = 7,x = 280,y = 324,z = 104,     --(东西伯利亚)主线17暗冰前哨_欢歌海妖
            },
        },
[21420]={
            {
                mapId = 7,x = 145,y = 314,z = 100,     --(东西伯利亚)主线18极光雪原_暗冰极光斗士
            },
        },
[21421]={
            {
                mapId = 7,x = 125,y = 315,z = 75,     --(东西伯利亚)主线19极光雪原_极光女斗士
            },
        },
[21422]={
            {
                mapId = 7,x = -15,y = 290,z = 78,     --(东西伯利亚)主线20极光雪原_海妖侍从
            },
        },
[21423]={
            {
                mapId = 7,x = -78,y = 291,z = 40,     --(东西伯利亚)主线21极光雪原_极光白熊
            },
        },
[21424]={
            {
                mapId = 7,x = 36,y = 296,z = 142,     --(东西伯利亚)主线22极光雪原_艾尔扎克
            },
        },
[21425]={
            {
                mapId = 7,x = 150,y = 383,z = 284,     --(东西伯利亚)主线23蓝冰堡_暗冰守卫
            },
        },
[21426]={
            {
                mapId = 7,x = 80,y = 370,z = 328,     --(东西伯利亚)主线24蓝冰堡_蔚蓝近卫
            },
        },
[21427]={
            {
                mapId = 7,x = 207,y = 370,z = 397,     --(东西伯利亚)主线25蓝冰堡_亚雷库萨
            },
        },
[21428]={
            {
                mapId = 7,x = 290,y = 383,z = 435,     --(东西伯利亚)主线26蓝冰堡_艾尔扎克
            },
        },
[21429]={
            {
                mapId = 7,x = 346,y = 393,z = 462,     --(东西伯利亚)主线27蓝冰堡_加隆
            },
        },
[21516]={
            {
                mapId = 7,x = 11,y = 289,z = -14,     --(东西伯利亚)主线28极光雪原_魅影海妖
            },
        },
[22239]={
            {
                mapId = 8,x = -290,y = 362,z = -404,     --(亚特兰蒂斯)主线01海蟹
            },
        },
[22242]={
            {
                mapId = 8,x = -331,y = 367,z = -7,     --(亚特兰蒂斯)主线04海斗士奸细
            },
        },
[22243]={
            {
                mapId = 8,x = -317,y = 340,z = -192,     --(亚特兰蒂斯)主线05海盗头目蒂奇
            },
        },
[22244]={
            {
                mapId = 8,x = -287,y = 375,z = 47,     --(亚特兰蒂斯)主线06海马斗士
            },
        },
[22245]={
            {
                mapId = 8,x = -53,y = 336,z = 34,     --(亚特兰蒂斯)主线07塞壬女妖
            },
        },
[22246]={
            {
                mapId = 8,x = -53,y = 336,z = 34,     --(亚特兰蒂斯)主线08小塞壬
            },
        },
[22247]={
            {
                mapId = 8,x = 69,y = 334,z = -274,     --(亚特兰蒂斯)主线09冰狼
            },
        },
[22248]={
            {
                mapId = 8,x = 59,y = 328,z = -426,     --(亚特兰蒂斯)主线10圣蛇
            },
        },
[22249]={
            {
                mapId = 8,x = 83,y = 337,z = -345,     --(亚特兰蒂斯)主线11巨熊
            },
        },
[22250]={
            {
                mapId = 8,x = 173,y = 350,z = -356,     --(亚特兰蒂斯)主线12血蝙蝠
            },
        },
[22251]={
            {
                mapId = 8,x = 250,y = 363,z = -341,     --(亚特兰蒂斯)主线13海妖斗士
            },
        },
[22252]={
            {
                mapId = 8,x = 376,y = 367,z = -271,     --(亚特兰蒂斯)主线14海斗士巡查者
            },
        },
[22253]={
            {
                mapId = 8,x = 379,y = 360,z = -59,     --(亚特兰蒂斯)主线15海斗士守卫
            },
        },
[22254]={
            {
                mapId = 8,x = 435,y = 360,z = -34,     --(亚特兰蒂斯)主线16海斗士看守者
            },
        },
[22255]={
            {
                mapId = 8,x = 298,y = 347,z = -185,     --(亚特兰蒂斯)主线17海斗士前哨
            },
        },
[22256]={
            {
                mapId = 8,x = 298,y = 347,z = -185,     --(亚特兰蒂斯)主线18熊
            },
        },
[22257]={
            {
                mapId = 8,x = 142,y = 374,z = -120,     --(亚特兰蒂斯)主线19海斗士哨卫
            },
        },
[22258]={
            {
                mapId = 8,x = 143,y = 400,z = 142,     --(亚特兰蒂斯)主线20海皇子侍卫
            },
        },
[22259]={
            {
                mapId = 8,x = 143,y = 400,z = 142,     --(亚特兰蒂斯)主线21海斗士随从
            },
        },
[22260]={
            {
                mapId = 8,x = -67,y = 400,z = 258,     --(亚特兰蒂斯)主线22海皇子侍卫队长
            },
        },
[22261]={
            {
                mapId = 8,x = 4,y = 435,z = 343,     --(亚特兰蒂斯)主线23黄金枪
            },
        },
[22262]={
            {
                mapId = 8,x = 314,y = 400,z = 150,     --(亚特兰蒂斯)主线24狂热的海斗士
            },
        },
[22263]={
            {
                mapId = 8,x = 314,y = 400,z = 150,     --(亚特兰蒂斯)主线25炸药桶
            },
        },
[22264]={
            {
                mapId = 8,x = 417,y = 400,z = 172,     --(亚特兰蒂斯)主线26海斗士冰卫
            },
        },
[22265]={
            {
                mapId = 8,x = 417,y = 400,z = 172,     --(亚特兰蒂斯)主线27魔鬼侍从
            },
        },
[22266]={
            {
                mapId = 8,x = 218,y = 404,z = 115,     --(亚特兰蒂斯)主线28海龙斗士
            },
        },
[22267]={
            {
                mapId = 8,x = -316,y = 357,z = -104,     --(亚特兰蒂斯)主线29狄蒂斯战斗用
            },
        },
[22268]={
            {
                mapId = 8,x = -312,y = 384,z = 93,     --(亚特兰蒂斯)主线30海马拜安召唤怪
            },
        },
[22269]={
            {
                mapId = 8,x = 75,y = 331,z = -249,     --(亚特兰蒂斯)主线31苏兰特召唤怪
            },
        },
[22270]={
            {
                mapId = 8,x = 72,y = 338,z = -382,     --(亚特兰蒂斯)主线32圣兽之魂召唤怪
            },
        },
[22271]={
            {
                mapId = 8,x = 393,y = 391,z = -363,     --(亚特兰蒂斯)主线33海妖侍卫召唤怪
            },
        },
[22272]={
            {
                mapId = 8,x = 400,y = 391,z = -362,     --(亚特兰蒂斯)主线34海妖将军召唤怪
            },
        },
[22273]={
            {
                mapId = 8,x = 391,y = 391,z = -360,     --(亚特兰蒂斯)主线35海龙海之心召唤怪
            },
        },
[22275]={
            {
                mapId = 8,x = 146,y = 447,z = 425,     --(亚特兰蒂斯)主线37海皇子召唤怪
            },
        },
[22276]={
            {
                mapId = 8,x = 334,y = 447,z = 421,     --(亚特兰蒂斯)主线38六圣兽将军召唤怪
            },
        },
[22277]={
            {
                mapId = 8,x = 220,y = 447,z = 315,     --(亚特兰蒂斯)主线39海龙出现召唤怪
            },
        },
[22712]={
            {
                mapId = 321,x = -274,y = 291,z = 294,     --(冰河回忆)剧情本BOSS
            },
        },
[21098]={
            {
                mapId = 320,x = 136,y = 358,z = -269,     --(剧本：七大洋之战！)七海_1六圣兽
            },
        },
[21101]={
            {
                mapId = 320,x = 143,y = 362,z = -278,     --(剧本：七大洋之战！)七海_1北太平洋之柱
            },
        },
[21102]={
            {
                mapId = 320,x = -233,y = 362,z = -192,     --(剧本：七大洋之战！)七海_2海怪
            },
        },
[21109]={
            {
                mapId = 320,x = -256,y = 368,z = -219,     --(剧本：七大洋之战！)七海_2南冰洋之柱
            },
        },
[21501]={
            {
                mapId = 320,x = 85,y = 356,z = -184,     --(剧本：七大洋之战！)七海_1海斗士杂兵队长
            },
        },
[21502]={
            {
                mapId = 320,x = 85,y = 356,z = -184,     --(剧本：七大洋之战！)七海_1海斗士杂兵
            },
        },
[21503]={
            {
                mapId = 320,x = -162,y = 356,z = -130,     --(剧本：七大洋之战！)七海_2海斗士杂兵队长
            },
        },
[21504]={
            {
                mapId = 320,x = -162,y = 356,z = -130,     --(剧本：七大洋之战！)七海_2海斗士杂兵
            },
        },
[21434]={
            {
                mapId = 7,x = -100,y = 303,z = 316,     --(东西伯利亚)主线策略05科霍提克村_受伤的圣斗士候补生
            },
        },
[21460]={
            {
                mapId = 7,x = 390,y = 316,z = -36,     --(东西伯利亚)主线策略31风息谷_应战的北欧勇士
            },
        },
[21461]={
            {
                mapId = 7,x = 324,y = 315,z = 142,     --(东西伯利亚)主线策略32暗冰前哨_被魅惑的北欧勇士
            },
        },
[23036]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级
            },
        },
[23038]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级
            },
        },
[23040]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级
            },
        },
[23042]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级
            },
        },
[23044]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级
            },
        },
[23037]={
            {
                mapId = 4,x = 336.265,y = 297.104,z = -281.441,     --(银河竞技场)职业任务25级
            },
        },
[23039]={
            {
                mapId = 4,x = 373.136,y = 315.947,z = -344.342,     --(银河竞技场)职业任务25级
            },
        },
[23041]={
            {
                mapId = 4,x = 415.144,y = 305.826,z = -83.2069,     --(银河竞技场)职业任务25级
            },
        },
[23043]={
            {
                mapId = 4,x = 317.74,y = 306.581,z = -148.576,     --(银河竞技场)职业任务25级
            },
        },
[23045]={
            {
                mapId = 4,x = 196.008,y = 310.264,z = -127.68,     --(银河竞技场)职业任务25级
            },
        },
[22843]={
            {
                mapId = 8,x = -83,y = 330,z = -163,     --(亚特兰蒂斯)主线落难的船员
            },
        },
[22662]={
            {
                mapId = 7,x = -155.322,y = 298.856,z = -234.707,     --(东西伯利亚)支线16魔鬼礁群_索菲亚
            },
        },
[22663]={
            {
                mapId = 7,x = 332.475,y = 315.006,z = 290.752,     --(东西伯利亚)支线17极光雪原_冰蓝皇后
            },
        },
[22664]={
            {
                mapId = 7,x = -287.86,y = 298.232,z = 218.684,     --(东西伯利亚)支线18科霍提克村_狼王
            },
        },
[22665]={
            {
                mapId = 7,x = -156.371,y = 296.946,z = 278.766,     --(东西伯利亚)支线19永久冰壁_冰魂
            },
        },
[22666]={
            {
                mapId = 7,x = 396.097,y = 320.615,z = 207.048,     --(东西伯利亚)支线20风息谷_芬里尔狼
            },
        },
[22667]={
            {
                mapId = 7,x = 262.949,y = 378.408,z = 388.868,     --(东西伯利亚)支线21海皇宫_米歇尔
            },
        },
[18509]={
            {
                mapId = 2,x = 3,y = 288,z = -107,     --(库任务)塞壬女王
            },
        },
[18510]={
            {
                mapId = 2,x = 3,y = 288,z = -107,     --(库任务)亚雷库萨
            },
        },
[18511]={
            {
                mapId = 2,x = 3,y = 288,z = -107,     --(库任务)熔岩巨人
            },
        },
[18512]={
            {
                mapId = 2,x = 3,y = 288,z = -107,     --(库任务)冥斗士天间星
            },
        },
[18513]={
            {
                mapId = 2,x = 3,y = 288,z = -107,     --(库任务)海皇子
            },
        },
[23707]={
            {
                mapId = 6,x = -288.371,y = 336.671,z = 422.014,     --(侍从任务)宠物06任务普通怪
            },
        },
[23708]={
            {
                mapId = 6,x = -463.527,y = 367.989,z = 91.1821,     --(侍从任务)宠物07任务头目怪A
            },
        },
[23710]={
            {
                mapId = 6,x = -271.769,y = 361.697,z = 122.92,     --(侍从任务)宠物08任务头目怪B
            },
        },
[23613]={
            {
                mapId = 8,x = -312.093,y = 340.388,z = -210.999,     --(亚特兰蒂斯)亚特兰蒂斯支线01海盗头子
            },
        },
[23614]={
            {
                mapId = 8,x = -66.3616,y = 328.647,z = -257.95,     --(亚特兰蒂斯)亚特兰蒂斯支线02海龙信使
            },
        },
[23615]={
            {
                mapId = 8,x = -46.6787,y = 330.614,z = -290.614,     --(亚特兰蒂斯)亚特兰蒂斯支线03迷之海斗士
            },
        },
[23616]={
            {
                mapId = 8,x = -293.695,y = 340.227,z = -218.762,     --(亚特兰蒂斯)亚特兰蒂斯支线04海盗水手
            },
        },
[23617]={
            {
                mapId = 8,x = 336.754,y = 347.955,z = -54.4506,     --(亚特兰蒂斯)亚特兰蒂斯支线05海魔兽
            },
        },
[23618]={
            {
                mapId = 8,x = -225.089,y = 346.478,z = -234.441,     --(亚特兰蒂斯)亚特兰蒂斯支线06海盗猎手
            },
        },
[23619]={
            {
                mapId = 8,x = -312.838,y = 356.744,z = -148.187,     --(亚特兰蒂斯)亚特兰蒂斯支线07海盗斥候
            },
        },
[23620]={
            {
                mapId = 8,x = -312.838,y = 356.744,z = -148.187,     --(亚特兰蒂斯)亚特兰蒂斯支线08人鱼战士
            },
        },
[23621]={
            {
                mapId = 8,x = -360.293,y = 366.856,z = 3.49104,     --(亚特兰蒂斯)亚特兰蒂斯支线09海盗霍夫曼
            },
        },
[23622]={
            {
                mapId = 8,x = 254.315,y = 347.965,z = -209.285,     --(亚特兰蒂斯)亚特兰蒂斯支线10海怪幻影
            },
        },
[23623]={
            {
                mapId = 8,x = -149.605,y = 366.037,z = 48.9348,     --(亚特兰蒂斯)亚特兰蒂斯支线11龙皮战士
            },
        },
[23624]={
            {
                mapId = 8,x = -144.645,y = 359.786,z = 161.279,     --(亚特兰蒂斯)亚特兰蒂斯支线12塞壬女王
            },
        },
[23625]={
            {
                mapId = 8,x = 350.038,y = 381.16,z = -386.299,     --(亚特兰蒂斯)亚特兰蒂斯支线13北海巨熊
            },
        },
[23626]={
            {
                mapId = 8,x = 320.349,y = 348.258,z = -72.7919,     --(亚特兰蒂斯)亚特兰蒂斯支线14海魔女幻影
            },
        },
[25203]={
            {
                mapId = 4,x = 296,y = 310,z = -4,     --(银河竞技场)主线93银都市_黑暗白鸟战斗
            },
        },
[23643]={
            {
                mapId = 2,x = -272,y = 288,z = -148,     --(服务器进程)怨恨的海皇灵魂
            },
        },
[23649]={
            {
                mapId = 2,x = -273,y = 288,z = -145,     --(服务器进程)未完全复苏的哈迪斯
            },
        },
[25263]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_白羊座幻影
            },
        },
[25264]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_金牛座幻影
            },
        },
[25265]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_双子座幻影
            },
        },
[25266]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_巨蟹座幻影
            },
        },
[25267]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_狮子座幻影
            },
        },
[25268]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_处女座幻影
            },
        },
[25269]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_天秤座幻影
            },
        },
[25270]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_天蝎座幻影
            },
        },
[25271]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_射手座幻影
            },
        },
[25272]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_摩羯座幻影
            },
        },
[25273]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_水瓶座幻影
            },
        },
[25274]={
            {
                mapId = 40,x = -301.177,y = 358.583,z = 334.624,     --(圣域)圣衣发放_双鱼座幻影
            },
        },
[9205]={
            {
                mapId = 3,x = 36,y = 390,z = 156,     --(庐山)庐山主线鹰
            },
        },
[25824]={
            {
                mapId = 7,x = -302.116,y = 292.868,z = 371.475,     --(东西伯利亚)霍科提克村火把
            },
        },
[25825]={
            {
                mapId = 7,x = 333.363,y = 328.444,z = 36.0886,     --(东西伯利亚)暗冰哨塔火炬
            },
        },
[25826]={
            {
                mapId = 7,x = -240.829,y = 301.446,z = 117.941,     --(东西伯利亚)雪落村炸药
            },
        },
[22657]={
            {
                mapId = 7,x = 401.579,y = 317.586,z = -74.9736,     --(东西伯利亚)支线11风息谷_恶魔意志
            },
        },
[22658]={
            {
                mapId = 7,x = 384.734,y = 318.866,z = -45.7207,     --(东西伯利亚)支线12风息谷_风信使
            },
        },
[22647]={
            {
                mapId = 7,x = -365.961,y = 296.772,z = 351.794,     --(东西伯利亚)支线01沉船处_海流幻影
            },
        },
[22648]={
            {
                mapId = 7,x = -237.839,y = 300.943,z = 115.336,     --(东西伯利亚)支线02冰点哨塔_尼科拉斯
            },
        },
[22649]={
            {
                mapId = 7,x = -297.417,y = 305.443,z = -67.1044,     --(东西伯利亚)支线03雪落村_安德烈
            },
        },
[22651]={
            {
                mapId = 7,x = -209.796,y = 297.519,z = -235.959,     --(东西伯利亚)支线05冰点哨塔_冰块
            },
        },
[22652]={
            {
                mapId = 7,x = -324.442,y = 297.454,z = -251.563,     --(东西伯利亚)支线06魔鬼礁群_神秘人
            },
        },
[22653]={
            {
                mapId = 7,x = -399.633,y = 296.846,z = -302.58,     --(东西伯利亚)支线07魔鬼礁群_奥德
            },
        },
[22654]={
            {
                mapId = 7,x = 297.27,y = 259.827,z = -263.337,     --(东西伯利亚)支线08世界之树_卢卡斯
            },
        },
[22655]={
            {
                mapId = 7,x = 310.571,y = 257.991,z = -359.169,     --(东西伯利亚)支线09世界之树_布鲁克
            },
        },
[22656]={
            {
                mapId = 7,x = 424.347,y = 257.761,z = -316.791,     --(东西伯利亚)支线10世界之树_帕赛
            },
        },
[22659]={
            {
                mapId = 7,x = 112.519,y = 293.271,z = -65.6917,     --(东西伯利亚)支线13极光雪原_隐者
            },
        },
[22660]={
            {
                mapId = 7,x = 204.293,y = 386.636,z = 296.297,     --(东西伯利亚)支线14蓝冰堡_华服男子
            },
        },
[22661]={
            {
                mapId = 7,x = 296.105,y = 385.841,z = 462.313,     --(东西伯利亚)支线15蓝冰堡_加隆
            },
        },
[26043]={
            {
                mapId = 2,x = 341,y = 372,z = 361,     --(圣域)主线冥界屏障
            },
        },
[26044]={
            {
                mapId = 2,x = 350,y = 385,z = 374,     --(圣域)主线冥王神衣
            },
        },
[18444]={
            {
                mapId = 302,x = 193,y = 292,z = -386,     --(剧本：黄泉之井)冥界士兵
            },
        },
[18443]={
            {
                mapId = 302,x = 193,y = 292,z = -386,     --(剧本：黄泉之井)喽啰
            },
        },
[12807]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)冥界士兵
            },
        },
[12811]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)冥界士兵
            },
        },
[12819]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)喽啰
            },
        },
[12812]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)冥界士兵
            },
        },
[12813]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)冥界士兵
            },
        },
[12820]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)喽啰
            },
        },
[13058]={
            {
                mapId = 302,x = 12,y = 316,z = -348,     --(剧本：黄泉之井)地狱三头犬
            },
        },
[26133]={
            {
                mapId = 307,x = -845,y = 43,z = 157,     --(剧本：逃离比良坂)迪斯马斯克
            },
        },
[16452]={
            {
                mapId = 5,x = 35,y = 276,z = -458,     --(遗忘之路)帕卫尼肯
            },
        },
[16453]={
            {
                mapId = 5,x = 55,y = 326,z = -413,     --(遗忘之路)加米安
            },
        },
[16458]={
            {
                mapId = 5,x = 216,y = 380,z = -275,     --(遗忘之路)贾塞伦
            },
        },
[16460]={
            {
                mapId = 5,x = 19,y = 305,z = -191,     --(遗忘之路)潘恩
            },
        },
[16461]={
            {
                mapId = 5,x = 18,y = 305,z = -184,     --(遗忘之路)卡阿
            },
        },
[16462]={
            {
                mapId = 5,x = -178,y = 320,z = -103,     --(遗忘之路)奥古斯塔
            },
        },
[16463]={
            {
                mapId = 5,x = -106,y = 308,z = 235,     --(遗忘之路)黑暗凤凰
            },
        },
[16464]={
            {
                mapId = 5,x = -105,y = 308,z = 235,     --(遗忘之路)黑暗独角兽
            },
        },
[16465]={
            {
                mapId = 5,x = -257,y = 366,z = 123,     --(遗忘之路)金色幻象
            },
        },
[27076]={
            {
                mapId = 10,x = -356.117,y = 318.419,z = 352.746,     --(海因斯坦堡)主线02晨曦森林地奇星战斗召唤怪
            },
        },
[27082]={
            {
                mapId = 10,x = -109.688,y = 299.284,z = 317.776,     --(海因斯坦堡)主线08撒加裂隙边战斗召唤怪1
            },
        },
[27086]={
            {
                mapId = 10,x = -43.317,y = 301.091,z = 371.68,     --(海因斯坦堡)主线12桥边巨石战斗召唤怪
            },
        },
[27093]={
            {
                mapId = 10,x = 330.106,y = 299.37,z = 158.398,     --(海因斯坦堡)主线19装死的乌鸦召唤怪
            },
        },
[27098]={
            {
                mapId = 10,x = 120.926,y = 369.266,z = -424.282,     --(海因斯坦堡)主线24天哭星安息墓园战斗召唤怪
            },
        },
[27100]={
            {
                mapId = 10,x = -16.555,y = 367.349,z = -136.071,     --(海因斯坦堡)主线26天捷星战斗召唤怪
            },
        },
[27105]={
            {
                mapId = 10,x = -194.269,y = 364.181,z = 77.6799,     --(海因斯坦堡)主线31拉达曼迪斯菲森小镇战斗召唤怪
            },
        },
[27113]={
            {
                mapId = 10,x = -479.646,y = 404.542,z = -4.17761,     --(海因斯坦堡)主线39天魔星战斗召唤怪
            },
        },
[27122]={
            {
                mapId = 10,x = -329.73,y = 434.309,z = -185.146,     --(海因斯坦堡)主线48天牢星战斗召唤怪
            },
        },
[27123]={
            {
                mapId = 10,x = -280.308,y = 459.351,z = -271.554,     --(海因斯坦堡)主线49天哭星冥界入口召唤怪
            },
        },
[27124]={
            {
                mapId = 10,x = -280.308,y = 459.351,z = -271.554,     --(海因斯坦堡)主线50天牢星冥界入口召唤怪
            },
        },
[27125]={
            {
                mapId = 10,x = -281.826,y = 459.371,z = -272.537,     --(海因斯坦堡)主线51天捷星冥界入口召唤怪
            },
        },
[27126]={
            {
                mapId = 10,x = -280.308,y = 459.351,z = -271.554,     --(海因斯坦堡)主线52天牢星冥界入口召唤怪
            },
        },
[27134]={
            {
                mapId = 10,x = -336.686,y = 317.247,z = 319.958,     --(海因斯坦堡)主线60冥界守卫
            },
        },
[27135]={
            {
                mapId = 10,x = -112.615,y = 298.694,z = 337.593,     --(海因斯坦堡)主线61冥界之蝶
            },
        },
[27138]={
            {
                mapId = 10,x = 61.5831,y = 298.838,z = 328.885,     --(海因斯坦堡)主线64冥界密探
            },
        },
[27139]={
            {
                mapId = 10,x = 203.826,y = 298.075,z = 213.345,     --(海因斯坦堡)主线65冥界追踪者
            },
        },
[27141]={
            {
                mapId = 10,x = 440.445,y = 314.206,z = -220.04,     --(海因斯坦堡)主线67冥界虐杀者
            },
        },
[27142]={
            {
                mapId = 10,x = 284.822,y = 331.314,z = -420.03,     --(海因斯坦堡)主线68墓园游尸
            },
        },
[27143]={
            {
                mapId = 10,x = 130.308,y = 364.486,z = -227.985,     --(海因斯坦堡)主线69冥界游荡者
            },
        },
[27146]={
            {
                mapId = 10,x = -152.944,y = 363.236,z = 81.1437,     --(海因斯坦堡)主线72沉睡的村民变身前
            },
        },
[27148]={
            {
                mapId = 10,x = -380.271,y = 388.729,z = 113.266,     --(海因斯坦堡)主线74天魔之花
            },
        },
[27149]={
            {
                mapId = 10,x = -374.956,y = 418.946,z = -162.256,     --(海因斯坦堡)主线75冥界收割者
            },
        },
[27382]={
            {
                mapId = 10,x = -319.349,y = 434.309,z = -168.051,     --(海因斯坦堡)主线76黄泉之井天猛星召唤怪
            },
        },
[27391]={
            {
                mapId = 10,x = 440.445,y = 314.206,z = -220.04,     --(海因斯坦堡)主线77冥界喽啰小怪
            },
        },
[27392]={
            {
                mapId = 10,x = 130.308,y = 364.486,z = -227.985,     --(海因斯坦堡)主线78游荡的小鬼
            },
        },
[27693]={
            {
                mapId = 10,x = 333.167,y = 299.426,z = 11.4427,     --(海因斯坦堡)主线79亡者之村亡灵
            },
        },
[26772]={
            {
                mapId = 9,x = -137.905,y = 302.159,z = 310.108,     --(仙女岛)支线01灯塔_冥界妖蝶
            },
        },
[26773]={
            {
                mapId = 9,x = 281.467,y = 355.877,z = 98.2061,     --(仙女岛)支线02牺牲之石_亡者引路人
            },
        },
[26774]={
            {
                mapId = 9,x = 9.58569,y = 337.736,z = 198.315,     --(仙女岛)支线03沐泪湖_致命曼陀罗
            },
        },
[26775]={
            {
                mapId = 9,x = -382.978,y = 303.042,z = -412.581,     --(仙女岛)支线04明月沙滩_冥界天琴座
            },
        },
[26776]={
            {
                mapId = 9,x = -9.48544,y = 330.366,z = -342.371,     --(仙女岛)支线05塔尔塔罗斯火山_熔岩巨人
            },
        },
[26777]={
            {
                mapId = 9,x = 365.874,y = 320.001,z = -402.423,     --(仙女岛)支线06神谕石阵_黑暗日冕
            },
        },
[26778]={
            {
                mapId = 9,x = -330.834,y = 302.436,z = 212.967,     --(仙女岛)支线07灯塔_凌弱海怪
            },
        },
[26779]={
            {
                mapId = 9,x = -216.821,y = 327.312,z = 84.0822,     --(仙女岛)支线08沐泪湖_冥界侵袭者
            },
        },
[26785]={
            {
                mapId = 9,x = 99.8716,y = 320.978,z = -274.311,     --(仙女岛)支线策略05圣斗士居所_杉树
            },
        },
[27401]={
            {
                mapId = 9,x = -302.788,y = 316.709,z = 20.9734,     --(仙女岛)支线10沐泪湖_黑色卵石
            },
        },
[27403]={
            {
                mapId = 9,x = 139.435,y = 320.053,z = -289.29,     --(仙女岛)支线策略08圣斗士居所_受伤的候补生
            },
        },
[27425]={
            {
                mapId = 10,x = -278.184,y = 312.287,z = 429.23,     --(海因斯坦堡)支线01晨曦森林棕冠皇后
            },
        },
[27426]={
            {
                mapId = 10,x = 253.342,y = 301.386,z = 344.02,     --(海因斯坦堡)支线02安德里斯农庄冥界收割者
            },
        },
[27427]={
            {
                mapId = 10,x = 401.723,y = 309.537,z = -408.408,     --(海因斯坦堡)支线03安息墓园微笑的莫妮卡
            },
        },
[27428]={
            {
                mapId = 10,x = -101.836,y = 361.09,z = 10.067,     --(海因斯坦堡)支线04菲森小镇织梦蝶王
            },
        },
[27429]={
            {
                mapId = 10,x = -423.468,y = 399.983,z = 167.438,     --(海因斯坦堡)支线05彼岸花海彼岸诱惑玫瑰
            },
        },
[27430]={
            {
                mapId = 10,x = -314.591,y = 440.964,z = -212.464,     --(海因斯坦堡)支线06海因斯坦堡执事卢卡斯
            },
        },
[27431]={
            {
                mapId = 10,x = -423.468,y = 399.983,z = 167.438,     --(海因斯坦堡)支线07安德里斯农庄懒惰
            },
        },
[27432]={
            {
                mapId = 10,x = 389.023,y = 312.252,z = -337.298,     --(海因斯坦堡)支线08安息墓园维克多利亚的闺蜜
            },
        },
[27433]={
            {
                mapId = 10,x = 470.481,y = 312.39,z = -348.357,     --(海因斯坦堡)支线09安息墓园大门
            },
        },
[27434]={
            {
                mapId = 10,x = 454.527,y = 312.666,z = -331.173,     --(海因斯坦堡)支线10安息墓园冥界士兵
            },
        },
[27435]={
            {
                mapId = 10,x = -31.5868,y = 341.818,z = 26.6479,     --(海因斯坦堡)支线11长风小径嗜血蝙蝠
            },
        },
[27439]={
            {
                mapId = 10,x = -293.437,y = 418.967,z = -137.537,     --(海因斯坦堡)支线15海因斯坦堡女仆的亡灵
            },
        },
[27440]={
            {
                mapId = 10,x = -258.696,y = 418.946,z = -172.296,     --(海因斯坦堡)支线16长风小径A型血老鼠
            },
        },
[27441]={
            {
                mapId = 10,x = -258.696,y = 418.946,z = -172.296,     --(海因斯坦堡)支线17海因斯坦堡B型血老鼠
            },
        },
[27442]={
            {
                mapId = 10,x = -258.696,y = 418.946,z = -172.296,     --(海因斯坦堡)支线18长风小径AB型血老鼠
            },
        },
[27443]={
            {
                mapId = 10,x = -258.696,y = 418.946,z = -172.296,     --(海因斯坦堡)支线19海因斯坦堡O型血老鼠
            },
        },
[27444]={
            {
                mapId = 10,x = -132.956,y = 367.135,z = -16.9631,     --(海因斯坦堡)支线20菲森小镇_睡神使者
            },
        },
[27445]={
            {
                mapId = 10,x = -132.956,y = 367.135,z = -16.9631,     --(海因斯坦堡)支线策略01安德里斯农庄懒惰的村民
            },
        },
[27446]={
            {
                mapId = 10,x = -132.956,y = 367.135,z = -16.9631,     --(海因斯坦堡)支线策略02安德里斯农庄懒惰的小宇宙
            },
        },
[27450]={
            {
                mapId = 10,x = -198.727,y = 367.087,z = 11.9696,     --(海因斯坦堡)支线策略06菲森小镇_睡梦蝙蝠
            },
        },
[27451]={
            {
                mapId = 10,x = -181.066,y = 363.235,z = 129.23,     --(海因斯坦堡)支线策略07菲森小镇_被噩梦浸染的人
            },
        },
[27453]={
            {
                mapId = 10,x = -117.779,y = 359.378,z = 106.679,     --(海因斯坦堡)支线策略菲森小镇_实验用小狗
            },
        },
[27455]={
            {
                mapId = 10,x = 303.018,y = 305.066,z = 382.833,     --(海因斯坦堡)支线装饰02安德里斯农庄乌鸦
            },
        },
[28045]={
            {
                mapId = 9,x = -375.541,y = 302.07,z = -363.028,     --(仙女岛)支线策略10牺牲石阵特里休斯献祭
            },
        },
[28005]={
            {
                mapId = 2,x = 18,y = 317,z = -363,r = 2,     --(月度日常)月度日常梦神的诡计
            },
        },
[27936]={
            {
                mapId = 5,x = 0,y = 0,z = 0,     --(环任务)艾欧里亚
            },
        },
[27937]={
            {
                mapId = 5,x = 0,y = 0,z = 0,     --(环任务)冥斗士幻影
            },
        },
[27933]={
            {
                mapId = 1,x = 0,y = 0,z = 0,     --(环任务)死之炼金术士
            },
        },
[27934]={
            {
                mapId = 1,x = -91.5336,y = 365.853,z = 299.022,     --(环任务)迪斯马斯克
            },
        },
[27930]={
            {
                mapId = 7,x = 3.16717,y = 298.322,z = -263.807,     --(环任务)北极熊
            },
        },
[27928]={
            {
                mapId = 6,x = 0,y = 0,z = 0,     --(环任务)黑暗凤凰
            },
        },
[27929]={
            {
                mapId = 6,x = 0,y = 0,z = 0,     --(环任务)黑暗圣斗士
            },
        },
[28214]={
            {
                mapId = 8,x = -114.416,y = 353.028,z = 134.227,     --(环任务)科拉
            },
        },
[28215]={
            {
                mapId = 8,x = -127.178,y = 356.618,z = 144.396,     --(环任务)克修拉
            },
        },
[27927]={
            {
                mapId = 6,x = -78.3872,y = 355.513,z = -213.846,     --(环任务)黑暗搜捕者
            },
        },
[27931]={
            {
                mapId = 7,x = 121.628,y = 296.982,z = -293.911,     --(环任务)雪莲守卫
            },
        },
[27932]={
            {
                mapId = 7,x = -32.393,y = 296.852,z = -408.541,     --(环任务)冰斗士爪牙
            },
        },
[27935]={
            {
                mapId = 1,x = -137.754,y = 371.564,z = 415.706,     --(环任务)黄泉丧尸
            },
        },
[27938]={
            {
                mapId = 5,x = -161.358,y = 323.692,z = -172.843,     --(环任务)狂化的狼
            },
        },
[28216]={
            {
                mapId = 8,x = -109.573,y = 350.287,z = 120.423,     --(环任务)海妖先锋
            },
        },
[28217]={
            {
                mapId = 5,x = -106.746,y = 320.209,z = 12.2832,     --(环任务)器灵
            },
        },
[28218]={
            {
                mapId = 5,x = -76.727,y = 307.977,z = 211.079,     --(环任务)冥界斥候
            },
        },
[19950]={
            {
                mapId = 319,x = -215.6,y = 343.402,z = -314.448,     --(凤凰幻魔拳)机关守卫
            },
        },
[19951]={
            {
                mapId = 319,x = -267.344,y = 335.416,z = -286.871,     --(凤凰幻魔拳)檄的仆从
            },
        },
[19952]={
            {
                mapId = 319,x = -280.548,y = 336.639,z = -277.322,     --(凤凰幻魔拳)檄
            },
        },
[19959]={
            {
                mapId = 319,x = -333.278,y = 346.039,z = -242.902,     --(凤凰幻魔拳)蛮
            },
        },
[19962]={
            {
                mapId = 319,x = -378.888,y = 354.369,z = -182.832,     --(凤凰幻魔拳)市
            },
        },
[19968]={
            {
                mapId = 319,x = -325.414,y = 363.131,z = -165.19,     --(凤凰幻魔拳)黑暗凤凰
            },
        },
[27979]={
            {
                mapId = 9,x = -390.65,y = 302,z = -285.09,     --(仙女岛)89级进程boss
            },
        },
[27980]={
            {
                mapId = 10,x = -316.07,y = 444.59,z = -274.56,     --(哈迪斯城)99级进程boss
            },
        },
[28430]={
            {
                mapId = 7,x = -130.538,y = 302.597,z = 142.878,     --(个人库)冰牙
            },
        },
[28431]={
            {
                mapId = 7,x = 250.657,y = 258.872,z = -410.611,     --(个人库)世界阴暗面
            },
        },
[28432]={
            {
                mapId = 8,x = -47.8725,y = 330.026,z = -240.661,     --(个人库)饕
            },
        },
[28433]={
            {
                mapId = 8,x = 407.271,y = 399.623,z = 139.828,     --(个人库)波塞多尼亚意志
            },
        },
[28434]={
            {
                mapId = 9,x = -136.074,y = 323.017,z = -365.374,     --(个人库)石之熔岩
            },
        },
[28435]={
            {
                mapId = 9,x = 134.089,y = 320.02,z = -119.427,     --(个人库)锁之怨灵
            },
        },
[28436]={
            {
                mapId = 10,x = 226.688,y = 301.738,z = 38.653,     --(个人库)灵魂切割者
            },
        },
[28437]={
            {
                mapId = 10,x = -290.299,y = 419.987,z = 12.2085,     --(个人库)噩梦使者
            },
        },
[26632]={
            {
                mapId = 9,x = -362,y = 307,z = 142,     --(仙女岛)冥气魔像
            },
        },
[26633]={
            {
                mapId = 9,x = -358,y = 320,z = 1,     --(仙女岛)冥兵斥候
            },
        },
[26634]={
            {
                mapId = 9,x = -366,y = 305,z = -407,     --(仙女岛)冥兵先锋
            },
        },
[26635]={
            {
                mapId = 9,x = -124,y = 336,z = 95,     --(仙女岛)冥兵侦察兵
            },
        },
[26636]={
            {
                mapId = 9,x = -231,y = 332,z = -207,     --(仙女岛)冥界突击兵
            },
        },
[26637]={
            {
                mapId = 9,x = 360,y = 320,z = -379,     --(仙女岛)冥蝶·幼年
            },
        },
[26638]={
            {
                mapId = 9,x = 181,y = 338,z = -211,     --(仙女岛)冥蝶·成年
            },
        },
[26639]={
            {
                mapId = 9,x = 104,y = 321,z = -47,     --(仙女岛)冥界守门人
            },
        },
[26640]={
            {
                mapId = 9,x = 237,y = 327,z = -76,     --(仙女岛)冥界精兵
            },
        },
[26641]={
            {
                mapId = 9,x = 217,y = 354,z = 71,     --(仙女岛)冥武士
            },
        },
[26642]={
            {
                mapId = 9,x = 34,y = 347,z = -259,     --(仙女岛)第一狱狱卒
            },
        },
[26643]={
            {
                mapId = 9,x = -3,y = 361,z = -240,     --(仙女岛)第一狱传令兵
            },
        },
[26644]={
            {
                mapId = 9,x = -23,y = 377,z = -178,     --(仙女岛)第一狱近卫
            },
        },
[26646]={
            {
                mapId = 9,x = -390,y = 303,z = -413,     --(仙女岛)冥兵首领
            },
        },
[26647]={
            {
                mapId = 9,x = -187,y = 315,z = 169,     --(仙女岛)麦基
            },
        },
[26648]={
            {
                mapId = 9,x = -317,y = 307,z = 123,     --(仙女岛)村长之子
            },
        },
[26649]={
            {
                mapId = 9,x = 431,y = 321,z = -408,     --(仙女岛)冥界影武者
            },
        },
[26650]={
            {
                mapId = 9,x = 356,y = 321,z = -246,     --(仙女岛)冥蝶王
            },
        },
[26651]={
            {
                mapId = 9,x = 145,y = 336,z = 77,     --(仙女岛)黑暗仙女
            },
        },
[26652]={
            {
                mapId = 9,x = 312,y = 348,z = 177,     --(仙女岛)亚鲁哥路
            },
        },
[26653]={
            {
                mapId = 9,x = -58,y = 392,z = -211,     --(仙女岛)女王
            },
        },
[26654]={
            {
                mapId = 9,x = -58,y = 392,z = -211,     --(仙女岛)哥顿
            },
        },
[26655]={
            {
                mapId = 9,x = -58,y = 392,z = -211,     --(仙女岛)西路费都
            },
        },
[4677]={
            {
                mapId = 3,x = -236,y = 320,z = -111,     --(庐山)李云保护召唤怪
            },
        },
[27781]={
            {
                mapId = 10,x = -166,y = 363,z = 63,     --(海因斯坦堡)主线沉睡的村民
            },
        },
[28734]={
            {
                mapId = 4,x = -383,y = 331,z = -191,     --(银河竞技场)富士山黑暗冰壁
            },
        },
[12869]={
            {
                mapId = 3,x = 3,y = 315,z = -152,     --(庐山)支线锄禾禾苗
            },
        },
[25147]={
            {
                mapId = 6,x = 201,y = 346,z = -225,     --(死亡皇后岛)召唤的黑暗虐杀者
            },
        },
[20365]={
            {
                mapId = 312,x = -17,y = 134,z = 138,     --(异次元空间)艾欧里亚的幻象
            },
        },
[20366]={
            {
                mapId = 313,x = -17,y = 134,z = 138,     --(异次元空间)卡妙的幻象
            },
        },
[20367]={
            {
                mapId = 314,x = -270,y = 134,z = 520,     --(异次元空间)迪斯马斯克的幻象
            },
        },
[20368]={
            {
                mapId = 315,x = -17,y = 134,z = 138,     --(异次元空间)阿布罗狄的幻象
            },
        },
[20369]={
            {
                mapId = 316,x = -17,y = 134,z = 138,     --(异次元空间)沙加的幻象
            },
        },
[17040]={
            {
                mapId = 312,x = -17,y = 134,z = 138,     --(异次元空间)你的幻象
            },
        },
[17041]={
            {
                mapId = 313,x = -17,y = 134,z = 138,     --(异次元空间)你的幻象
            },
        },
[17042]={
            {
                mapId = 314,x = -270,y = 134,z = 520,     --(异次元空间)你的幻象
            },
        },
[17043]={
            {
                mapId = 315,x = -17,y = 134,z = 138,     --(异次元空间)你的幻象
            },
        },
[17044]={
            {
                mapId = 316,x = -17,y = 134,z = 138,     --(异次元空间)你的幻象
            },
        },
[9863]={
            {
                mapId = 6,x = 10,y = 450,z = 265,     --(庐山)主线神秘的英灵
            },
        },
[15900]={
            {
                mapId = 5,x = 14,y = 305,z = -191,     --(遗忘之地)遗忘之地支线老泽斯
            },
        },
[13902]={
            {
                mapId = LEAGUE_BASE,x = .62,y = 346.33,z = -304.69,     --(军团福利)女神的使者
            },
        },
[30148]={
            {
                mapId = 2,x = -213.188,y = 350.307,z = 335.376,     --(圣域)仲夏_01小树苗怪
            },
        },
[30150]={
            {
                mapId = 2,x = -300.93,y = 350.367,z = 287.106,     --(圣域)仲夏_03潜伏的冥界密探
            },
        },
[30789]={
            {
                mapId = 1,x = -6.31,y = 326.57,z = 73.79,     --(月度日常护送)巨蟹的前线_黑暗阴影
            },
        },
[30030]={
            {
                mapId = 1,x = -6.31,y = 326.57,z = 73.79,     --(月度日常护送)巨蟹的前线_死亡阴影
            },
        },
[26232]={
            {
                mapId = 322,x = 852,y = 8,z = -1767,     --(剧情十二宫)教学用圣域士兵
            },
        },
[26230]={
            {
                mapId = 322,x = 512,y = 58.3,z = -1839.8,     --(剧情十二宫)天箭座
            },
        },
[26645]={
            {
                mapId = 9,x = -268,y = 311,z = 123,     --(仙女岛)黑暗先锋官
            },
        },
[32351]={
            {
                mapId = 37,x = 18,y = 305,z = -185,     --(月度日常狮子的獠牙)背离信仰之人
            },
        },
[32358]={
            {
                mapId = 37,x = 18,y = 305,z = -185,     --(月度日常狮子的獠牙)梦神
            },
        },
[32359]={
            {
                mapId = 37,x = 18,y = 305,z = -185,     --(月度日常狮子的獠牙)地奇星
            },
        },
[31006]={
            {
                mapId = 1,x = -132,y = 371,z = 341,     --(群星之地)奇遇乌鸦
            },
        },
[32521]={
            {
                mapId = 3,x = -70,y = 314,z = 72,     --(职业任务)狄迪丝
            },
        },
[32522]={
            {
                mapId = 3,x = -70,y = 314,z = 72,     --(职业任务)幽灵之蝶
            },
        },
[32523]={
            {
                mapId = 3,x = -70,y = 314,z = 72,     --(职业任务)熔岩战士
            },
        },
[32524]={
            {
                mapId = 3,x = -70,y = 314,z = 72,     --(职业任务)美斯狄
            },
        },
[32525]={
            {
                mapId = 3,x = -70,y = 314,z = 72,     --(职业任务)强戈
            },
        },
[32888]={
            {
                mapId = 8,x = 75.63,y = 338.02,z = -386.38,     --(亚特兰蒂斯)亚特兰蒂斯支线补01塞壬女王
            },
        },
[32889]={
            {
                mapId = 8,x = 224.57,y = 399.76,z = 9.24,     --(亚特兰蒂斯)亚特兰蒂斯支线补02凯瑞
            },
        },
[32890]={
            {
                mapId = 8,x = 186.49,y = 447.43,z = 303.74,     --(亚特兰蒂斯)亚特兰蒂斯支线补03火元素
            },
        },
[32891]={
            {
                mapId = 8,x = 220.79,y = 455.5,z = 461.89,     --(亚特兰蒂斯)亚特兰蒂斯支线补04柯里
            },
        },
[33465]={
            {
                mapId = 7,x = -173.2,y = 296.76,z = -286.61,     --(环任务)被浸染的白熊
            },
        },
[33466]={
            {
                mapId = 7,x = -150.41,y = 318.48,z = -146.89,     --(环任务)失控的艾米莉
            },
        },
[33939]={
            {
                mapId = 3,x = -271.82,y = 319.689,z = -69.229,     --(中秋活动)中秋月饼大盗
            },
        },
[33920]={
            {
                mapId = 3,x = -136.764,y = 483.069,z = 228.814,     --(中秋活动)中秋醉酒的老猴子
            },
        },
[34841]={
            {
                mapId = 9,x = -404.15,y = 315.989,z = 256.846,     --(仙女岛)仙女岛支线补01冥界噬魂者
            },
        },
[34842]={
            {
                mapId = 9,x = -45.7862,y = 331.961,z = 207.575,     --(仙女岛)仙女岛支线补02瑞希
            },
        },
[34843]={
            {
                mapId = 9,x = 292.814,y = 340.966,z = 218.131,     --(仙女岛)仙女岛支线补03妮娜
            },
        },
[34844]={
            {
                mapId = 9,x = 113.706,y = 319.736,z = -257.638,     --(仙女岛)仙女岛支线补04冥界士兵
            },
        },
[26292]={
            {
                mapId = 327,x = -515.2,y = 255,z = -1718.3,     --(剧情十二宫-处女)卫兵队长
            },
        },
[26277]={
            {
                mapId = 327,x = -583.6,y = 270.249,z = -1738.6,     --(剧情十二宫-处女)六道之一
            },
        },
[26278]={
            {
                mapId = 327,x = -583.6,y = 270.249,z = -1738.6,     --(剧情十二宫-处女)六道之一
            },
        },
[26279]={
            {
                mapId = 327,x = -583.6,y = 270.249,z = -1738.6,     --(剧情十二宫-处女)六道之一
            },
        },
[26280]={
            {
                mapId = 327,x = -583.6,y = 270.249,z = -1738.6,     --(剧情十二宫-处女)六道之一
            },
        },
[26281]={
            {
                mapId = 327,x = -583.6,y = 270.249,z = -1738.6,     --(剧情十二宫-处女)六道之一
            },
        },
[26282]={
            {
                mapId = 327,x = -583.6,y = 270.249,z = -1738.6,     --(剧情十二宫-处女)六道之一
            },
        },
[34959]={
            {
                mapId = 327,x = -636,y = 282,z = -1723.9,     --(剧情十二宫-处女)基鲁提
            },
        },
[34952]={
            {
                mapId = 327,x = -713.3,y = 289,z = -1802.5,     --(剧情十二宫-处女)沙加1
            },
        },
[34951]={
            {
                mapId = 327,x = -836.5,y = 286,z = -1833.2,     --(剧情十二宫-处女)强戈
            },
        },
[34954]={
            {
                mapId = 327,x = -713.3,y = 289,z = -1802.5,     --(剧情十二宫-处女)沙加2
            },
        },
[35189]={
            {
                mapId = 11,x = 298,y = 424,z = 161,     --(冥界下篇)冥界下篇01血之傀儡
            },
        },
[35190]={
            {
                mapId = 11,x = 392,y = 422,z = 77,     --(冥界下篇)冥界下篇02暴力审判者
            },
        },
[35191]={
            {
                mapId = 11,x = 448,y = 422,z = 355,     --(冥界下篇)冥界下篇03噬魂花
            },
        },
[35192]={
            {
                mapId = 11,x = 490,y = 422,z = 318,     --(冥界下篇)冥界下篇04血狼
            },
        },
[35193]={
            {
                mapId = 11,x = 633,y = 452,z = 277,     --(冥界下篇)冥界下篇05热砂天魔星
            },
        },
[35194]={
            {
                mapId = 11,x = 797,y = 420,z = 242,     --(冥界下篇)冥界下篇06冥蛇
            },
        },
[35195]={
            {
                mapId = 11,x = 868,y = 406,z = 262,     --(冥界下篇)冥界下篇07群蛇守卫
            },
        },
[35197]={
            {
                mapId = 11,x = 784,y = 413,z = 422,     --(冥界下篇)冥界下篇09泰坦守卫
            },
        },
[35198]={
            {
                mapId = 11,x = 799,y = 397,z = 577,     --(冥界下篇)冥界下篇10寒冰狩猎者
            },
        },
[35199]={
            {
                mapId = 11,x = -524,y = 822,z = 198,     --(冥界下篇)冥界下篇11冥界守护者
            },
        },
[35204]={
            {
                mapId = 11,x = 399,y = 426,z = 35,     --(冥界下篇)冥界下篇12天捷星
            },
        },
[35209]={
            {
                mapId = 11,x = 592,y = 426,z = 141,     --(冥界下篇)冥界下篇13假冰河
            },
        },
[35526]={
            {
                mapId = LEAGUE_BASE,x = -1.88,y = 340.04,z = -57.32,     --(军团周常活动)军团周常_试炼巨人
            },
        },
[35218]={
            {
                mapId = 11,x = 933,y = 442,z = 410,     --(冥界下篇)冥界下篇14哥顿
            },
        },
[35222]={
            {
                mapId = 11,x = 809,y = 400,z = 772,     --(冥界下篇)冥界下篇15巴连达英
            },
        },
[35229]={
            {
                mapId = 11,x = -705,y = 914,z = 809,     --(冥界下篇)冥界下篇16米诺斯
            },
        },
[35933]={
            {
                mapId = 11,x = 798,y = 401,z = 753,     --(冥界下篇)冥界下篇17寒冰守护者
            },
        },
[35237]={
            {
                mapId = 11,x = -593,y = 931,z = 901,     --(冥界下篇)冥界下篇三冥斗士之一
            },
        },
[35238]={
            {
                mapId = 11,x = -593,y = 931,z = 901,     --(冥界下篇)冥界下篇三冥斗士之二
            },
        },
[35239]={
            {
                mapId = 11,x = -593,y = 931,z = 901,     --(冥界下篇)冥界下篇三冥斗士之三
            },
        },
[34039]={
            {
                mapId = 11,x = 541,y = 299,z = -745,     --(冥界)徘徊恶灵
            },
        },
[34040]={
            {
                mapId = 11,x = 494,y = 299,z = -774,     --(冥界)审判厅冥卫
            },
        },
[34041]={
            {
                mapId = 11,x = 588,y = 311,z = -423,     --(冥界)第一狱冥卫
            },
        },
[34042]={
            {
                mapId = 11,x = 258,y = 304,z = -556,     --(冥界)第二狱冥卫
            },
        },
[34043]={
            {
                mapId = 11,x = 302,y = 298,z = -654,     --(冥界)第三狱冥卫
            },
        },
[34044]={
            {
                mapId = 11,x = -209,y = 277,z = -393,     --(冥界)第四狱冥卫
            },
        },
[34045]={
            {
                mapId = 11,x = -85,y = 290,z = -64,     --(冥界)大地泰坦
            },
        },
[34046]={
            {
                mapId = 11,x = -74,y = 285,z = -160,     --(冥界)第五狱冥卫
            },
        },
[34059]={
            {
                mapId = 11,x = 264,y = 300,z = -570,     --(冥界)地狱三头犬
            },
        },
[36104]={
            {
                mapId = 328,x = -657.6,y = 317.522,z = -1315.8,     --(剧情十二宫-天秤)银蝇座
            },
        },
[36107]={
            {
                mapId = 328,x = -271.5,y = 134.7,z = 521.7,     --(剧情十二宫-天秤)双子座黄金圣斗士
            },
        },
[26297]={
            {
                mapId = 328,x = -608.1,y = 335.5,z = -1204.1,     --(剧情十二宫-天秤)水瓶座卡妙
            },
        },
[26302]={
            {
                mapId = 328,x = -602.3,y = 335.687,z = -1191.4,     --(剧情十二宫-天秤)天秤座冰棺
            },
        },
[35211]={
            {
                mapId = 11,x = 533,y = 438,z = 288,     --(冥界下篇)冥界下篇地恶星
            },
        },
[34055]={
            {
                mapId = 11,x = 568,y = 302,z = -751,     --(冥界)冥界_主线BOSS01_卡戎
            },
        },
[34056]={
            {
                mapId = 11,x = 502,y = 299,z = -804,     --(冥界)冥界_主线BOSS02_库托斯
            },
        },
[34057]={
            {
                mapId = 11,x = 498,y = 299,z = -797,     --(冥界)冥界_主线BOSS03_琉刻
            },
        },
[34058]={
            {
                mapId = 11,x = 499,y = 299,z = -801,     --(冥界)冥界_主线BOSS04_明塔
            },
        },
[34064]={
            {
                mapId = 11,x = -60,y = 291,z = -63,     --(冥界)冥界_主线BOSS10_安泰俄斯
            },
        },
[37332]={
            {
                mapId = 2,x = -32.6459,y = 296.947,z = 305.936,     --(冥界)传记米罗召唤怪
            },
        },
[37388]={
            {
                mapId = 7,x = -407.059,y = 376.089,z = -82.7865,     --(东西伯利亚)传记雪熊
            },
        },
[37389]={
            {
                mapId = 7,x = -391.997,y = 376.132,z = -86.8771,     --(东西伯利亚)传记阿布罗狄召唤怪
            },
        },
[37655]={
            {
                mapId = 4,x = 384.657,y = 301.165,z = -115.566,     --(银河竞技场)贵鬼传记梦神召唤怪
            },
        },
[37674]={
            {
                mapId = 11,x = -585,y = 931,z = 902,     --(冥界)冥界下篇_赶来的冥斗士一
            },
        },
[38281]={
            {
                mapId = 2,x = -213.188,y = 350.307,z = 335.376,     --(圣域)圣诞节_圣诞树空
            },
        },
[17445]={
            {
                mapId = 4,x = 473,y = 312,z = 407,     --(世界boss)银河竞技场
            },
        },
[17446]={
            {
                mapId = 3,x = -145,y = 311,z = -9,     --(世界boss)庐山
            },
        },
[17447]={
            {
                mapId = 5,x = -171,y = 321,z = -7,     --(世界boss)遗忘之路
            },
        },
[17448]={
            {
                mapId = 6,x = 40,y = 362,z = -284,     --(世界boss)死亡皇后岛
            },
        },
[38380]={
            {
                mapId = 9,x = 385,y = 345.5,z = 298,     --(世界boss)圣域-狮子座
            },
        },
[38382]={
            {
                mapId = 9,x = -32,y = 339,z = 243,     --(世界boss)海皇-海龙将军
            },
        },
[38387]={
            {
                mapId = 9,x = -352,y = 303,z = -367,     --(世界boss)冥王-冥后
            },
        },
[38390]={
            {
                mapId = 9,x = 354,y = 320.5,z = -260,     --(世界boss)中立-邪神洛基
            },
        },
[38381]={
            {
                mapId = 8,x = -309,y = 384,z = 82,     --(世界boss)圣域-摩羯座
            },
        },
[38383]={
            {
                mapId = 8,x = -286,y = 363,z = -408,     --(世界boss)海皇-海皇子
            },
        },
[38386]={
            {
                mapId = 8,x = 330,y = 447,z = 430,     --(世界boss)冥王-睡神
            },
        },
[38389]={
            {
                mapId = 8,x = 169,y = 350.3,z = -370.2,     --(世界boss)中立-深渊恶魔
            },
        },
[38379]={
            {
                mapId = 7,x = 205,y = 323,z = 10,     --(世界boss)圣域-金牛座
            },
        },
[38384]={
            {
                mapId = 7,x = -4,y = 297,z = -361,     --(世界boss)海皇-魔鬼鱼
            },
        },
[38385]={
            {
                mapId = 7,x = 122,y = 295,z = -113,     --(世界boss)冥王-天猛星
            },
        },
[38388]={
            {
                mapId = 7,x = -421,y = 297,z = -319,     --(世界boss)中立-熔岩巨人
            },
        },
[38391]={
            {
                mapId = 2,x = 386,y = 318,z = -122,     --(世界boss)守护-女神像
            },
        },
[38392]={
            {
                mapId = 2,x = 164,y = 333,z = 377,     --(世界boss)守护-海皇神像
            },
        },
[38393]={
            {
                mapId = 2,x = 10,y = 317,z = -375,     --(世界boss)守护-冥王神像
            },
        },
[37466]={
            {
                mapId = 11,x = 396.651,y = 422.096,z = 87.672,     --(冥界支线)血池引诱者
            },
        },
[37467]={
            {
                mapId = 11,x = 391.89,y = 422.09,z = 89.962,     --(冥界支线)暴怒的卡西欧士
            },
        },
[37468]={
            {
                mapId = 11,x = 554.6723,y = 425.47,z = 134.114,     --(冥界支线)热砂巡回者
            },
        },
[37469]={
            {
                mapId = 11,x = 520.08163,y = 425.832,z = 111.841,     --(冥界支线)贪婪
            },
        },
[37470]={
            {
                mapId = 11,x = 776.555,y = 399.093,z = 789.185,     --(冥界支线)索魂游尸
            },
        },
[37471]={
            {
                mapId = 11,x = -592.4857,y = 830.101,z = 301.36,     --(冥界支线)该隐守宫冥斗士
            },
        },
[37472]={
            {
                mapId = 11,x = -802.902,y = 854.198,z = 478.0907,     --(冥界支线)安蒂诺拉之罪
            },
        },
[37473]={
            {
                mapId = 11,x = -817.974,y = 853.957,z = 457.7686,     --(冥界支线)安第诺拉守宫冥斗士
            },
        },
[37474]={
            {
                mapId = 11,x = -599.2064,y = 867.046,z = 612.982,     --(冥界支线)嗜血红玫瑰
            },
        },
[37475]={
            {
                mapId = 11,x = -629.43,y = 866.127,z = 569.953,     --(冥界支线)多罗梅守宫冥斗士
            },
        },
[37476]={
            {
                mapId = 11,x = -715.256,y = 913.991,z = 809.003,     --(冥界支线)犹大守宫冥斗士
            },
        },
[38032]={
            {
                mapId = 11,x = 410.627,y = 422.133,z = 70.929,     --(冥界支线)充满怨恨的灵魂
            },
        },
[38682]={
            {
                mapId = 11,x = 862.067,y = 409.125,z = 322.982,     --(冥界支线)贪财冥蛇
            },
        },
[39604]={
            {
                mapId = 3,x = -85,y = 326,z = -259,     --(传记任务)传记偷吃的小贼
            },
        },
[39689]={
            {
                mapId = 11,x = 156,y = 300,z = -292,     --(冥界支线上)凄厉之魂
            },
        },
[39690]={
            {
                mapId = 11,x = 594.13,y = 309.87,z = -467.28,     --(冥界支线上)黑风追杀者
            },
        },
[39691]={
            {
                mapId = 11,x = 614.97,y = 298.33,z = -569.61,     --(冥界支线上)审判厅追杀者
            },
        },
[39692]={
            {
                mapId = 11,x = 551,y = 298,z = -743,     --(冥界支线上)冥河追杀者
            },
        },
[39693]={
            {
                mapId = 11,x = 238,y = 291,z = -742,     --(冥界支线上)堕落的圣斗士
            },
        },
[39694]={
            {
                mapId = 11,x = 348,y = 315,z = -359,     --(冥界支线上)尘世巨蟒
            },
        },
[39695]={
            {
                mapId = 11,x = 267,y = 287,z = -816,     --(冥界支线上)跑得快
            },
        },
[39696]={
            {
                mapId = 11,x = -170,y = 287,z = -83,     --(冥界支线上)邪恶领主
            },
        },
[39730]={
            {
                mapId = 5,x = -19.4951,y = 305.237,z = -202.359,     --(环任务)苏兰特传记恶霸头头
            },
        },
[40040]={
            {
                mapId = 11,x = 441,y = 422,z = 158,     --(冥界支线)支线20热砂_欲望
            },
        },
[40041]={
            {
                mapId = 11,x = 971,y = 441,z = 444,     --(冥界支线)支线21群蛇_恐惧
            },
        },
[40042]={
            {
                mapId = 11,x = -536,y = 931,z = 890,     --(冥界支线)支线22叹息之墙_罗德里奥
            },
        },
[40047]={
            {
                mapId = 11,x = 220,y = 402,z = -91,     --(冥界支线)支线_BOSS_05_冥王圣灵
            },
        },
[39965]={
            {
                mapId = LEAGUE_BASE,x = 10.7975,y = 343.567,z = 2.89305,     --(春节活动)天猛星
            },
        },
[39966]={
            {
                mapId = LEAGUE_BASE,x = -190.22,y = 360.826,z = 16.474,     --(春节活动)天雄星
            },
        },
[39967]={
            {
                mapId = LEAGUE_BASE,x = 156.693,y = 370.036,z = 65.0647,     --(春节活动)天贵星
            },
        },
[40201]={
            {
                mapId = 2,x = -302.92,y = 288.292,z = -87,     --(春节活动)春节_地图任务01年兽
            },
        },
[39568]={
            {
                mapId = 333,x = 79,y = 530,z = -242,     --(剧情十二宫-双鱼)双鱼宫守卫
            },
        },
[39575]={
            {
                mapId = 333,x = 214,y = 540,z = -218,     --(剧情十二宫-双鱼)阿布罗狄
            },
        },
[39569]={
            {
                mapId = 333,x = 308,y = 536,z = -194,     --(剧情十二宫-双鱼)玫瑰
            },
        },
[35215]={
            {
                mapId = 11,x = 800,y = 418,z = 207,     --(冥界下篇)冥界下篇鲁邦战斗
            },
        },
[41622]={
            {
                mapId = 11,x = -122.04,y = 271,z = -660.65,     --(个人库)天魔星
            },
        },
[41623]={
            {
                mapId = 11,x = 228.59,y = 426,z = 48.1,     --(个人库)奥路菲
            },
        },
[42085]={
            {
                mapId = 10,x = 28.7189,y = 369.542,z = -232.424,     --(环任务)拉达曼迪斯
            },
        },
[42106]={
            {
                mapId = 10,x = 269.835,y = 309.999,z = -107.501,     --(环任务)米诺斯_兵斗
            },
        },
[42801]={
            {
                mapId = 2,x = -130.097,y = 339.091,z = 304.983,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官1
            },
        },
[42802]={
            {
                mapId = 2,x = -194.613,y = 336.461,z = 202.469,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官2
            },
        },
[42803]={
            {
                mapId = 2,x = -363.593,y = 350.802,z = 277.679,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官3
            },
        },
[42804]={
            {
                mapId = 2,x = -81.4294,y = 322.471,z = 68.7498,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官4
            },
        },
[42805]={
            {
                mapId = 2,x = -129.353,y = 324.322,z = 4.45833,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官5
            },
        },
[42806]={
            {
                mapId = 2,x = -174.463,y = 333.002,z = 17.3982,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官6
            },
        },
[42807]={
            {
                mapId = 2,x = -162.927,y = 332.971,z = 76.4149,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官7
            },
        },
[42808]={
            {
                mapId = 2,x = -344.613,y = 350.412,z = 394.178,     --(服务器事件-冥王之怒)冥怒_1阶段_8判官8
            },
        },
[42811]={
            {
                mapId = 2,x = -130.927,y = 339.091,z = 303.583,     --(服务器事件-冥王之怒)冥怒_2阶段_天地星1
            },
        },
[42812]={
            {
                mapId = 2,x = -341.973,y = 350.412,z = 394.278,     --(服务器事件-冥王之怒)冥怒_2阶段_天地星2
            },
        },
[42813]={
            {
                mapId = 2,x = -363.723,y = 350.802,z = 279.529,     --(服务器事件-冥王之怒)冥怒_2阶段_天地星3
            },
        },
[42814]={
            {
                mapId = 2,x = -194.513,y = 336.461,z = 201.129,     --(服务器事件-冥王之怒)冥怒_2阶段_天地星4
            },
        },
[42815]={
            {
                mapId = 2,x = -82.8729,y = 322.471,z = 68.4684,     --(服务器事件-冥王之怒)冥怒_2阶段_天地星5
            },
        },
[42816]={
            {
                mapId = 2,x = -129.463,y = 324.322,z = 3.19833,     --(服务器事件-冥王之怒)冥怒_2阶段_天地星6
            },
        },
[42819]={
            {
                mapId = 2,x = -339.433,y = 350.412,z = 394.378,     --(服务器事件-冥王之怒)冥怒_3阶段_梦神
            },
        },
[42820]={
            {
                mapId = 2,x = -132.047,y = 339.091,z = 302.093,     --(服务器事件-冥王之怒)冥怒_3阶段_梦神手下1
            },
        },
[42821]={
            {
                mapId = 2,x = -361.153,y = 350.802,z = 279.689,     --(服务器事件-冥王之怒)冥怒_3阶段_梦神手下2
            },
        },
[42822]={
            {
                mapId = 2,x = -194.483,y = 336.461,z = 199.509,     --(服务器事件-冥王之怒)冥怒_3阶段_梦神手下3
            },
        },
[42823]={
            {
                mapId = 2,x = -84.2929,y = 322.471,z = 68.0984,     --(服务器事件-冥王之怒)冥怒_3阶段_梦神手下4
            },
        },
[42824]={
            {
                mapId = 2,x = -126.953,y = 324.322,z = 3.52833,     --(服务器事件-冥王之怒)冥怒_3阶段_梦神手下5
            },
        },
[42827]={
            {
                mapId = 2,x = -363.613,y = 350.802,z = 272.249,     --(服务器事件-冥王之怒)冥怒_4阶段_冥后
            },
        },
[42828]={
            {
                mapId = 2,x = -133.247,y = 339.091,z = 300.333,     --(服务器事件-冥王之怒)冥怒_4阶段_冥后手下1
            },
        },
[42829]={
            {
                mapId = 2,x = -336.813,y = 350.412,z = 394.478,     --(服务器事件-冥王之怒)冥怒_4阶段_冥后手下2
            },
        },
[42830]={
            {
                mapId = 2,x = -194.363,y = 336.461,z = 198.069,     --(服务器事件-冥王之怒)冥怒_4阶段_冥后手下3
            },
        },
[42831]={
            {
                mapId = 2,x = -85.5029,y = 322.471,z = 67.9984,     --(服务器事件-冥王之怒)冥怒_4阶段_冥后手下4
            },
        },
[42832]={
            {
                mapId = 2,x = -131.673,y = 324.322,z = 3.23833,     --(服务器事件-冥王之怒)冥怒_4阶段_冥后手下5
            },
        },
[42650]={
            {
                mapId = 64,x = -276.491,y = 333.919,z = 215.102,     --(服务器事件-冥王之怒)冥怒_睡神
            },
        },
[42656]={
            {
                mapId = 64,x = -272.839,y = 335.659,z = -34.597,     --(服务器事件-冥王之怒)冥怒_死神
            },
        },
[42484]={
            {
                mapId = 62,x = 95.8479,y = 289.724,z = -122.468,     --(星座升华_泰坦战士)泰坦战士
            },
        },
[42485]={
            {
                mapId = 62,x = -2.18206,y = 288.914,z = -106.798,     --(星座升华_圣斗士英灵)英灵战士
            },
        },
[42486]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金射手座)射手座
            },
        },
[42487]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金水瓶座)水瓶座
            },
        },
[42488]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金处女座)处女座
            },
        },
[42489]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金双子座)双子座
            },
        },
[42490]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_狮子座)狮子座
            },
        },
[42491]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_天秤座)天秤座
            },
        },
[42223]={
            {
                mapId = 11,x = -554.1,y = 930.96,z = 869.95,     --(服务器进程_109)
            },
        },
[42710]={
            {
                mapId = 64,x = 300.46,y = 300.41,z = -148.52,     --(服务器事件-冥王之怒)冥怒_4阶段_哈迪斯
            },
        },
[42378]={
            {
                mapId = 63,x = -590,y = 931,z = 907,     --(服务器事件-冥王之怒)拉达2
            },
        },
[42379]={
            {
                mapId = 63,x = -590,y = 931,z = 907,     --(服务器事件-冥王之怒)艾亚2
            },
        },
[42380]={
            {
                mapId = 63,x = -590,y = 931,z = 907,     --(服务器事件-冥王之怒)米诺2
            },
        },
--------矿物-----------------------------------------------------------------------------
[100000]={
            {
                mapId = 2,x = 100,y = 100,z = 100,     --(填法示例)一般填法
            },
        },
[100001]={
            {
                mapId = 2,
                { x = 1,y = 1,z = 1,},     --(填法示例)100001对应区域中心点1随机点1——中心点具体坐标没填就算出来
                { x = 1,y = 2,z = 1,},     --(填法示例)100001对应区域中心点1随机点2
            },
            {
                mapId = 1,
                { x = 13,y = 2,z = 10,},     --(填法示例)100001对应区域中心点2随机点1——中心点具体坐标没填就算出来
                { x = 3,y = 5,z = 6,},     --(填法示例)100001对应区域中心点2随机点2
            },
            {
                mapId = 2,x = 50,y = 50,z = 50,r = 10,
                { x = 13,y = 2,z = 10,},     --(填法示例)100001对应区域中心点3随机点1——此中心填了中心点
                { x = 3,y = 5,z = 6,},     --(填法示例)100001对应区域中心点3随机点2
            },
            {
                mapId = 2,x = 100,y = 100,z = 100,r = 1,     --(填法示例)100001对应区域中心点4
            },
        },
[100002]={
            {
                mapId = 1,x = 105,y = 123,z = 124,     --(填法示例)一般填法
            },
        },
[608]={
            {
                mapId = 1,
                { x = -485,y = 372,z = -7,},     --(新手村)主线01训练石块
            },
        },
[609]={
            {
                mapId = 1,x = -318,y = 310,z = -69,     --(新手村)主线02镂空的石块
            },
        },
[611]={
            {
                mapId = 1,x = -120,y = 372,z = 377,     --(新手村)主线03昏迷的圣斗士女学员
            },
        },
[612]={
            {
                mapId = 1,x = 131,y = 421,z = 312,     --(新手村)主线04散落的书籍
            },
        },
[8626]={
            {
                mapId = 1,x = -297,y = 311,z = 13,     --(新手村)主线05黄金的小宇宙
            },
        },
[1677]={
            {
                mapId = 3,x = -171,y = 313,z = -247,     --(庐山)庐山支线龙珠一星
            },
        },
[1679]={
            {
                mapId = 3,x = -314,y = 313,z = 52,     --(庐山)庐山支线龙珠三星
            },
        },
[1680]={
            {
                mapId = 3,x = 14,y = 316,z = -143,     --(庐山)庐山支线龙珠四星
            },
        },
[9843]={
            {
                mapId = 3,x = -210,y = 314,z = -298,     --(庐山)庐山支线乌龟
            },
        },
[1687]={
            {
                mapId = 3,x = -98,y = 313,z = -29,     --(庐山)庐山支线清心草
            },
        },
[10268]={
            {
                mapId = 3,x = -256,y = 314,z = -269,     --(庐山)庐山港口货箱
            },
        },
[9871]={
            {
                mapId = 3,x = -262,y = 322,z = -105,     --(庐山)庐山破旧的书卷
            },
        },
[4641]={
            {
                mapId = 3,x = -239,y = 320,z = -103,     --(庐山)庐山药锅
            },
        },
[9081]={
            {
                mapId = 3,x = -193,y = 320,z = -134,     --(庐山)庐山春丽的药箱
            },
        },
[4645]={
            {
                mapId = 3,x = -130,y = 314,z = -273,     --(庐山)庐山龙香草
            },
        },
[9077]={
            {
                mapId = 3,x = -82,y = 327,z = -259,     --(庐山)庐山小祭坛
            },
        },
[9078]={
            {
                mapId = 3,x = -98,y = 315,z = -122,     --(庐山)庐山锄头
            },
        },
[9123]={
            {
                mapId = 3,x = -117,y = 311,z = -20,     --(庐山)庐山莲花
            },
        },
[4643]={
            {
                mapId = 3,x = -63,y = 335,z = -91,     --(庐山)庐山粗壮的竹子
            },
        },
[4644]={
            {
                mapId = 3,x = -7,y = 340,z = -11,     --(庐山)庐山竹笋
            },
        },
[4646]={
            {
                mapId = 3,x = 11,y = 348,z = 77,     --(庐山)庐山大石块
            },
        },
[4647]={
            {
                mapId = 3,x = 50,y = 460,z = 319,     --(庐山)庐山神龙碑碎片
            },
        },
[4648]={
            {
                mapId = 3,x = -203,y = 483,z = 178,     --(庐山)庐山积尸气
            },
        },
[4651]={
            {
                mapId = 3,x = -125,y = 405,z = 190,     --(庐山)庐山雅典娜之泪
            },
        },
[9185]={
            {
                mapId = 3,x = 118,y = 467,z = 377,     --(庐山)庐山能量石
            },
        },
[4642]={
            {
                mapId = 3,x = -268,y = 316,z = -12,     --(庐山)庐山栅栏
            },
        },
[4649]={
            {
                mapId = 3,x = -125,y = 482,z = 177,     --(庐山)庐山金银花
            },
        },
[4650]={
            {
                mapId = 3,x = -189,y = 484,z = 284,     --(庐山)庐山福地机关
            },
        },
[1034]={
            {
                mapId = 4,x = 221,y = 329,z = 420,     --(银河竞技场)射手座圣衣箱
            },
        },
[1035]={
            {
                mapId = 4,x = 420,y = 314,z = 166,     --(银河竞技场)天翼透明矿
            },
        },
[1036]={
            {
                mapId = 4,x = 304.44,y = 314.41,z = -10.23,     --(银河竞技场)拳印透明
            },
        },
[1037]={
            {
                mapId = 4,x = 425,y = 306,z = -143,     --(银河竞技场)吊坠
            },
        },
[1038]={
            {
                mapId = 4,x = 213,y = 310,z = -142,     --(银河竞技场)黑色火焰
            },
        },
[1039]={
            {
                mapId = 4,x = 47,y = 289,z = -345,     --(银河竞技场)惊叫草
            },
        },
[1040]={
            {
                mapId = 4,x = -29,y = 298,z = -333,     --(银河竞技场)战书
            },
        },
[1041]={
            {
                mapId = 4,x = -38,y = 299,z = -275,     --(银河竞技场)白菊花
            },
        },
[1042]={
            {
                mapId = 4,x = 30,y = 284,z = 12,     --(银河竞技场)炸弹
            },
        },
[1043]={
            {
                mapId = 4,x = -258,y = 285,z = -64,     --(银河竞技场)树枝
            },
        },
[1044]={
            {
                mapId = 4,x = -385,y = 335,z = -204,     --(银河竞技场)暗黑冰壁
            },
        },
[1045]={
            {
                mapId = 4,x = -403,y = 364,z = 71,     --(银河竞技场)天马圣衣
            },
        },
[1046]={
            {
                mapId = 4,x = -175,y = 283,z = -390,     --(银河竞技场)天马之墓
            },
        },
[1047]={
            {
                mapId = 4,x = -178,y = 283,z = -389,     --(银河竞技场)白鸟之墓
            },
        },
[1048]={
            {
                mapId = 4,x = -180,y = 283,z = -389,     --(银河竞技场)仙女之墓
            },
        },
[1049]={
            {
                mapId = 4,x = -176,y = 283,z = -389,     --(银河竞技场)天龙之墓
            },
        },
[1051]={
            {
                mapId = 4,x = -319,y = 341,z = 60,     --(银河竞技场)星矢透明
            },
        },
[1736]={
            {
                mapId = 4,x = -300,y = 341,z = 73,     --(银河竞技场)尸体
            },
        },
[10531]={
            {
                mapId = 4,x = 399,y = 306,z = -162,     --(银河竞技场)扭曲空间力场
            },
        },
[9132]={
            {
                mapId = 3,x = -199,y = 483,z = 207,     --(庐山)庐山干净的水
            },
        },
[10851]={
            {
                mapId = 3,x = -53,y = 334,z = -88,     --(庐山)支线枇杷膏
            },
        },
[11965]={
            {
                mapId = 3,x = 130,y = 467,z = 354,     --(庐山)庐山山之石
            },
        },
[11966]={
            {
                mapId = 3,x = 111,y = 466,z = 343,     --(庐山)庐山火之石
            },
        },
[12263]={
            {
                mapId = 3,x = -156,y = 483,z = 153,     --(庐山)庐山化身草
            },
        },
[10742]={
            {
                mapId = 2,x = 132,y = 290,z = -182,     --(圣域)星座1熟悉的远古小宇宙
            },
        },
[10743]={
            {
                mapId = 4,x = 280,y = 318,z = 116,     --(银河竞技场)星座1元的皮球
            },
        },
[10744]={
            {
                mapId = 4,x = 52,y = 294,z = -283,     --(银河竞技场)星座1散乱的草垛
            },
        },
[10745]={
            {
                mapId = 4,x = 55,y = 294,z = -287,     --(银河竞技场)星座1可疑的草垛
            },
        },
[10747]={
            {
                mapId = 3,x = -38,y = 335,z = -101,     --(庐山)星座1神秘黑雾
            },
        },
[10748]={
            {
                mapId = 3,x = -153,y = 311,z = 39,     --(庐山)星座1龙鳞
            },
        },
[10749]={
            {
                mapId = 3,x = -221,y = 312,z = 43,     --(庐山)星座1龙须
            },
        },
[12203]={
            {
                mapId = 3,x = -14,y = 340,z = -88,     --(庐山)星座1黑暗气息
            },
        },
[10750]={
            {
                mapId = 3,x = 12,y = 450,z = 267,     --(庐山)星座1黑暗之花
            },
        },
[12387]={
            {
                mapId = 2,x = 84,y = 296,z = 133,     --(环任务)奇怪的土壤
            },
        },
[12653]={
            {
                mapId = 2,x = 294,y = 296,z = -82,     --(环任务)贡石
            },
        },
[12654]={
            {
                mapId = 2,x = 352,y = 289,z = -364,     --(环任务)银竖琴
            },
        },
[12382]={
            {
                mapId = 4,x = 47,y = 284,z = -52,     --(环任务)紫葛花
            },
        },
[12383]={
            {
                mapId = 4,x = 436,y = 312,z = -81,     --(环任务)小蘑菇
            },
        },
[12384]={
            {
                mapId = 4,x = 394,y = 305,z = -73,     --(环任务)断裂的水蛇牙
            },
        },
[12385]={
            {
                mapId = 4,x = 206,y = 310,z = -177,     --(环任务)香叶
            },
        },
[10746]={
            {
                mapId = 4,x = 8,y = 293,z = -366,     --(银河竞技场)星座1绽开的菊花
            },
        },
[1688]={
            {
                mapId = 3,x = -77,y = 313,z = -174,     --(庐山)止痛草
            },
        },
[1686]={
            {
                mapId = 3,x = -55,y = 334,z = -67,     --(庐山)肥料
            },
        },
[1684]={
            {
                mapId = 3,x = 2,y = 340,z = -97,     --(庐山)肥沃的土壤
            },
        },
[1215]={
            {
                mapId = 4,x = 203,y = 317,z = 283,     --(银河竞技场)银河竞技场支线01红色浆果树
            },
        },
[1216]={
            {
                mapId = 4,x = 203,y = 317,z = 283,     --(银河竞技场)银河竞技场支线02黄色浆果树
            },
        },
[1217]={
            {
                mapId = 4,x = 203,y = 317,z = 283,     --(银河竞技场)银河竞技场支线03蓝色浆果树
            },
        },
[1218]={
            {
                mapId = 4,x = -6,y = 282,z = -178,     --(银河竞技场)银河竞技场支线04巨石
            },
        },
[1219]={
            {
                mapId = 4,x = 4,y = 296,z = -318,     --(银河竞技场)银河竞技场支线05蒂亚戈的信
            },
        },
[1220]={
            {
                mapId = 4,x = 21,y = 295,z = -295,     --(银河竞技场)银河竞技场支线06紫罗兰
            },
        },
[1221]={
            {
                mapId = 4,x = -363,y = 362,z = 75,     --(银河竞技场)银河竞技场支线07小石块
            },
        },
[1222]={
            {
                mapId = 4,x = 51,y = 283,z = -200,     --(银河竞技场)银河竞技场支线08水桶
            },
        },
[1224]={
            {
                mapId = 4,x = 17,y = 295,z = -317,     --(银河竞技场)银河竞技场支线10训练笔记
            },
        },
[12808]={
            {
                mapId = 4,x = 36,y = 293,z = -288,     --(银河竞技场)银河竞技场支线15木盒
            },
        },
[12859]={
            {
                mapId = 4,x = 347,y = 313,z = -50,     --(银河竞技场)银河竞技场星座三残留的小宇宙
            },
        },
[12860]={
            {
                mapId = 4,x = 350,y = 313,z = -215,     --(银河竞技场)银河竞技场星座三残留的小宇宙
            },
        },
[12590]={
            {
                mapId = 4,x = 296,y = 302,z = -283,     --(银河竞技场)银河竞技场星座三黑色火焰
            },
        },
[12591]={
            {
                mapId = 3,x = 19,y = 340,z = -9,     --(庐山)庐山星座三毒气团
            },
        },
[12589]={
            {
                mapId = 4,x = 261,y = 317,z = 147,     --(银河竞技场)庐山星座三草药
            },
        },
[1225]={
            {
                mapId = 4,x = -217,y = 284,z = -47,     --(银河竞技场)萤火宇宙
            },
        },
[1226]={
            {
                mapId = 4,x = 385,y = 316,z = -320,     --(银河竞技场)鬼屋旧灯
            },
        },
[1227]={
            {
                mapId = 4,x = 28,y = 294,z = -308,     --(银河竞技场)星辰樱
            },
        },
[1228]={
            {
                mapId = 4,x = 31,y = 284,z = -39,     --(银河竞技场)鬼隐石
            },
        },
[13225]={
            {
                mapId = 2,x = 379,y = 304,z = 192,     --(圣域)主城3话睡神结界
            },
        },
[13528]={
            {
                mapId = 2,x = 61,y = 290,z = 189,     --(圣域)圣域主线1话01花朵
            },
        },
[13529]={
            {
                mapId = 2,x = 339,y = 289,z = -336,     --(圣域)圣域主线1话02帕拉斯草
            },
        },
[13530]={
            {
                mapId = 2,x = 251,y = 298,z = -127,     --(圣域)圣域主线1话03银星砂
            },
        },
[13531]={
            {
                mapId = 2,x = 422,y = 314,z = -54,     --(圣域)圣域主线1话04圣衣碎片
            },
        },
[13532]={
            {
                mapId = 2,x = 231,y = 316,z = -220,     --(圣域)圣域主线1话05冥王神血
            },
        },
[13533]={
            {
                mapId = 2,x = -29,y = 316,z = -391,     --(圣域)圣域主线1话06雅典娜封印
            },
        },
[13608]={
            {
                mapId = 2,x = 14,y = 301,z = 312,     --(圣域)圣域主线2话草药
            },
        },
[13609]={
            {
                mapId = 2,x = 120,y = 289,z = 57,     --(圣域)圣域主线2话水
            },
        },
[13610]={
            {
                mapId = 2,x = 202,y = 328,z = 199,     --(圣域)圣域主线2话木材
            },
        },
[13611]={
            {
                mapId = 2,x = 131,y = 328,z = 386,     --(圣域)圣域主线2话金穗花种
            },
        },
[12202]={
            {
                mapId = 4,x = 256,y = 312,z = -201,     --(银河竞技场)星座1黑暗小宇宙
            },
        },
[13549]={
            {
                mapId = 2,x = 51,y = 290,z = 175,     --(圣域)圣域支线屋顶陶罐
            },
        },
[15810]={
            {
                mapId = 2,x = 147,y = 332,z = 411,     --(圣域)圣域主线发光的物体
            },
        },
[14077]={
            {
                mapId = 310,x = 132,y = 421,z = 296,     --(重返观星楼)重返观星_书架1
            },
        },
[14078]={
            {
                mapId = 310,x = 120,y = 421,z = 296,     --(重返观星楼)重返观星_书架2
            },
        },
[14079]={
            {
                mapId = 310,x = 114,y = 421,z = 301,     --(重返观星楼)重返观星_书架3
            },
        },
[14080]={
            {
                mapId = 310,x = 114,y = 421,z = 314,     --(重返观星楼)重返观星_书架4
            },
        },
[14081]={
            {
                mapId = 310,x = 119,y = 421,z = 320,     --(重返观星楼)重返观星_书架5
            },
        },
[14082]={
            {
                mapId = 310,x = 132,y = 421,z = 320,     --(重返观星楼)重返观星_书架6
            },
        },
[15510]={
            {
                mapId = 309,x = -402,y = 311,z = 90,     --(剧情副本：欺瞒神的男人)
            },
        },
[15921]={
            {
                mapId = 5,x = -135,y = 288,z = -398,     --(遗忘之路)遗忘之路支线01灰鼠皮
            },
        },
[15922]={
            {
                mapId = 5,x = -64,y = 288,z = -414,     --(遗忘之路)遗忘之路支线02狼皮
            },
        },
[15923]={
            {
                mapId = 5,x = -91,y = 288,z = -388,     --(遗忘之路)遗忘之路支线03干面包
            },
        },
[15924]={
            {
                mapId = 5,x = -60,y = 288,z = -413,     --(遗忘之路)遗忘之路支线04被扔掉的食物
            },
        },
[15925]={
            {
                mapId = 5,x = -167,y = 288,z = -432,     --(遗忘之路)遗忘之路支线05长剑
            },
        },
[15926]={
            {
                mapId = 5,x = 6,y = 308,z = -106,     --(遗忘之路)遗忘之路支线06阿斯克之花
            },
        },
[15927]={
            {
                mapId = 5,x = 5,y = 308,z = -136,     --(遗忘之路)遗忘之路支线07面粉
            },
        },
[15929]={
            {
                mapId = 5,x = -47,y = 285,z = -430,     --(遗忘之路)遗忘之路支线09尸体
            },
        },
[15930]={
            {
                mapId = 5,x = -102,y = 289,z = -384,     --(遗忘之路)遗忘之路支线10女神雕像擦拭
            },
        },
[15931]={
            {
                mapId = 5,x = -127,y = 290,z = -389,     --(遗忘之路)遗忘之路支线11补给
            },
        },
[15932]={
            {
                mapId = 5,x = 150,y = 339,z = -342,     --(遗忘之路)遗忘之路支线12无形的障碍
            },
        },
[15934]={
            {
                mapId = 5,x = 267,y = 388,z = -271,     --(遗忘之路)遗忘之路支线14青春之果
            },
        },
[15935]={
            {
                mapId = 5,x = 270,y = 388,z = -267,     --(遗忘之路)遗忘之路支线15命运之线
            },
        },
[15936]={
            {
                mapId = 5,x = 33,y = 305,z = -184,     --(遗忘之路)遗忘之路支线16水桶
            },
        },
[15937]={
            {
                mapId = 5,x = -293,y = 365,z = 126,     --(遗忘之路)遗忘之路支线17水罐1
            },
        },
[15938]={
            {
                mapId = 5,x = -293,y = 365,z = 126,     --(遗忘之路)遗忘之路支线18水罐2
            },
        },
[15939]={
            {
                mapId = 5,x = -84,y = 307,z = 243,     --(遗忘之路)遗忘之路支线19被炸死的鱼
            },
        },
[15947]={
            {
                mapId = 5,x = -115,y = 340,z = 130,     --(遗忘之路)遗忘之路支线27未精炼的剑1
            },
        },
[15948]={
            {
                mapId = 5,x = -115,y = 340,z = 130,     --(遗忘之路)遗忘之路支线28未精炼的剑2
            },
        },
[15949]={
            {
                mapId = 5,x = 31,y = 308,z = 179,     --(遗忘之路)遗忘之路支线29海螺
            },
        },
[15950]={
            {
                mapId = 5,x = -5,y = 306,z = 196,     --(遗忘之路)遗忘之路支线30神奇的水
            },
        },
[16942]={
            {
                mapId = 1,x = -115,y = 371,z = 372,     --(群星之地)群星_04祭献之花
            },
        },
[16943]={
            {
                mapId = 1,x = 39,y = 347,z = 217,     --(群星之地)群星_05枯树
            },
        },
[16944]={
            {
                mapId = 1,x = 163.2,y = 421.31,z = 321.73,     --(群星之地)群星_06占星台
            },
        },
[16945]={
            {
                mapId = 1,x = -435,y = 328,z = 89,     --(群星之地)群星_07书柜透明矿
            },
        },
[16946]={
            {
                mapId = 1,x = -438,y = 328,z = 92,     --(群星之地)群星_08书桌透明矿
            },
        },
[16947]={
            {
                mapId = 1,x = -434,y = 328,z = 93,     --(群星之地)群星_09台子透明矿
            },
        },
[16948]={
            {
                mapId = 1,x = 124,y = 421,z = 311,     --(群星之地)群星_10星楼书柜透明矿1
            },
        },
[16949]={
            {
                mapId = 1,x = 121,y = 421,z = 320,     --(群星之地)群星_11星楼书柜透明矿2
            },
        },
[16950]={
            {
                mapId = 1,x = -115,y = 372,z = 377,     --(群星之地)群星_12昏迷的候补生
            },
        },
[16951]={
            {
                mapId = 1,x = 25,y = 368,z = 286,     --(群星之地)群星_13裂隙透明矿
            },
        },
[17306]={
            {
                mapId = 1,x = 115,y = 430,z = 315,     --(群星之地)群星_14机关
            },
        },
[17288]={
            {
                mapId = 2,x = 52,y = 291,z = 192,     --(新版圣域)新圣域01花朵
            },
        },
[17289]={
            {
                mapId = 2,x = -307,y = 360,z = 335,     --(新版圣域)新圣域02神秘之光
            },
        },
[17290]={
            {
                mapId = 2,x = 402,y = 319,z = -112,     --(新版圣域)新圣域03封印碎片1
            },
        },
[17291]={
            {
                mapId = 2,x = 243,y = 313,z = -197,     --(新版圣域)新圣域04封印碎片2
            },
        },
[17292]={
            {
                mapId = 2,x = 230,y = 316,z = -218,     --(新版圣域)新圣域05冥王神血
            },
        },
[17293]={
            {
                mapId = 2,x = -34,y = 316,z = -387,     --(新版圣域)新圣域06雅典娜封印
            },
        },
[17294]={
            {
                mapId = 2,x = 0,y = 301,z = 309,     --(新版圣域)新圣域07草药
            },
        },
[17295]={
            {
                mapId = 2,x = -80,y = 302,z = 381,     --(新版圣域)新圣域08雅典娜结界
            },
        },
[17296]={
            {
                mapId = 2,x = 207,y = 329,z = 196,     --(新版圣域)新圣域09木材
            },
        },
[17297]={
            {
                mapId = 2,x = 162,y = 324,z = 351,     --(新版圣域)新圣域10小皮包
            },
        },
[17298]={
            {
                mapId = 2,x = 146,y = 332,z = 409,     --(新版圣域)新圣域11松散的土堆
            },
        },
[17299]={
            {
                mapId = 2,x = 383,y = 304,z = 191,     --(新版圣域)新圣域12睡神结界
            },
        },
[17300]={
            {
                mapId = 2,x = 421,y = 314,z = -54,     --(新版圣域)新圣域13天马祭坛
            },
        },
[17305]={
            {
                mapId = 2,x = 144,y = 332,z = 404,     --(新版圣域)新圣域14土堆假
            },
        },
[18027]={
            {
                mapId = 1,x = 8,y = 365,z = 288,     --(群星师弟)群星尸体
            },
        },
[17584]={
            {
                mapId = 5,x = -154,y = 326,z = -98,     --(环任务)神剑
            },
        },
[17585]={
            {
                mapId = 4,x = -7,y = 285,z = -42,     --(环任务)密信
            },
        },
[17586]={
            {
                mapId = 4,x = -51,y = 282,z = 35,     --(环任务)受伤的玛尔斯
            },
        },
[17587]={
            {
                mapId = 6,x = -292,y = 366,z = 135,     --(环任务)昏迷的黑暗圣斗士
            },
        },
[17588]={
            {
                mapId = 6,x = -177,y = 369,z = -73,     --(环任务)鲜花
            },
        },
[17589]={
            {
                mapId = 6,x = -99,y = 348,z = 55,     --(环任务)艾斯美拉达之墓
            },
        },
[17590]={
            {
                mapId = 6,x = -246,y = 351,z = -69,     --(环任务)项链
            },
        },
[17591]={
            {
                mapId = 6,x = -99,y = 348,z = 55,     --(环任务)墓前的鲜花
            },
        },
[17858]={
            {
                mapId = 6,x = 76,y = 356,z = -163,     --(环任务)照片
            },
        },
[17862]={
            {
                mapId = 1,x = 115,y = 430,z = 315,     --(群星之地)群星_14机关1
            },
        },
[17863]={
            {
                mapId = 1,x = 115,y = 430,z = 315,     --(群星之地)群星_14机关2
            },
        },
[17864]={
            {
                mapId = 1,x = 115,y = 430,z = 315,     --(群星之地)群星_14机关3
            },
        },
[17865]={
            {
                mapId = 1,x = 115,y = 430,z = 315,     --(群星之地)群星_14机关4
            },
        },
[18445]={
            {
                mapId = 302,x = 354,y = 288,z = -377,     --(剧情副本：黄泉之井)黄井_封印碎片
            },
        },
[17481]={
            {
                mapId = 5,x = -159,y = 289,z = -434,     --(遗忘之路)遗忘之路矿石
            },
        },
[17482]={
            {
                mapId = 5,x = -163,y = 290,z = -423,     --(遗忘之路)遗忘之路红石
            },
        },
[18006]={
            {
                mapId = 5,x = 0,y = 313,z = -428,     --(遗忘之路)过往之门水晶
            },
        },
[17484]={
            {
                mapId = 5,x = 63,y = 326,z = -400,     --(遗忘之路)过往之门结界
            },
        },
[18007]={
            {
                mapId = 5,x = 144,y = 319,z = -401,     --(遗忘之路)过往之门钓线
            },
        },
[17485]={
            {
                mapId = 5,x = 166,y = 372,z = -285,     --(遗忘之路)无名神殿常春藤
            },
        },
[17483]={
            {
                mapId = 5,x = -118,y = 290,z = -419,     --(遗忘之路)放逐营地荨麻
            },
        },
[17486]={
            {
                mapId = 5,x = 145,y = 310,z = -155,     --(遗忘之路)圣军营地火堆
            },
        },
[17488]={
            {
                mapId = 5,x = -181,y = 326,z = -175,     --(遗忘之路)射手戒指
            },
        },
[17487]={
            {
                mapId = 5,x = 12,y = 308,z = -127,     --(遗忘之路)遗忘之村石料
            },
        },
[17886]={
            {
                mapId = 5,x = -167,y = 310,z = 241,     --(遗忘之路)海滩荧光贝
            },
        },
[17489]={
            {
                mapId = 5,x = 106,y = 307,z = 204,     --(遗忘之路)海皇家谱
            },
        },
[17490]={
            {
                mapId = 5,x = -109,y = 340,z = 130,     --(遗忘之路)神殿石料
            },
        },
[19257]={
            {
                mapId = 6,x = 355,y = 299,z = -252,     --(死亡皇后岛)贝壳
            },
        },
[19258]={
            {
                mapId = 6,x = 409,y = 319,z = -261,     --(死亡皇后岛)篝火
            },
        },
[19259]={
            {
                mapId = 6,x = 331,y = 316,z = -408,     --(死亡皇后岛)囚笼
            },
        },
[19260]={
            {
                mapId = 6,x = 360.984,y = 318.46,z = -380.537,     --(死亡皇后岛)航海坐标
            },
        },
[19261]={
            {
                mapId = 6,x = 318,y = 318,z = -418,     --(死亡皇后岛)海螺
            },
        },
[19263]={
            {
                mapId = 6,x = 381,y = 319,z = -257,     --(死亡皇后岛)装水的木桶
            },
        },
[19264]={
            {
                mapId = 6,x = 198,y = 335,z = -366,     --(死亡皇后岛)矿石粉尘
            },
        },
[19265]={
            {
                mapId = 6,x = 180,y = 335,z = -347,     --(死亡皇后岛)硝石
            },
        },
[19266]={
            {
                mapId = 6,x = 194,y = 336,z = -337,     --(死亡皇后岛)木屑
            },
        },
[19267]={
            {
                mapId = 6,x = 209,y = 346,z = -216,     --(死亡皇后岛)巨石
            },
        },
[19269]={
            {
                mapId = 6,x = 166,y = 340,z = -404,     --(死亡皇后岛)凤凰花
            },
        },
[19270]={
            {
                mapId = 6,x = 97,y = 344,z = -430,     --(死亡皇后岛)火炬
            },
        },
[19271]={
            {
                mapId = 6,x = 36,y = 358,z = -128,     --(死亡皇后岛)干枯的柴枝
            },
        },
[19272]={
            {
                mapId = 6,x = -108,y = 356,z = -174,     --(死亡皇后岛)墙角的字迹
            },
        },
[19273]={
            {
                mapId = 6,x = -121,y = 356,z = -181,     --(死亡皇后岛)车轴痕迹
            },
        },
[19274]={
            {
                mapId = 6,x = -204,y = 329,z = -404,     --(死亡皇后岛)被困的皇后岛学员
            },
        },
[19278]={
            {
                mapId = 6,x = -227,y = 352,z = -54,     --(死亡皇后岛)矿道支柱
            },
        },
[19279]={
            {
                mapId = 6,x = -381,y = 367,z = -32,     --(死亡皇后岛)面具埋葬点
            },
        },
[19280]={
            {
                mapId = 6,x = -383,y = 368,z = 108,     --(死亡皇后岛)硫磺粉
            },
        },
[19281]={
            {
                mapId = 6,x = -242,y = 342,z = 317,     --(死亡皇后岛)能量石1
            },
        },
[19282]={
            {
                mapId = 6,x = -242,y = 342,z = 317,     --(死亡皇后岛)能量石2
            },
        },
[19283]={
            {
                mapId = 6,x = -84,y = 353,z = 28,     --(死亡皇后岛)地狱之花
            },
        },
[19284]={
            {
                mapId = 6,x = -115,y = 345,z = 64,     --(死亡皇后岛)松动的土堆
            },
        },
[20005]={
            {
                mapId = 3,x = -21,y = 320,z = -131,     --(庐山)个人库任务矿1
            },
        },
[20006]={
            {
                mapId = 5,x = -99,y = 311,z = -134,     --(遗忘之路)个人库任务矿2
            },
        },
[20007]={
            {
                mapId = 6,x = 186,y = 346,z = -203,     --(死亡皇后岛)个人库任务矿3
            },
        },
[20008]={
            {
                mapId = 6,x = 123,y = 346,z = -269,     --(死亡皇后岛)个人库任务矿4
            },
        },
[20009]={
            {
                mapId = 6,x = -23,y = 359,z = -229,     --(死亡皇后岛)个人库任务矿5
            },
        },
[20010]={
            {
                mapId = 6,x = -114,y = 345,z = 53,     --(死亡皇后岛)个人库任务矿6
            },
        },
[18864]={
            {
                mapId = 6,x = 205,y = 346,z = -225,     --(死亡皇后岛)支线货物
            },
        },
[18865]={
            {
                mapId = 6,x = 191,y = 336,z = -354,     --(死亡皇后岛)支线食物
            },
        },
[18866]={
            {
                mapId = 6,x = 321,y = 319,z = -338,     --(死亡皇后岛)支线野花
            },
        },
[18867]={
            {
                mapId = 6,x = -118,y = 367,z = -160,     --(死亡皇后岛)支线古书
            },
        },
[18868]={
            {
                mapId = 6,x = -58,y = 361,z = -199,     --(死亡皇后岛)支线草药
            },
        },
[18869]={
            {
                mapId = 6,x = -30,y = 364,z = -38,     --(死亡皇后岛)支线地狱草
            },
        },
[18870]={
            {
                mapId = 6,x = -127,y = 340,z = 39,     --(死亡皇后岛)支线项链
            },
        },
[18871]={
            {
                mapId = 6,x = -282,y = 360,z = -188,     --(死亡皇后岛)支线金矿
            },
        },
[18873]={
            {
                mapId = 6,x = -225,y = 352,z = -135,     --(死亡皇后岛)支线凯文罗斯
            },
        },
[18874]={
            {
                mapId = 6,x = 30,y = 363,z = -375,     --(死亡皇后岛)支线石块
            },
        },
[18876]={
            {
                mapId = 6,x = -62,y = 353,z = -374,     --(死亡皇后岛)支线指环
            },
        },
[18877]={
            {
                mapId = 6,x = -128,y = 341,z = 58,     --(死亡皇后岛)支线血之花
            },
        },
[19357]={
            {
                mapId = 6,x = -153,y = 331,z = -293,     --(死亡皇后岛)炸药桶
            },
        },
[20381]={
            {
                mapId = 5,x = 86,y = 326,z = -348,     --(遗忘之路)大地神尘
            },
        },
[16240]={
            {
                mapId = 501,x = 256,y = 296,z = 19,     --(阿提卡遗迹)蓝方战旗1
            },
            {
                mapId = 501,x = -44,y = 296,z = 101,     --(阿提卡遗迹)蓝方战旗2
            },
        },
[16239]={
            {
                mapId = 501,x = -84,y = 300,z = -63,     --(阿提卡遗迹)红方战旗1
            },
            {
                mapId = 501,x = 216,y = 298,z = -137,     --(阿提卡遗迹)红方战旗2
            },
        },
[20417]={
            {
                mapId = 3,x = -139,y = 314,z = -183,     --(庐山)支线宠物指引宠物蛋
            },
        },
[12683]={
            {
                mapId = 3,x = -93,y = 326,z = -260,     --(庐山)支线带花草药
            },
        },
[21038]={
            {
                mapId = 2,x = -23,y = 297,z = 357,     --(圣域)主线尤朵拉的药膏
            },
        },
[21039]={
            {
                mapId = 2,x = -48,y = 297,z = 357,     --(圣域)主线水桶
            },
        },
[15510]={
            {
                mapId = 309,x = -400,y = 311,z = 80,     --(期满神的男人)雅典娜封印
            },
        },
[21476]={
            {
                mapId = 7,x = -329,y = 292,z = 375,     --(东西伯利亚)东西伯利亚主线01码头干木块
            },
        },
[21477]={
            {
                mapId = 7,x = -292,y = 296,z = 341,     --(东西伯利亚)东西伯利亚主线02科霍提克村卡妙的记录
            },
        },
[21478]={
            {
                mapId = 7,x = -270,y = 293,z = 334,     --(东西伯利亚)东西伯利亚主线03科霍提克村冰冻的小宇宙
            },
        },
[21479]={
            {
                mapId = 7,x = -98,y = 305,z = 322,     --(东西伯利亚)东西伯利亚主线04修炼地巨大的冰块
            },
        },
[21480]={
            {
                mapId = 7,x = -246,y = 298,z = 236,     --(东西伯利亚)东西伯利亚主线05永久冰壁白鸟圣衣
            },
        },
[21481]={
            {
                mapId = 7,x = -274,y = 310,z = -19,     --(东西伯利亚)东西伯利亚主线06雪落村被冰冻的勇士
            },
        },
[21482]={
            {
                mapId = 7,x = -260,y = 310,z = -11,     --(东西伯利亚)东西伯利亚主线07雪落村熄灭的火堆
            },
        },
[21483]={
            {
                mapId = 7,x = -382,y = 296,z = -289,     --(东西伯利亚)东西伯利亚主线08魔鬼礁群昏迷的水手
            },
        },
[21484]={
            {
                mapId = 7,x = -285,y = 298,z = -305,     --(东西伯利亚)东西伯利亚主线09魔鬼礁群白鸟圣衣
            },
        },
[21485]={
            {
                mapId = 7,x = -312,y = 297,z = -278,     --(东西伯利亚)东西伯利亚主线10魔鬼礁群被俘的蓝冰斗士
            },
        },
[21486]={
            {
                mapId = 7,x = 53,y = 296,z = -278,     --(东西伯利亚)东西伯利亚主线11大裂隙冰河透明
            },
        },
[21487]={
            {
                mapId = 7,x = 448,y = 326,z = -90,     --(东西伯利亚)东西伯利亚主线12风息谷尼伯龙根指环
            },
        },
[21488]={
            {
                mapId = 7,x = 150,y = 383,z = 284,     --(东西伯利亚)东西伯利亚主线13蓝冰堡被困的反抗者
            },
        },
[21489]={
            {
                mapId = 7,x = 358,y = 396,z = 473,     --(东西伯利亚)东西伯利亚主线14蓝冰堡奥尔哈钢之核
            },
        },
[22325]={
            {
                mapId = 8,x = -370,y = 358,z = -368,     --(亚特兰蒂斯)亚特兰蒂斯主线01石块
            },
        },
[22329]={
            {
                mapId = 8,x = -335,y = 357,z = -100,     --(亚特兰蒂斯)亚特兰蒂斯主线05躲藏矿物1
            },
        },
[22330]={
            {
                mapId = 8,x = -306,y = 361,z = -132,     --(亚特兰蒂斯)亚特兰蒂斯主线06躲藏矿物2
            },
        },
[22331]={
            {
                mapId = 8,x = -307,y = 357,z = -76,     --(亚特兰蒂斯)亚特兰蒂斯主线07躲藏矿物3
            },
        },
[22332]={
            {
                mapId = 8,x = -247,y = 343,z = -204,     --(亚特兰蒂斯)亚特兰蒂斯主线08躲藏矿物4
            },
        },
[22333]={
            {
                mapId = 8,x = -236,y = 367,z = -96,     --(亚特兰蒂斯)亚特兰蒂斯主线09蘑菇
            },
        },
[22334]={
            {
                mapId = 8,x = -273,y = 366,z = -92,     --(亚特兰蒂斯)亚特兰蒂斯主线10灌木
            },
        },
[22335]={
            {
                mapId = 8,x = -300,y = 360,z = -135,     --(亚特兰蒂斯)亚特兰蒂斯主线11萤火虫
            },
        },
[22336]={
            {
                mapId = 8,x = -257,y = 359,z = -86,     --(亚特兰蒂斯)亚特兰蒂斯主线12银星砂原石
            },
        },
[22337]={
            {
                mapId = 8,x = -192,y = 366,z = 134,     --(亚特兰蒂斯)亚特兰蒂斯主线13红宝石
            },
        },
[22338]={
            {
                mapId = 8,x = -72,y = 329,z = -163,     --(亚特兰蒂斯)亚特兰蒂斯主线14珊瑚
            },
        },
[22339]={
            {
                mapId = 8,x = 63,y = 334,z = -252,     --(亚特兰蒂斯)亚特兰蒂斯主线15蜂群
            },
        },
[22341]={
            {
                mapId = 8,x = 197,y = 351,z = -376,     --(亚特兰蒂斯)亚特兰蒂斯主线17雄鹰之卵
            },
        },
[22342]={
            {
                mapId = 8,x = 366,y = 387,z = -367,     --(亚特兰蒂斯)亚特兰蒂斯主线18海皇祭品
            },
        },
[22343]={
            {
                mapId = 8,x = 183,y = 351,z = -375,     --(亚特兰蒂斯)亚特兰蒂斯主线19去味草
            },
        },
[22344]={
            {
                mapId = 8,x = 403,y = 390,z = -363,     --(亚特兰蒂斯)亚特兰蒂斯主线20海皇雕像
            },
        },
[22345]={
            {
                mapId = 8,x = 312,y = 372,z = -328,     --(亚特兰蒂斯)亚特兰蒂斯主线21贵鬼的痕迹
            },
        },
[22346]={
            {
                mapId = 8,x = 75,y = 425,z = -62,     --(亚特兰蒂斯)亚特兰蒂斯主线22大墙机关
            },
        },
[22347]={
            {
                mapId = 8,x = 112,y = 405,z = 176,     --(亚特兰蒂斯)亚特兰蒂斯主线23海皇雕像1
            },
        },
[22348]={
            {
                mapId = 8,x = 171,y = 448,z = 468,     --(亚特兰蒂斯)亚特兰蒂斯主线24海皇雕像2
            },
        },
[22349]={
            {
                mapId = 8,x = 326,y = 405,z = 183,     --(亚特兰蒂斯)亚特兰蒂斯主线25海皇雕像3
            },
        },
[22350]={
            {
                mapId = 8,x = 267,y = 448,z = 469,     --(亚特兰蒂斯)亚特兰蒂斯主线26海皇雕像4
            },
        },
[22351]={
            {
                mapId = 8,x = 19,y = 435,z = 317,     --(亚特兰蒂斯)亚特兰蒂斯主线27巨弩
            },
        },
[22352]={
            {
                mapId = 8,x = 406,y = 400,z = 158,     --(亚特兰蒂斯)亚特兰蒂斯主线28冰柜
            },
        },
[23504]={
            {
                mapId = 4,x = 453,y = 314,z = -95,     --(银河竞技场)银河竞技场主线黄金部件
            },
        },
[21505]={
            {
                mapId = 320,x = 132,y = 358,z = -264,     --(剧本：七大洋之战！)七海_1天秤座圣衣组合形态
            },
        },
[21506]={
            {
                mapId = 320,x = -245,y = 362,z = -204,     --(剧本：七大洋之战！)七海_2天秤座圣衣组合形态
            },
        },
[22944]={
            {
                mapId = 8,x = 439.225,y = 366.494,z = 63.3149,     --(亚特兰蒂斯)亚特兰蒂斯29贵鬼牢笼
            },
        },
[22945]={
            {
                mapId = 8,x = 52.3839,y = 399.623,z = 249.253,     --(亚特兰蒂斯)亚特兰蒂斯30幻境机关
            },
        },
[23646]={
            {
                mapId = 7,x = -145,y = 297,z = 296,     --(东西伯利亚)主线16修炼地_被困的村民
            },
        },
[22618]={
            {
                mapId = 7,x = -351.327,y = 292.355,z = 414.549,     --(东西伯利亚)东西伯利亚支线矿01科霍提克村雪球
            },
        },
[22619]={
            {
                mapId = 7,x = -347.846,y = 292.569,z = 389.779,     --(东西伯利亚)东西伯利亚支线矿02沉船处小黄花
            },
        },
[22620]={
            {
                mapId = 7,x = -275.474,y = 292.658,z = 356.954,     --(东西伯利亚)东西伯利亚支线矿03修炼地时间胶囊
            },
        },
[22621]={
            {
                mapId = 7,x = -162.708,y = 300.239,z = 143.133,     --(东西伯利亚)东西伯利亚支线矿04永久冰壁冰块
            },
        },
[22622]={
            {
                mapId = 7,x = -296.182,y = 305.332,z = -62.5151,     --(东西伯利亚)东西伯利亚支线矿05雪落村祖训石碑
            },
        },
[22623]={
            {
                mapId = 7,x = -191.088,y = 312.598,z = -162.33,     --(东西伯利亚)东西伯利亚支线矿06冰点哨塔雪堆
            },
        },
[22624]={
            {
                mapId = 7,x = 353.173,y = 258.784,z = -259.455,     --(东西伯利亚)东西伯利亚支线矿07世界之树鳞片
            },
        },
[22625]={
            {
                mapId = 7,x = 435.037,y = 325.373,z = -98.6704,     --(东西伯利亚)东西伯利亚支线矿08风息谷奥丁的封印
            },
        },
[22626]={
            {
                mapId = 7,x = -83.4483,y = 291.664,z = 61.8395,     --(东西伯利亚)东西伯利亚支线矿09极光雪原典籍
            },
        },
[23663]={
            {
                mapId = 6,x = -484.672,y = 368.026,z = 55.064,     --(侍从任务)宠物任务矿1
            },
        },
[25225]={
            {
                mapId = 6,x = -484.672,y = 368.026,z = 55.064,     --(侍从任务)宠物任务矿2
            },
        },
[25226]={
            {
                mapId = 6,x = -484.672,y = 368.026,z = 55.064,     --(侍从任务)宠物任务矿3
            },
        },
[23627]={
            {
                mapId = 8,x = -261.592,y = 356.505,z = -155.638,     --(亚特兰蒂斯)亚特兰蒂斯支线01奥尔哈刚之石
            },
        },
[23628]={
            {
                mapId = 8,x = -237.866,y = 340.983,z = -252.061,     --(亚特兰蒂斯)亚特兰蒂斯支线02秘密信件
            },
        },
[23629]={
            {
                mapId = 8,x = -333.299,y = 359.397,z = -123.454,     --(亚特兰蒂斯)亚特兰蒂斯支线03海盗王的宝藏
            },
        },
[23630]={
            {
                mapId = 8,x = 336.754,y = 347.955,z = -54.4506,     --(亚特兰蒂斯)亚特兰蒂斯支线04爱情之石
            },
        },
[23631]={
            {
                mapId = 8,x = 96.4067,y = 328.316,z = -276.082,     --(亚特兰蒂斯)亚特兰蒂斯支线05海鸣石
            },
        },
[23632]={
            {
                mapId = 8,x = -241.039,y = 340.828,z = -236.383,     --(亚特兰蒂斯)亚特兰蒂斯支线06废木柴
            },
        },
[23633]={
            {
                mapId = 8,x = -343.616,y = 410.081,z = -302.601,     --(亚特兰蒂斯)亚特兰蒂斯支线07宝箱
            },
        },
[25278]={
            {
                mapId = 4,x = 223,y = 315,z = 179,     --(银河竞技场)银河竞技场主线23受伤的少女
            },
        },
[25633]={
            {
                mapId = 7,x = -280.474,y = 305.868,z = 92.6881,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25688]={
            {
                mapId = 7,x = -243.594,y = 306.128,z = 81.5781,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25689]={
            {
                mapId = 7,x = -260.064,y = 306.138,z = 66.4281,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25690]={
            {
                mapId = 7,x = -314.814,y = 305.868,z = 47.2881,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25691]={
            {
                mapId = 7,x = -256.034,y = 305.868,z = 93.3681,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25692]={
            {
                mapId = 7,x = -221.804,y = 302.808,z = 71.3481,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25693]={
            {
                mapId = 7,x = -211.874,y = 299.128,z = 88.6881,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25694]={
            {
                mapId = 7,x = -292.214,y = 305.698,z = 51.2581,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25695]={
            {
                mapId = 7,x = -308.694,y = 305.548,z = 35.8581,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25696]={
            {
                mapId = 7,x = -166.424,y = 297.118,z = 55.6781,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25697]={
            {
                mapId = 7,x = -193.624,y = 296.858,z = 72.5481,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25698]={
            {
                mapId = 7,x = -196.814,y = 297.368,z = 86.9581,     --(东西伯利亚)圣衣发放任务，银星宝盒
            },
        },
[25239]={
            {
                mapId = 40,x = -303.319,y = 358.583,z = 343.57,     --(圣域)圣衣发放_白羊守护
            },
        },
[25240]={
            {
                mapId = 40,x = -300.375,y = 358.583,z = 343.57,     --(圣域)圣衣发放_金牛守护
            },
        },
[25241]={
            {
                mapId = 40,x = -297.632,y = 358.583,z = 343.57,     --(圣域)圣衣发放_双子守护
            },
        },
[25242]={
            {
                mapId = 40,x = -292.894,y = 358.583,z = 343.57,     --(圣域)圣衣发放_巨蟹守护
            },
        },
[25243]={
            {
                mapId = 40,x = -288.883,y = 358.583,z = 343.57,     --(圣域)圣衣发放_狮子守护
            },
        },
[25244]={
            {
                mapId = 40,x = -285.757,y = 358.583,z = 343.57,     --(圣域)圣衣发放_处女守护
            },
        },
[25245]={
            {
                mapId = 40,x = -303.395,y = 358.583,z = 326.088,     --(圣域)圣衣发放_天秤守护
            },
        },
[25246]={
            {
                mapId = 40,x = -299.827,y = 358.583,z = 326.088,     --(圣域)圣衣发放_天蝎守护
            },
        },
[25247]={
            {
                mapId = 40,x = -295.75,y = 358.583,z = 326.088,     --(圣域)圣衣发放_射手守护
            },
        },
[25248]={
            {
                mapId = 40,x = -293.521,y = 358.583,z = 326.088,     --(圣域)圣衣发放_摩羯守护
            },
        },
[25249]={
            {
                mapId = 40,x = -290.83,y = 358.583,z = 326.088,     --(圣域)圣衣发放_水瓶守护
            },
        },
[25250]={
            {
                mapId = 40,x = -287.111,y = 358.583,z = 326.088,     --(圣域)圣衣发放_双鱼守护
            },
        },
[25251]={
            {
                mapId = 40,x = -303.319,y = 358.583,z = 340.939,     --(圣域)圣衣发放_白羊守护
            },
        },
[25252]={
            {
                mapId = 40,x = -300.375,y = 358.583,z = 340.939,     --(圣域)圣衣发放_金牛守护
            },
        },
[25253]={
            {
                mapId = 40,x = -297.732,y = 358.583,z = 340.939,     --(圣域)圣衣发放_双子守护
            },
        },
[25254]={
            {
                mapId = 40,x = -295.014,y = 358.583,z = 340.939,     --(圣域)圣衣发放_巨蟹守护
            },
        },
[25255]={
            {
                mapId = 40,x = -292.493,y = 358.583,z = 340.939,     --(圣域)圣衣发放_狮子守护
            },
        },
[25256]={
            {
                mapId = 40,x = -290.007,y = 358.583,z = 340.939,     --(圣域)圣衣发放_处女守护
            },
        },
[25257]={
            {
                mapId = 40,x = -303.145,y = 358.583,z = 328.6,     --(圣域)圣衣发放_天秤守护
            },
        },
[25258]={
            {
                mapId = 40,x = -300.467,y = 358.583,z = 328.6,     --(圣域)圣衣发放_天蝎守护
            },
        },
[25259]={
            {
                mapId = 40,x = -297.57,y = 358.583,z = 328.6,     --(圣域)圣衣发放_射手守护
            },
        },
[25260]={
            {
                mapId = 40,x = -295.081,y = 358.583,z = 328.6,     --(圣域)圣衣发放_摩羯守护
            },
        },
[25261]={
            {
                mapId = 40,x = -292.4,y = 358.583,z = 328.6,     --(圣域)圣衣发放_水瓶守护
            },
        },
[25262]={
            {
                mapId = 40,x = -289.901,y = 358.583,z = 328.6,     --(圣域)圣衣发放_双鱼守护
            },
        },
[25802]={
            {
                mapId = 3,x = -252.089,y = 313.762,z = -270.609,     --(庐山)庐山主线货箱
            },
        },
[21521]={
            {
                mapId = 4,x = 298,y = 296,z = -328,     --(银河竞技场)银河竞技场主线21梦之铃兰
            },
        },
[21522]={
            {
                mapId = 4,x = -177,y = 283,z = 44,     --(银河竞技场)银河竞技场主线22冰霜炸弹
            },
        },
[25915]={
            {
                mapId = 5,x = 59,y = 308,z = 181,     --(遗忘之路)遗忘之路青铜锚
            },
        },
[23147]={
            {
                mapId = 7,x = -94,y = 306,z = 342,     --(东西伯利亚)无法行动的圣斗士候补生
            },
        },
[25908]={
            {
                mapId = 8,x = -58,y = 328,z = -170,     --(亚特兰蒂斯)塞壬巢穴
            },
        },
[25907]={
            {
                mapId = 8,x = -41,y = 328,z = -252,     --(亚特兰蒂斯)海龙将军的信
            },
        },
[22326]={
            {
                mapId = 8,x = -362,y = 359,z = -386,     --(亚特兰蒂斯)求生木桶一号
            },
        },
[22327]={
            {
                mapId = 8,x = -364,y = 359,z = -384,     --(亚特兰蒂斯)求生木桶二号
            },
        },
[22328]={
            {
                mapId = 8,x = -366,y = 359,z = -381,     --(亚特兰蒂斯)求生木桶三号
            },
        },
[26023]={
            {
                mapId = 2,x = -23,y = 297,z = 357,     --(新版圣域)尤朵拉的尸体
            },
        },
[26097]={
            {
                mapId = 1,x = -134,y = 353,z = 114,     --(群星之地)群星_20天马座圣衣箱
            },
        },
[26098]={
            {
                mapId = 1,x = -134,y = 353,z = 114,     --(群星之地)群星_21白鸟座圣衣箱
            },
        },
[26099]={
            {
                mapId = 1,x = -134,y = 353,z = 114,     --(群星之地)群星_22天龙座圣衣箱
            },
        },
[26100]={
            {
                mapId = 1,x = -134,y = 353,z = 114,     --(群星之地)群星_23仙女座圣衣箱
            },
        },
[26101]={
            {
                mapId = 1,x = -134,y = 353,z = 114,     --(群星之地)群星_24凤凰座圣衣箱
            },
        },
[26206]={
            {
                mapId = 307,x = -904,y = 57,z = 261,     --(剧本：逃离比良坂)貌似是宝藏
            },
        },
[27040]={
            {
                mapId = 10,x = -370.366,y = 314,z = 388.715,     --(海因斯坦堡)海因斯坦堡01沙罗双树之花的花瓣
            },
        },
[27041]={
            {
                mapId = 10,x = -94.0452,y = 300.403,z = 317.988,     --(海因斯坦堡)海因斯坦堡02茂密的草丛1
            },
        },
[27042]={
            {
                mapId = 10,x = -99.2785,y = 302.572,z = 303.418,     --(海因斯坦堡)海因斯坦堡03茂密的草丛2
            },
        },
[27043]={
            {
                mapId = 10,x = -117.024,y = 298.915,z = 347.523,     --(海因斯坦堡)海因斯坦堡04茂密的草丛3
            },
        },
[27044]={
            {
                mapId = 10,x = -147.948,y = 296.562,z = 308.009,     --(海因斯坦堡)海因斯坦堡05茂密的草丛4
            },
        },
[27045]={
            {
                mapId = 10,x = -112.274,y = 299.479,z = 315.218,     --(海因斯坦堡)海因斯坦堡06裹尸布
            },
        },
[27046]={
            {
                mapId = 10,x = 167.864,y = 298.006,z = 222.265,     --(海因斯坦堡)海因斯坦堡07尤里安姐姐的项链
            },
        },
[27047]={
            {
                mapId = 10,x = 364.006,y = 301.43,z = 147.558,     --(海因斯坦堡)海因斯坦堡08装死的乌鸦
            },
        },
[27048]={
            {
                mapId = 10,x = 304.038,y = 298.534,z = -14.3825,     --(海因斯坦堡)海因斯坦堡09圣水
            },
        },
[27049]={
            {
                mapId = 10,x = 421.464,y = 313.511,z = -282.891,     --(海因斯坦堡)海因斯坦堡10神圣之书1
            },
        },
[27050]={
            {
                mapId = 10,x = 418.487,y = 313.418,z = -284.888,     --(海因斯坦堡)海因斯坦堡11神圣之书2
            },
        },
[27051]={
            {
                mapId = 10,x = 419.574,y = 313.505,z = -288.387,     --(海因斯坦堡)海因斯坦堡12神圣之书3
            },
        },
[27052]={
            {
                mapId = 10,x = 423.171,y = 313.505,z = -288.44,     --(海因斯坦堡)海因斯坦堡13神圣之书4
            },
        },
[27053]={
            {
                mapId = 10,x = 424.339,y = 313.505,z = -285.03,     --(海因斯坦堡)海因斯坦堡14神圣之书5
            },
        },
[27054]={
            {
                mapId = 10,x = 378.745,y = 313.505,z = -285.807,     --(海因斯坦堡)海因斯坦堡15神秘的箱子
            },
        },
[27055]={
            {
                mapId = 10,x = 407.216,y = 311.508,z = -327.356,     --(海因斯坦堡)海因斯坦堡16木柴
            },
        },
[27056]={
            {
                mapId = 10,x = 121.847,y = 369.764,z = -428.724,     --(海因斯坦堡)海因斯坦堡17死神结界核心
            },
        },
[27057]={
            {
                mapId = 10,x = -478.777,y = 404.882,z = -14.3445,     --(海因斯坦堡)海因斯坦堡18睡神结界核心
            },
        },
[27754]={
            {
                mapId = 5,x = 18,y = 305,z = -191,     --(遗忘之路)遗忘之路神秘徽记
            },
        },
[27755]={
            {
                mapId = 5,x = -197,y = 308,z = 318,     --(遗忘之路)遗忘之路雅典娜封印
            },
        },
[27058]={
            {
                mapId = 10,x = -392.384,y = 421.184,z = -234.526,     --(海因斯坦堡)主线潘多拉的魔盒
            },
        },
[26793]={
            {
                mapId = 9,x = -416.82,y = 300.79,z = 204.837,     --(仙女岛)仙女岛支线01码头标点
            },
        },
[26794]={
            {
                mapId = 9,x = -424.889,y = 304.778,z = 58.4396,     --(仙女岛)仙女岛支线02灯塔工具箱
            },
        },
[26795]={
            {
                mapId = 9,x = -313.265,y = 303.645,z = 189.422,     --(仙女岛)仙女岛支线03灯塔生锈的锚
            },
        },
[26796]={
            {
                mapId = 9,x = -302.788,y = 316.709,z = 20.9734,     --(仙女岛)仙女岛支线04克甫斯村黑色卵石
            },
        },
[26797]={
            {
                mapId = 9,x = -18.7526,y = 330.737,z = 126.892,     --(仙女岛)仙女岛支线05沐泪湖安德洛美达之泉
            },
        },
[26798]={
            {
                mapId = 9,x = 109.919,y = 320.785,z = -300.112,     --(仙女岛)仙女岛支线06居所碎石
            },
        },
[26799]={
            {
                mapId = 9,x = 107.676,y = 320.212,z = -313.776,     --(仙女岛)仙女岛支线07训练场栅栏
            },
        },
[26800]={
            {
                mapId = 9,x = -395.36,y = 300.676,z = -376.382,     --(仙女岛)仙女岛支线08牺牲之石祭祀之泉
            },
        },
[27459]={
            {
                mapId = 10,x = 421.684,y = 313.716,z = -229.493,     --(海因斯坦堡)海因斯坦堡支线01安息墓地酒杯
            },
        },
[27460]={
            {
                mapId = 10,x = 378.793,y = 313.505,z = -284.178,     --(海因斯坦堡)海因斯坦堡支线02安息墓地蜡烛
            },
        },
[27461]={
            {
                mapId = 10,x = 434.882,y = 313.496,z = -291.081,     --(海因斯坦堡)海因斯坦堡支线03安息墓地戒指
            },
        },
[27462]={
            {
                mapId = 10,x = 465.406,y = 316.323,z = -287.87,     --(海因斯坦堡)海因斯坦堡支线04安息墓地海因斯坦家族照片1
            },
        },
[27463]={
            {
                mapId = 10,x = 465.396,y = 316.323,z = -283.824,     --(海因斯坦堡)海因斯坦堡支线05安息墓地海因斯坦家族照片2
            },
        },
[27464]={
            {
                mapId = 10,x = 447.668,y = 310.071,z = -363.205,     --(海因斯坦堡)海因斯坦堡支线06安息墓地白色小花
            },
        },
[27465]={
            {
                mapId = 10,x = -22.5458,y = 326.088,z = 94.0903,     --(海因斯坦堡)海因斯坦堡支线07长风小径维吉尼亚的右腿
            },
        },
[27466]={
            {
                mapId = 10,x = -117.552,y = 359.005,z = 48.6463,     --(海因斯坦堡)海因斯坦堡支线08长风小径无主腿骨
            },
        },
[27467]={
            {
                mapId = 10,x = -293.437,y = 418.967,z = -137.537,     --(海因斯坦堡)海因斯坦堡支线09海因斯坦堡花瓶
            },
        },
[20853]={
            {
                mapId = 3,x = -237,y = 320,z = -106,     --(庐山)庐山主线药捻子
            },
        },
[20854]={
            {
                mapId = 3,x = -234,y = 320,z = -109,     --(庐山)庐山主线药气
            },
        },
[27974]={
            {
                mapId = 7,x = 124.64,y = 296.867,z = -292.531,     --(环任务)冰河_雪莲花
            },
        },
[27978]={
            {
                mapId = 1,x = -146.476,y = 373.751,z = 438.885,     --(环任务)迪斯马斯克_冥界结晶
            },
        },
[28219]={
            {
                mapId = 5,x = -105.111,y = 320.311,z = 9.02398,     --(环任务)加隆_泰坦神器能量波动
            },
        },
[28220]={
            {
                mapId = 5,x = -150.945,y = 309.708,z = 246.355,     --(环任务)加隆_泰坦神器残骸
            },
        },
[28456]={
            {
                mapId = 7,x = 257.951,y = 327.462,z = 104.843,     --(个人库)圣衣碎片
            },
        },
[28457]={
            {
                mapId = 7,x = 277.45,y = 258.736,z = -306.428,     --(个人库)圣衣碎片
            },
        },
[28458]={
            {
                mapId = 8,x = -265.983,y = 363.62,z = -405.842,     --(个人库)圣衣碎片
            },
        },
[28459]={
            {
                mapId = 8,x = 352.788,y = 345.78,z = -152.596,     --(个人库)圣衣碎片
            },
        },
[28460]={
            {
                mapId = 9,x = -263.597,y = 331.747,z = -202.385,     --(个人库)圣衣碎片
            },
        },
[28461]={
            {
                mapId = 9,x = 72.6173,y = 331.899,z = -159.058,     --(个人库)圣衣碎片
            },
        },
[28462]={
            {
                mapId = 10,x = 35.7549,y = 365.152,z = -97.1217,     --(个人库)圣衣碎片
            },
        },
[28463]={
            {
                mapId = 10,x = 94.454,y = 298.762,z = 242.481,     --(个人库)圣衣碎片
            },
        },
[26669]={
            {
                mapId = 9,x = -360,y = 302,z = 250,     --(仙女岛)仙女岛主线01鱼骨堆
            },
        },
[26670]={
            {
                mapId = 9,x = -145,y = 336,z = 168,     --(仙女岛)仙女岛主线02学员坟墓A
            },
        },
[26671]={
            {
                mapId = 9,x = -140,y = 336,z = 169,     --(仙女岛)仙女岛主线03学员坟墓B
            },
        },
[26672]={
            {
                mapId = 9,x = -134,y = 336,z = 169,     --(仙女岛)仙女岛主线04学员坟墓C
            },
        },
[26673]={
            {
                mapId = 9,x = -171,y = 302,z = 282,     --(仙女岛)仙女岛主线05修行地之碑
            },
        },
[26674]={
            {
                mapId = 9,x = -167,y = 302,z = 293,     --(仙女岛)仙女岛主线06胜利者之杯
            },
        },
[26675]={
            {
                mapId = 9,x = -40,y = 332,z = 104,     --(仙女岛)仙女岛主线07冥府之花
            },
        },
[26676]={
            {
                mapId = 9,x = -53,y = 332,z = 113,     --(仙女岛)仙女岛主线08尸气碑
            },
        },
[26677]={
            {
                mapId = 9,x = -256,y = 334,z = -13,     --(仙女岛)仙女岛主线09墓地
            },
        },
[26678]={
            {
                mapId = 9,x = -255,y = 332,z = -178,     --(仙女岛)仙女岛主线10草药
            },
        },
[26679]={
            {
                mapId = 9,x = 194,y = 336,z = -323,     --(仙女岛)仙女岛主线11药草
            },
        },
[26680]={
            {
                mapId = 9,x = 158,y = 336,z = 76,     --(仙女岛)仙女岛主线12仙女座圣衣
            },
        },
[28419]={
            {
                mapId = 9,x = -317,y = 307,z = 123,     --(仙女岛)信
            },
        },
[27808]={
            {
                mapId = 9,x = 5,y = 332,z = 135,     --(仙女岛)纯净之水
            },
        },
[1036]={
            {
                mapId = 4,x = 303,y = 313,z = -8,     --(银河竞技场)主线拳印
            },
        },
[12872]={
            {
                mapId = 3,x = -21,y = 315,z = -171,     --(庐山)支线锄禾肥料
            },
        },
[19268]={
            {
                mapId = 6,x = 202,y = 345,z = -217,     --(死亡皇后岛)黑暗圣衣
            },
        },
[29642]={
            {
                mapId = 3,x = -196,y = 311,z = -200,     --(庐山)端午节荷花
            },
        },
[29643]={
            {
                mapId = 3,x = -279,y = 329,z = -113,     --(庐山)端午节糯米袋
            },
        },
[30651]={
            {
                mapId = 2,x = -303.166,y = 355.301,z = 69.4923,     --(圣域)仲夏_01圣域典籍
            },
        },
[30652]={
            {
                mapId = 2,x = 211.216,y = 312.886,z = -277.304,     --(圣域)仲夏_02小宇宙能量残片
            },
        },
[30660]={
            {
                mapId = 6,x = -113.337,y = 355.449,z = -205.443,     --(死亡皇后岛)奇遇_货箱
            },
        },
[32338]={
            {
                mapId = 4,x = 322,y = 308,z = -261,     --(银河竞技场)射手座的左腕
            },
        },
[32894]={
            {
                mapId = 8,x = -350.3,y = 366.581,z = 4.09821,     --(亚特兰蒂斯)亚特兰蒂斯支线补01可疑光晕
            },
        },
[32895]={
            {
                mapId = 8,x = -42.4914,y = 336.785,z = 31.2427,     --(亚特兰蒂斯)亚特兰蒂斯支线补02牢笼
            },
        },
[32896]={
            {
                mapId = 8,x = 372.235,y = 386.819,z = -372.381,     --(亚特兰蒂斯)亚特兰蒂斯支线补03海洋之石真
            },
        },
[32897]={
            {
                mapId = 8,x = 377.492,y = 386.71,z = -377.372,     --(亚特兰蒂斯)亚特兰蒂斯支线补04海洋之石假
            },
        },
[32898]={
            {
                mapId = 8,x = 430.816,y = 360.597,z = 4.53729,     --(亚特兰蒂斯)亚特兰蒂斯支线补05海皇之石
            },
        },
[32899]={
            {
                mapId = 8,x = 77.8465,y = 424.936,z = -60.853,     --(亚特兰蒂斯)亚特兰蒂斯支线补06时空之钥
            },
        },
[32900]={
            {
                mapId = 8,x = 161.525,y = 434.836,z = 264.64,     --(亚特兰蒂斯)亚特兰蒂斯支线补07自然元素
            },
        },
[32596]={
            {
                mapId = 3,x = -274,y = 314,z = -311,     --(庐山)奇遇_诱饵袋
            },
        },
[32598]={
            {
                mapId = 3,x = -274,y = 314,z = -311,     --(庐山)奇遇_诱饵袋
            },
        },
[32594]={
            {
                mapId = 3,x = -259,y = 311,z = -298,     --(庐山)奇遇_鲤鱼
            },
        },
[33462]={
            {
                mapId = 7,x = -117,y = 319,z = -109,     --(环任务)卡妙_冰结晶
            },
        },
[33952]={
            {
                mapId = 3,x = -273.009,y = 329.067,z = -123.355,     --(庐山)中秋_01桂花酒村长酿造
            },
        },
[33953]={
            {
                mapId = 3,x = -225.808,y = 319.185,z = -121.213,     --(庐山)中秋_02桂花酒醉千杯
            },
        },
[33954]={
            {
                mapId = 3,x = -135.794,y = 483.129,z = 228.564,     --(庐山)中秋_03天马座圣衣箱
            },
        },
[33955]={
            {
                mapId = 3,x = -135.794,y = 483.129,z = 228.564,     --(庐山)中秋_04白鸟座圣衣箱
            },
        },
[33956]={
            {
                mapId = 3,x = -135.794,y = 483.129,z = 228.564,     --(庐山)中秋_05天龙座圣衣箱
            },
        },
[33957]={
            {
                mapId = 3,x = -135.794,y = 483.129,z = 228.564,     --(庐山)中秋_06仙女座圣衣箱
            },
        },
[33958]={
            {
                mapId = 3,x = -135.794,y = 483.129,z = 228.564,     --(庐山)中秋_07凤凰座圣衣箱
            },
        },
[33528]={
            {
                mapId = 10,x = -290.72,y = 311,z = 365.66,     --(海因斯坦堡)海因斯坦支线病枝
            },
        },
[33529]={
            {
                mapId = 10,x = -372.12,y = 315,z = 387.71,     --(海因斯坦堡)海因斯坦堡支线花瓣上的露水
            },
        },
[34029]={
            {
                mapId = 10,     --(海因斯坦堡)海因斯坦堡陈旧的信
            },
        },
[34030]={
            {
                mapId = 10,x = 143,y = 367,z = -98,     --(海因斯坦堡)海因斯坦堡十三年前的葡萄酒
            },
        },
[34256]={
            {
                mapId = 10,x = 212,y = 300,z = 390,     --(海因斯坦堡)海因斯坦堡支线蘑菇
            },
        },
[34773]={
            {
                mapId = 2,x = -180,y = 339,z = 328,     --(圣域)圣域礼花
            },
        },
[34648]={
            {
                mapId = 324,x = -268,y = 134,z = 536,     --(剧情12宫双子宫)
            },
        },
[34646]={
            {
                mapId = 324,x = -268,y = 134,z = 507,     --(剧情12宫双子宫)
            },
        },
[34847]={
            {
                mapId = 9,x = -428.074,y = 302.067,z = 254.676,     --(仙女岛)仙女岛支线补01护身符
            },
        },
[34848]={
            {
                mapId = 9,x = -378.487,y = 310.663,z = 277.164,     --(仙女岛)仙女岛支线补02封印符咒
            },
        },
[34849]={
            {
                mapId = 9,x = 18.1544,y = 332.297,z = 135.303,     --(仙女岛)仙女岛支线补03异样小宇宙
            },
        },
[34850]={
            {
                mapId = 9,x = 294.41,y = 340.955,z = 222.173,     --(仙女岛)仙女岛支线补04木箱
            },
        },
[35461]={
            {
                mapId = 2,x = -211.392,y = 350.307,z = 338.869,     --(圣域)万圣节南瓜灯1
            },
        },
[35462]={
            {
                mapId = 2,x = -172.743,y = 342.538,z = 280.678,     --(圣域)万圣节南瓜灯2
            },
        },
[35463]={
            {
                mapId = 2,x = -267.504,y = 361.096,z = 334.809,     --(圣域)万圣节南瓜灯3
            },
        },
[35464]={
            {
                mapId = 2,x = -167.197,y = 339.336,z = 331.988,     --(圣域)万圣节烟花
            },
        },
[35243]={
            {
                mapId = 11,x = 408,y = 422,z = 111,     --(冥界下篇)冥界下篇01奇怪的石块
            },
        },
[35244]={
            {
                mapId = 11,x = 401,y = 422,z = 103,     --(冥界下篇)冥界下篇02血蘑菇
            },
        },
[35245]={
            {
                mapId = 11,x = 441,y = 422,z = 163,     --(冥界下篇)冥界下篇03血雾之源
            },
        },
[35246]={
            {
                mapId = 11,x = 395,y = 425,z = 34,     --(冥界下篇)冥界下篇04血之结晶
            },
        },
[35247]={
            {
                mapId = 11,x = 524,y = 426,z = 86,     --(冥界下篇)冥界下篇05石碑碎片
            },
        },
[35248]={
            {
                mapId = 11,x = 519,y = 425,z = 99,     --(冥界下篇)冥界下篇06遗落的宝石
            },
        },
[35249]={
            {
                mapId = 11,x = 599,y = 426,z = 139,     --(冥界下篇)冥界下篇07冥王神衣
            },
        },
[35250]={
            {
                mapId = 11,x = 725,y = 432,z = 280,     --(冥界下篇)冥界下篇08昏迷的灵魂
            },
        },
[35251]={
            {
                mapId = 11,x = 802,y = 417,z = 206,     --(冥界下篇)冥界下篇09鲁邦的妹妹
            },
        },
[35252]={
            {
                mapId = 11,x = 747,y = 401,z = 443,     --(冥界下篇)冥界下篇10泰坦石柱
            },
        },
[35253]={
            {
                mapId = 11,x = 819,y = 399,z = 776,     --(冥界下篇)冥界下篇11昏迷的穆
            },
        },
[35254]={
            {
                mapId = 11,x = 816,y = 399,z = 777,     --(冥界下篇)冥界下篇12昏迷的米罗
            },
        },
[35255]={
            {
                mapId = 11,x = 814,y = 399,z = 777,     --(冥界下篇)冥界下篇13昏迷的艾欧里亚
            },
        },
[35256]={
            {
                mapId = 11,x = 705,y = 401,z = 818,     --(冥界下篇)冥界下篇14可疑的冰块
            },
        },
[35257]={
            {
                mapId = 11,x = -681,y = 913,z = 832,     --(冥界下篇)冥界下篇15昏迷的瞬
            },
        },
[35475]={
            {
                mapId = 11,x = -583,y = 931,z = 914,     --(冥界下篇)冥界下篇16叹息之墙
            },
        },
[35995]={
            {
                mapId = 11,x = 452,y = 426,z = 134,     --(冥界下篇)冥界下篇17血雾之源
            },
        },
[35996]={
            {
                mapId = 11,x = 433,y = 422,z = 105,     --(冥界下篇)冥界下篇18血雾之源
            },
        },
[35997]={
            {
                mapId = 11,x = 374,y = 426,z = 60,     --(冥界下篇)冥界下篇19血雾之源
            },
        },
[35514]={
            {
                mapId = 11,x = 937,y = 299,z = -737,     --(冥界)冥界上篇01积尸气
            },
        },
[35515]={
            {
                mapId = 11,x = 488,y = 304,z = -815,     --(冥界)冥界上篇02冥气冰柩
            },
        },
[35516]={
            {
                mapId = 11,x = 487,y = 304,z = -808,     --(冥界)冥界上篇03制裁魔剑
            },
        },
[35517]={
            {
                mapId = 11,x = 564,y = 324,z = -388,     --(冥界)冥界上篇04寂静结界
            },
        },
[35518]={
            {
                mapId = 11,x = 570,y = 299,z = -731,     --(冥界)冥界上篇05散落的钱币
            },
        },
[35520]={
            {
                mapId = 11,x = -83,y = 271,z = -716,     --(冥界)冥界上篇07花瓣
            },
        },
[35521]={
            {
                mapId = 11,x = -51,y = 291,z = -62,     --(冥界)冥界上篇08死者之柱
            },
        },
[35522]={
            {
                mapId = 11,x = 687,y = 298,z = -859,     --(冥界)冥界上篇09溺者灵魂
            },
        },
[35991]={
            {
                mapId = 11,x = 708,y = 298,z = -743,     --(冥界)冥界上篇10水桶
            },
        },
[36468]={
            {
                mapId = 11,x = 715,y = 385,z = 460,     --(冥界)冥界下篇20泰坦石柱
            },
        },
[36469]={
            {
                mapId = 11,x = 672,y = 394,z = 476,     --(冥界)冥界下篇21泰坦石柱
            },
        },
[37266]={
            {
                mapId = 2,x = -111,y = 323,z = 86,     --(圣域)感恩节_一篮食物
            },
        },
[35519]={
            {
                mapId = 11,x = 645,y = 299,z = -584,     --(冥界)冥界上篇06分散的肢体
            },
        },
[35998]={
            {
                mapId = 11,x = 894,y = 430,z = 411,     --(冥界下篇)冥界下篇20载具石头
            },
        },
[37397]={
            {
                mapId = 7,x = -410.596,y = 376.032,z = -72.2728,     --(东西伯利亚)传记任务雪玫瑰
            },
        },
[37649]={
            {
                mapId = 4,x = 264.004,y = 317.52,z = 145.609,     --(银河竞技场)
            },
        },
[38234]={
            {
                mapId = 2,x = -182.588,y = 339.294,z = 318.746,     --(圣域)圣诞节任务圣诞树
            },
        },
[38235]={
            {
                mapId = 2,x = -98.666,y = 322.328,z = 75.0822,     --(圣域)圣诞节任务圣诞袜
            },
        },
[37495]={
            {
                mapId = 11,x = 408.273,y = 426.077,z = 49.003,     --(冥界支线下)冥界支线01血池_血咒之源
            },
        },
[37497]={
            {
                mapId = 11,x = 515.52622,y = 425.863,z = 116.731,     --(冥界支线下)冥界支线03热砂_金沙
            },
        },
[37498]={
            {
                mapId = 11,x = 509.92334,y = 425.923,z = 111.348,     --(冥界支线下)冥界支线04热砂_陶罐
            },
        },
[37499]={
            {
                mapId = 11,x = 821.143,y = 415.419,z = 240.598,     --(冥界支线下)冥界支线05群蛇_曼德拉草
            },
        },
[37500]={
            {
                mapId = 11,x = 862.067,y = 409.125,z = 322.982,     --(冥界支线下)冥界支线06群蛇_奇特的盾牌碎片
            },
        },
[37501]={
            {
                mapId = 11,x = 819.121,y = 415.905,z = 238.714,     --(冥界支线下)冥界支线07群蛇_小偷
            },
        },
[37503]={
            {
                mapId = 11,x = 830.452,y = 399.991,z = 748.66,     --(冥界支线下)冥界支线09寒冰_阿鲁迪巴透明矿
            },
        },
[37504]={
            {
                mapId = 11,x = 829.022,y = 399.895,z = 747.493,     --(冥界支线下)冥界支线10寒冰_冰块
            },
        },
[37505]={
            {
                mapId = 11,x = 787.702,y = 399.223,z = 787.283,     --(冥界支线下)冥界支线11寒冰_迪斯马斯克透明矿
            },
        },
[37506]={
            {
                mapId = 11,x = 735.743,y = 400.781,z = 813.359,     --(冥界支线下)冥界支线12寒冰_冥火
            },
        },
[37507]={
            {
                mapId = 11,x = 736.515,y = 400.499,z = 813.603,     --(冥界支线下)冥界支线13寒冰_米罗透明矿
            },
        },
[37508]={
            {
                mapId = 11,x = -634.423,y = 833.961,z = 305.555,     --(冥界支线下)冥界支线14该隐之厅_该隐之石
            },
        },
[37509]={
            {
                mapId = 11,x = -821.497,y = 853.664,z = 492.2232,     --(冥界支线下)冥界支线15安蒂诺拉之厅_安第诺拉之石
            },
        },
[37510]={
            {
                mapId = 11,x = -705.29,y = 913.965,z = 853.66,     --(冥界支线下)冥界支线16犹大之厅_犹大之石
            },
        },
[37511]={
            {
                mapId = 11,x = -665.801,y = 913.965,z = 806.367,     --(冥界支线下)冥界支线17犹大之厅_黄金匕首
            },
        },
[37502]={
            {
                mapId = 11,x = 862.067,y = 409.125,z = 322.982,     --(冥界支线下)冥界支线05群蛇_宝物
            },
        },
[39713]={
            {
                mapId = 11,x = -225,y = 278,z = -454,     --(冥界支线上)冥界_支线_01_鬼瘴沼气
            },
        },
[39716]={
            {
                mapId = 11,x = -175,y = 298,z = -135,     --(冥界支线上)冥界_支线_04_小宇宙残片
            },
        },
[39719]={
            {
                mapId = 11,x = -89,y = 277,z = -414,     --(冥界支线上)冥界_支线_05_冥界宝石
            },
        },
[39754]={
            {
                mapId = 11,x = -170,y = 287,z = -83,     --(冥界支线上)冥界_支线_06_大量残片
            },
        },
[39731]={
            {
                mapId = 5,x = 2.50008,y = 308.076,z = -158.835,     --(环任务)环任务_苏兰特食物
            },
        },
[39801]={
            {
                mapId = 2,x = -131,y = 325,z = 32,     --(圣域)
            },
        },
[40146]={
            {
                mapId = 2,x = -179.144,y = 339.261,z = 305.942,     --(圣域)新年01_金蛋1
            },
        },
[39752]={
            {
                mapId = 333,x = 308,y = 536,z = -194,     --(剧情12宫双鱼宫)星矢
            },
        },
[39753]={
            {
                mapId = 333,x = 843,y = 681,z = -422,     --(剧情12宫双鱼宫)盾牌
            },
        },
[40518]={
            {
                mapId = 2,x = -226,y = 338,z = 0,     --(圣域)情人元宵_许愿池
            },
        },
[41926]={
            {
                mapId = 11,x = 553.74,y = 310,z = -316.73,     --(个人库)个人库100-110殒之铃兰
            },
        },
[41927]={
            {
                mapId = 11,x = 833.93,y = 417,z = 420.34,     --(个人库)个人库100-110殒之铃兰
            },
        },
[42040]={
            {
                mapId = 1,x = -160,y = 374,z = 429,     --(清明节日任务链)清明_艾德之墓
            },
        },
[42041]={
            {
                mapId = 1,x = -140,y = 373,z = 433,     --(清明节日任务链)清明_鲜花
            },
        },
[42086]={
            {
                mapId = 10,x = 49.7214,y = 368.624,z = -225.954,     --(环任务)拉达曼迪斯_密信
            },
        },
[42275]={
            {
                mapId = 2,x = -338.99,y = 350.307,z = 373.255,     --(劳动节日任务链)劳动节_智慧之果
            },
            {
                mapId = 2,x = -214.031,y = 339.128,z = -14.7988,     --(劳动节日任务链)劳动节_智慧之果
            },
            {
                mapId = 2,x = -131.852,y = 326.138,z = 21.5887,     --(劳动节日任务链)劳动节_智慧之果
            },
        },
[42226]={
            {
                mapId = 1,x = -3,y = 307,z = -11,     --(海龙主线)海龙主线01礁石
            },
        },
[42227]={
            {
                mapId = 1,x = -195,y = 309,z = -53,     --(海龙主线)海龙主线02项链
            },
        },
[42228]={
            {
                mapId = 2,x = 61,y = 290,z = 187,     --(海龙主线)海龙主线03金穗花
            },
        },
[42335]={
            {
                mapId = 1,x = 133,y = 430,z = 316,     --(海龙主线)海龙主线04残存的小宇宙
            },
        },
[44155]={
            {
                mapId = 1,x = -16,y = 308,z = -5,     --(海龙主线)海皇之戟
            },
        },
--------NPC-----------------------------------------------------------------------------
[100000]={
            {
                mapId = 2,x = 100,y = 100,z = 100,     --(填法示例)一般填法
            },
        },
[100001]={
            {
                mapId = 2,
                { x = 1,y = 1,z = 1,},     --(填法示例)100001对应区域中心点1随机点1——中心点具体坐标没填就算出来
                { x = 1,y = 2,z = 1,},     --(填法示例)100001对应区域中心点1随机点2
            },
            {
                mapId = 1,
                { x = 13,y = 2,z = 10,},     --(填法示例)100001对应区域中心点2随机点1——中心点具体坐标没填就算出来
                { x = 3,y = 5,z = 6,},     --(填法示例)100001对应区域中心点2随机点2
            },
            {
                mapId = 2,x = 50,y = 50,z = 50,r = 10,
                { x = 13,y = 2,z = 10,},     --(填法示例)100001对应区域中心点3随机点1——此中心填了中心点
                { x = 3,y = 5,z = 6,},     --(填法示例)100001对应区域中心点3随机点2
            },
            {
                mapId = 2,x = 100,y = 100,z = 100,r = 1,     --(填法示例)100001对应区域中心点4
            },
        },
[100002]={
            {
                mapId = 1,x = 105,y = 123,z = 124,     --(填法示例)一般填法
            },
        },
[5086]={
            {
                mapId = 50,x = -296,y = 399,z = 170,     --(选职业小黑屋)选职业用雅典娜
            },
        },
[5087]={
            {
                mapId = 50,x = -296,y = 399,z = 164,     --(选职业小黑屋)选职业用天马之魂
            },
        },
[5088]={
            {
                mapId = 50,x = -293,y = 399,z = 165,     --(选职业小黑屋)选职业用天龙之魂
            },
        },
[5089]={
            {
                mapId = 50,x = -292,y = 399,z = 167,     --(选职业小黑屋)选职业用白鸟之魂
            },
        },
[5090]={
            {
                mapId = 50,x = -298,y = 399,z = 164,     --(选职业小黑屋)选职业用仙女之魂
            },
        },
[5091]={
            {
                mapId = 50,x = -300,y = 399,z = 166,     --(选职业小黑屋)选职业用凤凰之魂
            },
        },
[543]={
            {
                mapId = 1,x = -487,y = 375,z = -32,     --(新手村)主线01魔铃训练场外
            },
        },
[544]={
            {
                mapId = 1,x = -344,y = 326,z = 103,     --(新手村)主线02魔铃训练场内1
            },
        },
[545]={
            {
                mapId = 1,x = -410,y = 325,z = 115,     --(新手村)主线03魔铃训练场内2
            },
        },
[546]={
            {
                mapId = 1,x = -404,y = 311,z = 337,     --(新手村)主线04魔铃训练场内3
            },
        },
[547]={
            {
                mapId = 1,x = -402,y = 327,z = 143,     --(新手村)主线05艾娅训练场内
            },
        },
[548]={
            {
                mapId = 1,x = -326,y = 328,z = 88,     --(新手村)主线06卡西欧士训练场外
            },
        },
[549]={
            {
                mapId = 1,x = -352,y = 332,z = 33,     --(新手村)主线07艾娅沙滩悬崖
            },
        },
[550]={
            {
                mapId = 1,x = -267,y = 309,z = -50,     --(新手村)主线08艾德沙滩
            },
        },
[551]={
            {
                mapId = 1,x = -270,y = 309,z = -51,     --(新手村)主线09星矢沙滩1
            },
        },
[552]={
            {
                mapId = 1,x = -294,y = 310,z = 9,     --(新手村)主线10星矢沙滩2
            },
        },
[553]={
            {
                mapId = 1,x = -176.892,y = 351.068,z = 146.886,     --(群星之地)主线11艾欧里亚竞技场
            },
        },
[554]={
            {
                mapId = 1,x = -162,y = 351,z = 152,     --(新手村)主线12艾娅竞技场
            },
        },
[555]={
            {
                mapId = 1,x = -176,y = 351,z = 129,     --(新手村)主线13魔铃竞技场
            },
        },
[556]={
            {
                mapId = 1,x = -121,y = 371,z = 336,     --(新手村)主线14艾欧里亚墓地入口
            },
        },
[557]={
            {
                mapId = 1,x = 145,y = 421,z = 305,     --(新手村)主线15星矢墓地入口
            },
        },
[558]={
            {
                mapId = 1,x = -100,y = 376,z = 431,     --(新手村)主线16艾娅墓地
            },
        },
[559]={
            {
                mapId = 1,x = -16,y = 366,z = 331,     --(新手村)主线17艾欧里亚墓地深处
            },
        },
[560]={
            {
                mapId = 1,x = 116,y = 421,z = 334,     --(新手村)主线18艾欧里亚观星楼入口
            },
        },
[561]={
            {
                mapId = 1,x = 131,y = 430,z = 304,     --(新手村)主线19艾欧里亚观星楼内
            },
        },
[562]={
            {
                mapId = 1,x = 123,y = 430,z = 308,     --(新手村)主线20艾娅观星楼内
            },
        },
[563]={
            {
                mapId = 1,x = -420,y = 327,z = 102,     --(新手村)主线21魔铃逃亡路1
            },
        },
[564]={
            {
                mapId = 1,x = -430,y = 315,z = 268,     --(新手村)主线22魔铃逃亡路2
            },
        },
[565]={
            {
                mapId = 1,x = -437,y = 315,z = 280,     --(新手村)主线23星矢逃亡路
            },
        },
[566]={
            {
                mapId = 1,x = -396,y = 311,z = 385,     --(新手村)主线24船夫
            },
        },
[1547]={
            {
                mapId = 3,x = -275,y = 320,z = -73,     --(庐山)支线01阿翔
            },
        },
[10199]={
            {
                mapId = 1,x = -175.483,y = 351.048,z = 157.517,     --(新手村)主线25莎尔娜竞技场
            },
        },
[10210]={
            {
                mapId = 1,x = -138,y = 351,z = 159,     --(新手村)主线26愤怒的学员
            },
        },
[10050]={
            {
                mapId = 4,x = 72,y = 293,z = 420,     --(冯博用测试)冯博用测试
            },
        },
[10051]={
            {
                mapId = 3,x = -278,y = 309,z = 379,     --(冯博用测试)冯博用测试
            },
        },
[1547]={
            {
                mapId = 3,x = -268,y = 319,z = -71,     --(庐山)庐山支线阿步
            },
        },
[1574]={
            {
                mapId = 3,x = -237,y = 321,z = -106,     --(庐山)庐山支线春丽
            },
        },
[1575]={
            {
                mapId = 3,x = 12,y = 314,z = -167,     --(庐山)庐山支线紫龙
            },
        },
[1559]={
            {
                mapId = 3,x = -111,y = 313,z = -33,     --(庐山)庐山支线狄蒂斯
            },
        },
[1566]={
            {
                mapId = 3,x = 23,y = 340,z = -46,     --(庐山)庐山支线高临
            },
        },
[1565]={
            {
                mapId = 3,x = -210,y = 313,z = -194,     --(庐山)庐山支线狗肉
            },
        },
[1555]={
            {
                mapId = 3,x = 133,y = 461,z = 339,     --(庐山)庐山支线韩百果
            },
        },
[1588]={
            {
                mapId = 3,x = -235,y = 320,z = -138,     --(庐山)庐山支线赫尔墨斯
            },
        },
[1571]={
            {
                mapId = 3,x = -243,y = 319,z = -111,     --(庐山)庐山支线牡丹
            },
        },
[1587]={
            {
                mapId = 3,x = -184,y = 313,z = -232,     --(庐山)庐山支线牛二小
            },
        },
[1564]={
            {
                mapId = 3,x = -156,y = 313,z = -158,     --(庐山)庐山支线青岚
            },
        },
[1558]={
            {
                mapId = 3,x = 14,y = 314,z = -150,     --(庐山)庐山支线神龙
            },
        },
[9835]={
            {
                mapId = 3,x = 20,y = 340,z = -17,     --(庐山)庐山支线神龙熊猫传说用
            },
        },
[1572]={
            {
                mapId = 3,x = -229,y = 321,z = -105,     --(庐山)庐山支线石九明
            },
        },
[1573]={
            {
                mapId = 3,x = -254,y = 319,z = -148,     --(庐山)庐山支线苏芳
            },
        },
[1552]={
            {
                mapId = 3,x = 97,y = 444,z = 313,     --(庐山)庐山支线陶老丈
            },
        },
[1560]={
            {
                mapId = 3,x = -216,y = 319,z = -157,     --(庐山)庐山支线万晓生
            },
        },
[1549]={
            {
                mapId = 3,x = -276,y = 313,z = -41,     --(庐山)庐山支线小铃
            },
        },
[1551]={
            {
                mapId = 3,x = 4,y = 314,z = -185,     --(庐山)庐山支线小甜甜
            },
        },
[1550]={
            {
                mapId = 3,x = -239,y = 319,z = -155,     --(庐山)庐山支线小武空1
            },
        },
[9825]={
            {
                mapId = 3,x = -272,y = 329,z = -121,     --(庐山)庐山支线小武空2
            },
        },
[9826]={
            {
                mapId = 3,x = -308,y = 317,z = 20,     --(庐山)庐山支线小武空3
            },
        },
[9827]={
            {
                mapId = 3,x = -18,y = 314,z = -191,     --(庐山)庐山支线小武空4
            },
        },
[9828]={
            {
                mapId = 3,x = 5,y = 449,z = 293,     --(庐山)庐山支线小武空5
            },
        },
[9829]={
            {
                mapId = 3,x = -173,y = 483,z = 275,     --(庐山)庐山支线小武空6
            },
        },
[9830]={
            {
                mapId = 3,x = 101,y = 444,z = 307,     --(庐山)庐山支线小武空7
            },
        },
[1561]={
            {
                mapId = 3,x = 6,y = 339,z = -60,     --(庐山)支线熊猫巴斯
            },
        },
[1557]={
            {
                mapId = 3,x = -53,y = 327,z = 26,     --(庐山)支线熊猫圆圆1
            },
        },
[1556]={
            {
                mapId = 3,x = 23,y = 340,z = -20,     --(庐山)支线熊猫团团
            },
        },
[1577]={
            {
                mapId = 3,x = -243,y = 319,z = -75,     --(庐山)庐山支线王五
            },
        },
[8609]={
            {
                mapId = 2,x = 60,y = 289,z = -112,     --(库任务)库任务_拉切西斯
            },
        },
[1239]={
            {
                mapId = 3,x = -273,y = 314,z = -308,     --(庐山)主线港口船夫
            },
        },
[5035]={
            {
                mapId = 3,x = -255,y = 314,z = -269,     --(庐山)主线港口村民
            },
        },
[8608]={
            {
                mapId = 2,x = -230,y = 337,z = 71,     --(库任务)库任务_克洛托
            },
        },
[5036]={
            {
                mapId = 3,x = -230,y = 314,z = -200,     --(庐山)主线村口村民
            },
        },
[5039]={
            {
                mapId = 3,x = -234,y = 315,z = -185,     --(庐山)主线村口李云
            },
        },
[1241]={
            {
                mapId = 3,x = -234,y = 320,z = -109,     --(庐山)主线村中李云1
            },
        },
[1263]={
            {
                mapId = 3,x = -234,y = 320,z = -109,     --(庐山)主线村中李云2
            },
        },
[8443]={
            {
                mapId = 3,x = -237,y = 320,z = -107,     --(庐山)主线村中春丽1
            },
        },
[1245]={
            {
                mapId = 3,x = -239,y = 320,z = -106,     --(庐山)主线村中紫龙1
            },
        },
[1240]={
            {
                mapId = 3,x = -271,y = 329,z = -123,     --(庐山)主线村中村长
            },
        },
[1253]={
            {
                mapId = 3,x = -268,y = 332,z = -132,     --(庐山)主线村中雷虎
            },
        },
[1244]={
            {
                mapId = 3,x = -240,y = 319,z = -87,     --(庐山)主线村中紫龙2
            },
        },
[1246]={
            {
                mapId = 3,x = -237,y = 320,z = -109,     --(庐山)主线村中紫龙3
            },
        },
[1242]={
            {
                mapId = 3,x = -149,y = 315,z = -260,     --(庐山)主线村外春丽
            },
        },
[5040]={
            {
                mapId = 3,x = -127,y = 322,z = -229,     --(庐山)主线小庙李云
            },
        },
[5038]={
            {
                mapId = 3,x = -87,y = 326,z = -254,     --(庐山)主线小庙春丽
            },
        },
[5037]={
            {
                mapId = 3,x = -83,y = 315,z = -154,     --(庐山)主线梯田村民
            },
        },
[5042]={
            {
                mapId = 3,x = -9,y = 314,z = -191,     --(庐山)主线梯田紫龙
            },
        },
[1251]={
            {
                mapId = 3,x = -116,y = 312,z = -42,     --(庐山)主线碧龙潭李云
            },
        },
[5043]={
            {
                mapId = 3,x = -9,y = 314,z = -195,     --(庐山)主线圣域士兵
            },
        },
[9849]={
            {
                mapId = 3,x = -27,y = 314,z = -190,     --(庐山)主线惊惧的孩童
            },
        },
[5044]={
            {
                mapId = 3,x = -138,y = 312,z = -117,     --(庐山)主线碧龙潭边紫龙
            },
        },
[1249]={
            {
                mapId = 3,x = -164,y = 337,z = 22,     --(庐山)主线庐山瀑布春丽
            },
        },
[1297]={
            {
                mapId = 3,x = -162,y = 337,z = 22,     --(庐山)主线庐山瀑布穆
            },
        },
[1247]={
            {
                mapId = 3,x = -156,y = 337,z = 20,     --(庐山)主线庐山瀑布童虎
            },
        },
[1248]={
            {
                mapId = 3,x = -158,y = 337,z = 19,     --(庐山)主线庐山瀑布紫龙
            },
        },
[1250]={
            {
                mapId = 3,x = -143,y = 329,z = 20,     --(庐山)主线庐山悬崖春丽
            },
        },
[5045]={
            {
                mapId = 3,x = -138,y = 329,z = 19,     --(庐山)主线庐山悬崖紫龙
            },
        },
[1265]={
            {
                mapId = 3,x = -112,y = 312,z = -41,     --(庐山)主线碧龙潭迪斯马斯克
            },
        },
[1254]={
            {
                mapId = 3,x = -35,y = 330,z = -33,     --(庐山)主线竹林外春丽
            },
        },
[1268]={
            {
                mapId = 3,x = -88,y = 334,z = -99,     --(庐山)主线竹林李云的药箱
            },
        },
[1252]={
            {
                mapId = 3,x = -75,y = 334,z = -97,     --(庐山)主线竹林茅屋紫龙
            },
        },
[1259]={
            {
                mapId = 3,x = 17,y = 340,z = -43,     --(庐山)主线竹林庐山学员
            },
        },
[1258]={
            {
                mapId = 3,x = 27,y = 339,z = 1,     --(庐山)主线竹林悬崖雷虎
            },
        },
[1257]={
            {
                mapId = 3,x = 24,y = 339,z = 5,     --(庐山)主线竹林悬崖紫龙
            },
        },
[1264]={
            {
                mapId = 3,x = 12,y = 348,z = 84,     --(庐山)主线山路紫龙
            },
        },
[1262]={
            {
                mapId = 3,x = 11,y = 348,z = 85,     --(庐山)主线山路学员1
            },
        },
[1261]={
            {
                mapId = 3,x = 5,y = 363,z = 130,     --(庐山)主线山路学员2
            },
        },
[1270]={
            {
                mapId = 3,x = 41,y = 391,z = 134,     --(庐山)主线再会岭紫龙
            },
        },
[1269]={
            {
                mapId = 3,x = 71,y = 390,z = 138,     --(庐山)主线再会岭雷虎
            },
        },
[1271]={
            {
                mapId = 3,x = 65,y = 409,z = 182,     --(庐山)主线神龙岭入口紫龙
            },
        },
[1272]={
            {
                mapId = 3,x = 55,y = 410,z = 180,     --(庐山)主线神龙碑
            },
        },
[5047]={
            {
                mapId = 3,x = 51,y = 410,z = 175,     --(庐山)主线神龙岭守卫1
            },
        },
[1273]={
            {
                mapId = 3,x = 19,y = 450,z = 302,     --(庐山)主线神龙岭守卫2
            },
        },
[1275]={
            {
                mapId = 3,x = 4,y = 450,z = 290,     --(庐山)主线神龙岭紫龙1
            },
        },
[1285]={
            {
                mapId = 3,x = 18,y = 450,z = 267,     --(庐山)主线神龙岭紫龙2
            },
        },
[1274]={
            {
                mapId = 3,x = 9,y = 450,z = 264,     --(庐山)主线神龙岭神龙碑
            },
        },
[1276]={
            {
                mapId = 3,x = -84,y = 484,z = 253,     --(庐山)主线天池紫龙
            },
        },
[1277]={
            {
                mapId = 3,x = -146,y = 483,z = 152,     --(庐山)主线天池神龙
            },
        },
[1279]={
            {
                mapId = 3,x = -148,y = 483,z = 193,     --(庐山)主线天池童虎
            },
        },
[1280]={
            {
                mapId = 3,x = -182,y = 483,z = 295,     --(庐山)主线福地入口紫龙
            },
        },
[1286]={
            {
                mapId = 3,x = 62,y = 450,z = 307,     --(庐山)主线遗址童虎1
            },
        },
[1288]={
            {
                mapId = 3,x = 139,y = 463,z = 373,     --(庐山)主线遗址春丽1
            },
        },
[1291]={
            {
                mapId = 3,x = 145,y = 464,z = 349,     --(庐山)主线遗址雷虎1
            },
        },
[1287]={
            {
                mapId = 3,x = 114,y = 467,z = 361,     --(庐山)主线遗址童虎2
            },
        },
[1292]={
            {
                mapId = 3,x = 175,y = 463,z = 308,     --(庐山)主线遗址雷虎2
            },
        },
[1290]={
            {
                mapId = 3,x = 159,y = 462,z = 290,     --(庐山)主线遗址紫龙1
            },
        },
[1293]={
            {
                mapId = 3,x = 169,y = 463,z = 299,     --(庐山)主线遗址紫龙2
            },
        },
[1295]={
            {
                mapId = 3,x = 156,y = 463,z = 277,     --(庐山)主线遗址紫龙3
            },
        },
[1296]={
            {
                mapId = 3,x = 153,y = 463,z = 280,     --(庐山)主线遗址童虎3
            },
        },
[5041]={
            {
                mapId = 3,x = -178,y = 314,z = -199,     --(庐山)主线村外昏迷的庐山学员
            },
        },
[8444]={
            {
                mapId = 3,x = -196,y = 321,z = -135,     --(庐山)主线隐龙村春丽屋
            },
        },
[610]={
            {
                mapId = 4,x = 70,y = 285,z = 350,     --(银河竞技场)银都码头_船长
            },
        },
[637]={
            {
                mapId = 4,x = 105,y = 290,z = 333,     --(银河竞技场)银都码头_冰河1
            },
        },
[638]={
            {
                mapId = 4,x = 152,y = 315,z = 335,     --(银河竞技场)银都市_冰河2
            },
        },
[639]={
            {
                mapId = 4,x = 214,y = 315,z = 325,     --(银河竞技场)银都市_观众1
            },
        },
[640]={
            {
                mapId = 4,x = 209,y = 316,z = 304,     --(银河竞技场)银都市_观众2
            },
        },
[641]={
            {
                mapId = 4,x = 194,y = 316,z = 308,     --(银河竞技场)银都市_观众3
            },
        },
[642]={
            {
                mapId = 4,x = 230,y = 315,z = 329,     --(银河竞技场)银都市_观众4
            },
        },
[643]={
            {
                mapId = 4,x = 222,y = 328,z = 392,     --(银河竞技场)纱织别墅_纱织1
            },
        },
[644]={
            {
                mapId = 4,x = 223,y = 317,z = 340,     --(银河竞技场)纱织别墅_古拉杜财团雇员
            },
        },
[645]={
            {
                mapId = 4,x = 224,y = 328,z = 419,     --(银河竞技场)城户大宅_辰巳德丸1
            },
        },
[646]={
            {
                mapId = 4,x = 219,y = 326,z = 385,     --(银河竞技场)纱织别墅_美穗1
            },
        },
[647]={
            {
                mapId = 4,x = 285,y = 317,z = 192,     --(银河竞技场)星之子学园_小茜
            },
        },
[648]={
            {
                mapId = 4,x = 279,y = 317,z = 249,     --(银河竞技场)银都市_被盗的观众
            },
        },
[649]={
            {
                mapId = 4,x = 363,y = 317,z = 194,     --(银河竞技场)银都市_空荡荡的钱包
            },
        },
[650]={
            {
                mapId = 4,x = 420,y = 314,z = 166,     --(银河竞技场)银都市_昏迷的天翼
            },
        },
[651]={
            {
                mapId = 4,x = 419,y = 314,z = 178,     --(银河竞技场)银都市_星矢1
            },
        },
[652]={
            {
                mapId = 4,x = 420,y = 314,z = 166,     --(银河竞技场)银都市_天翼
            },
        },
[653]={
            {
                mapId = 4,x = 328,y = 318,z = 111,     --(银河竞技场)星之子学园_春丽1
            },
        },
[654]={
            {
                mapId = 4,x = 327,y = 317,z = 107,     --(银河竞技场)星之子学园_紫龙1
            },
        },
[655]={
            {
                mapId = 4,x = 302,y = 312,z = -5,     --(银河竞技场)星之子学园_瞬1
            },
        },
[656]={
            {
                mapId = 4,x = 221,y = 326,z = 385,     --(银河竞技场)纱织别墅_星矢2
            },
        },
[657]={
            {
                mapId = 4,x = 359,y = 329,z = 326,     --(银河竞技场)银河竞技场_瞬2
            },
        },
[658]={
            {
                mapId = 4,x = 322,y = 314,z = -51,     --(银河竞技场)青木原树海_瞬3
            },
        },
[659]={
            {
                mapId = 4,x = 454,y = 312,z = -92,     --(银河竞技场)青木原树海_黑暗凤凰1
            },
        },
[662]={
            {
                mapId = 4,x = 415,y = 305,z = -131,     --(银河竞技场)青木原树海_瞬4
            },
        },
[663]={
            {
                mapId = 4,x = 424,y = 306,z = -141,     --(银河竞技场)青木原树海_幼年潘多拉
            },
        },
[664]={
            {
                mapId = 4,x = 426,y = 306,z = -145,     --(银河竞技场)青木原树海_幼年一辉
            },
        },
[665]={
            {
                mapId = 4,x = 424,y = 306,z = -141,     --(银河竞技场)青木原树海_恐惧之梦-尼里伊斯
            },
        },
[666]={
            {
                mapId = 4,x = 415,y = 305,z = -131,     --(银河竞技场)青木原树海_瞬5
            },
        },
[667]={
            {
                mapId = 4,x = 233,y = 311,z = -131,     --(银河竞技场)青木原树海_星矢3
            },
        },
[670]={
            {
                mapId = 4,x = 220,y = 311,z = -177,     --(银河竞技场)青木原树海_幼年星华1
            },
        },
[671]={
            {
                mapId = 4,x = 218,y = 311,z = -175,     --(银河竞技场)青木原树海_幼年星矢1
            },
        },
[672]={
            {
                mapId = 4,x = 214,y = 310,z = -142,     --(银河竞技场)青木原树海_幼年星华2
            },
        },
[673]={
            {
                mapId = 4,x = 214,y = 310,z = -142,     --(银河竞技场)青木原树海_魔铃1
            },
        },
[674]={
            {
                mapId = 4,x = 214,y = 310,z = -142,     --(银河竞技场)青木原树海_迷醉之梦-俄尼奥斯
            },
        },
[677]={
            {
                mapId = 4,x = 374,y = 316,z = -331,     --(银河竞技场)青木原树海_迷失的游客雷克托
            },
        },
[678]={
            {
                mapId = 4,x = 375,y = 316,z = -326,     --(银河竞技场)青木原树海_迷失的游客乔安娜
            },
        },
[679]={
            {
                mapId = 4,x = 315,y = 295,z = -296,     --(银河竞技场)青木原树海_教皇
            },
        },
[680]={
            {
                mapId = 4,x = 323,y = 309,z = -259,     --(银河竞技场)青木原树海_黑暗凤凰2
            },
        },
[681]={
            {
                mapId = 4,x = 315,y = 295,z = -296,     --(银河竞技场)青木原树海_哈迪斯
            },
        },
[682]={
            {
                mapId = 4,x = 315,y = 295,z = -296,     --(银河竞技场)青木原树海_辉煌之梦-墨菲斯
            },
        },
[683]={
            {
                mapId = 4,x = 294,y = 294,z = -307,     --(银河竞技场)青木原树海_冰河3
            },
        },
[684]={
            {
                mapId = 4,x = 67,y = 286,z = -341,     --(银河竞技场)铃之村_鹿香1
            },
        },
[685]={
            {
                mapId = 4,x = 34,y = 292,z = -332,     --(银河竞技场)铃之村_雾隐1
            },
        },
[686]={
            {
                mapId = 4,x = -93,y = 311,z = -258,     --(银河竞技场)铃之村_鹿香2
            },
        },
[687]={
            {
                mapId = 4,x = -34,y = 297,z = -349,     --(银河竞技场)铃之村_雾隐2
            },
        },
[688]={
            {
                mapId = 4,x = -31,y = 297,z = -353,     --(银河竞技场)铃之村_黑暗天龙1
            },
        },
[689]={
            {
                mapId = 4,x = 11,y = 293,z = -306,     --(银河竞技场)铃之村_鹿香3
            },
        },
[690]={
            {
                mapId = 4,x = 33,y = 294,z = -275,     --(银河竞技场)铃之村_星矢4
            },
        },
[691]={
            {
                mapId = 4,x = 32,y = 294,z = -279,     --(银河竞技场)铃之村_冰河4
            },
        },
[692]={
            {
                mapId = 4,x = 40,y = 294,z = -272,     --(银河竞技场)铃之村_瞬5
            },
        },
[693]={
            {
                mapId = 4,x = 35,y = 295,z = -269,     --(银河竞技场)铃之村_紫龙2
            },
        },
[694]={
            {
                mapId = 4,x = 0,y = 295,z = -253,     --(银河竞技场)铃之村_冰河5
            },
        },
[697]={
            {
                mapId = 4,x = 55,y = 282,z = -186,     --(银河竞技场)鬼隐石阵_鹿香4
            },
        },
[698]={
            {
                mapId = 4,x = 1,y = 282,z = -136,     --(银河竞技场)鬼隐石阵_黑暗圣斗士尸体
            },
        },
[699]={
            {
                mapId = 4,x = 35,y = 284,z = -11,     --(银河竞技场)鬼隐石阵_冰河6
            },
        },
[700]={
            {
                mapId = 4,x = -5,y = 285,z = -37,     --(银河竞技场)鬼隐石阵_黑暗天龙2
            },
        },
[701]={
            {
                mapId = 4,x = -35,y = 281,z = 36,     --(银河竞技场)鬼隐石阵_星矢5
            },
        },
[702]={
            {
                mapId = 4,x = -176,y = 283,z = 41,     --(银河竞技场)忍野牧场_冰河7
            },
        },
[703]={
            {
                mapId = 4,x = -181,y = 283,z = 37,     --(银河竞技场)忍野牧场_莎尔拉1
            },
        },
[704]={
            {
                mapId = 4,x = -230,y = 285,z = 19,     --(银河竞技场)忍野牧场_索恩斯
            },
        },
[705]={
            {
                mapId = 4,x = -265,y = 283,z = -18,     --(银河竞技场)忍野牧场_放牧者鹰隼
            },
        },
[706]={
            {
                mapId = 4,x = -224,y = 287,z = -85,     --(银河竞技场)忍野牧场_老马
            },
        },
[707]={
            {
                mapId = 4,x = -261,y = 299,z = -115,     --(银河竞技场)富士山_星矢6
            },
        },
[708]={
            {
                mapId = 4,x = -327,y = 311,z = -98,     --(银河竞技场)富士山_黑暗仙女
            },
        },
[709]={
            {
                mapId = 4,x = -390,y = 335,z = -214,     --(银河竞技场)富士山_黑暗白鸟
            },
        },
[710]={
            {
                mapId = 4,x = -414,y = 360,z = -56,     --(银河竞技场)富士山_黑暗天马
            },
        },
[711]={
            {
                mapId = 4,x = -392,y = 364,z = 73,     --(银河竞技场)富士山_瞬6
            },
        },
[712]={
            {
                mapId = 4,x = -397,y = 364,z = 75,     --(银河竞技场)富士山_星矢7
            },
        },
[713]={
            {
                mapId = 4,x = -397,y = 364,z = 75,     --(银河竞技场)富士山_星矢8
            },
        },
[714]={
            {
                mapId = 4,x = -403,y = 365,z = 72,     --(银河竞技场)富士山_贵鬼1
            },
        },
[715]={
            {
                mapId = 4,x = -398,y = 365,z = 70,     --(银河竞技场)富士山_冰河8
            },
        },
[716]={
            {
                mapId = 4,x = -213,y = 286,z = -347,     --(银河竞技场)落日海滩_贵鬼2
            },
        },
[717]={
            {
                mapId = 4,x = -215,y = 285,z = -348,     --(银河竞技场)落日海滩_穆
            },
        },
[718]={
            {
                mapId = 4,x = -191,y = 284,z = -381,     --(银河竞技场)落日海滩_美斯狄
            },
        },
[719]={
            {
                mapId = 4,x = -140,y = 283,z = -417,     --(银河竞技场)落日海滩_魔铃2
            },
        },
[720]={
            {
                mapId = 4,x = -174,y = 283,z = -388,     --(银河竞技场)落日海滩_天马之墓
            },
        },
[721]={
            {
                mapId = 4,x = -198,y = 284,z = -374,     --(银河竞技场)落日海滩_星矢9
            },
        },
[722]={
            {
                mapId = 4,x = -263,y = 281,z = -395,     --(银河竞技场)落日海滩_魔铃3
            },
        },
[723]={
            {
                mapId = 4,x = -274,y = 282,z = -375,     --(银河竞技场)落日海滩_摩西斯
            },
        },
[724]={
            {
                mapId = 4,x = -263,y = 282,z = -385,     --(银河竞技场)落日海滩_星矢10
            },
        },
[725]={
            {
                mapId = 4,x = 350,y = 329,z = 339,     --(银河竞技场)银河竞技场_紫龙3
            },
        },
[726]={
            {
                mapId = 4,x = -352,y = 361,z = 71,     --(银河竞技场)红叶断崖_加米安
            },
        },
[727]={
            {
                mapId = 4,x = -348,y = 361,z = 73,     --(银河竞技场)红叶断崖_莎尔拉2
            },
        },
[730]={
            {
                mapId = 4,x = -320,y = 341,z = 59,     --(银河竞技场)红叶断崖_纱织2
            },
        },
[731]={
            {
                mapId = 4,x = -300,y = 341,z = 59,     --(银河竞技场)红叶断崖_一辉
            },
        },
[732]={
            {
                mapId = 4,x = -239,y = 379,z = 214,     --(银河竞技场)红叶断崖_亚鲁歌路
            },
        },
[733]={
            {
                mapId = 4,x = -238,y = 379,z = 216,     --(银河竞技场)红叶断崖_紫龙4
            },
        },
[734]={
            {
                mapId = 4,x = 224,y = 326,z = 383,     --(银河竞技场)红叶断崖_紫龙5
            },
        },
[735]={
            {
                mapId = 4,x = -235,y = 379,z = 215,     --(银河竞技场)红叶断崖_瞬7
            },
        },
[737]={
            {
                mapId = 4,x = 228,y = 326,z = 381,     --(银河竞技场)纱织别墅_春丽2
            },
        },
[738]={
            {
                mapId = 4,x = 222,y = 326,z = 381,     --(银河竞技场)纱织别墅_艾欧里亚
            },
        },
[1070]={
            {
                mapId = 4,x = -311,y = 341,z = 57,     --(银河竞技场)红叶断崖_加米安2
            },
        },
[1071]={
            {
                mapId = 4,x = -298,y = 342,z = 80,     --(银河竞技场)红叶断崖_一辉2
            },
        },
[1072]={
            {
                mapId = 4,x = -361,y = 358,z = 161,     --(银河竞技场)红叶断崖_紫龙6
            },
        },
[10235]={
            {
                mapId = 4,x = 390,y = 313,z = 196,     --(银河竞技场)城户大宅_形迹可疑的人
            },
        },
[10536]={
            {
                mapId = 3,x = -235,y = 320,z = -109,     --(庐山)庐山李云喝药后
            },
        },
[9187]={
            {
                mapId = 2,x = -221,y = 337,z = 89,     --(环任务)车田正美
            },
        },
[10612]={
            {
                mapId = 4,x = 252,y = 316,z = 220,     --(环任务)蛮
            },
        },
[10613]={
            {
                mapId = 4,x = 264,y = 317,z = 305,     --(环任务)希区柯克
            },
        },
[10614]={
            {
                mapId = 4,x = 222,y = 315,z = 144,     --(环任务)旺达
            },
        },
[10615]={
            {
                mapId = 4,x = 215,y = 317,z = 264,     --(环任务)邪武1
            },
        },
[10616]={
            {
                mapId = 4,x = 319,y = 312,z = -4,     --(环任务)邪武2
            },
        },
[10617]={
            {
                mapId = 4,x = 314,y = 307,z = -164,     --(环任务)邪武3
            },
        },
[10618]={
            {
                mapId = 4,x = 315,y = 312,z = 1,     --(环任务)邪武4
            },
        },
[1281]={
            {
                mapId = 3,x = -226,y = 429,z = 251,     --(庐山)庐山福地紫龙
            },
        },
[1283]={
            {
                mapId = 3,x = -225,y = 429,z = 255,     --(庐山)庐山福地雷虎
            },
        },
[5046]={
            {
                mapId = 3,x = -128,y = 404,z = 200,     --(庐山)庐山福地神秘英灵
            },
        },
[1282]={
            {
                mapId = 3,x = -101,y = 404,z = 200,     --(庐山)庐山福地迪斯马斯克
            },
        },
[10298]={
            {
                mapId = 3,x = -138,y = 312,z = -58,     --(庐山)支线青岚2
            },
        },
[10537]={
            {
                mapId = 3,x = -8,y = 314,z = -192,     --(庐山)庐山茅屋村民
            },
        },
[11306]={
            {
                mapId = 4,x = 454,y = 312,z = -92,     --(银河竞技场)黑暗凤凰
            },
        },
[11307]={
            {
                mapId = 4,x = 233,y = 311,z = -131,     --(银河竞技场)星矢
            },
        },
[11308]={
            {
                mapId = 4,x = -5,y = 285,z = -37,     --(银河竞技场)黑暗天龙
            },
        },
[11309]={
            {
                mapId = 4,x = -230,y = 285,z = 19,     --(银河竞技场)索恩斯
            },
        },
[11310]={
            {
                mapId = 4,x = -327,y = 311,z = -98,     --(银河竞技场)黑暗仙女
            },
        },
[11311]={
            {
                mapId = 4,x = -390,y = 335,z = -214,     --(银河竞技场)黑暗白鸟
            },
        },
[11312]={
            {
                mapId = 4,x = -414,y = 360,z = -56,     --(银河竞技场)黑暗天马
            },
        },
[736]={
            {
                mapId = 4,x = 222,y = 328,z = 391,     --(银河竞技场)纱织
            },
        },
[20814]={
            {
                mapId = 1,x = -412,y = 327,z = 136,     --(新手村)城内药水商人
            },
            {
                mapId = 1,x = 22,y = 367,z = 290,     --(新手村)圣战之墙补给商人
            },
            {
                mapId = 1,x = -394,y = 309,z = 357,     --(新手村)港口补给商人
            },
            {
                mapId = 1,x = -156,y = 351,z = 120,     --(新手村)竞技场补给商人
            },
        },
[11320]={
            {
                mapId = 1,x = -384,y = 327,z = 102,     --(新手村)城镇铁匠
            },
        },
[11564]={
            {
                mapId = 1,x = -377,y = 327,z = 160,     --(新手村)仓库
            },
        },
[11568]={
            {
                mapId = 1,x = -369,y = 327,z = 155,     --(新手村)城内邮箱
            },
            {
                mapId = 1,x = -190,y = 346,z = 79,     --(新手村)竞技场邮箱
            },
        },
[20817]={
            {
                mapId = 2,x = -114,y = 324,z = 52,     --(圣域)商业区药剂师
            },
            {
                mapId = 2,x = -186,y = 339,z = 300,     --(圣域)高级活动区药剂师
            },
            {
                mapId = 2,x = -207,y = 334,z = 168,     --(圣域)低级活动区药剂师
            },
            {
                mapId = 2,x = 58,y = 294,z = 18,     --(圣域)试炼营补给点
            },
            {
                mapId = 2,x = -34,y = 297,z = 339,     --(圣域)狂脊山脉补给点
            },
            {
                mapId = 2,x = 192,y = 334,z = 370,     --(圣域)泰坦神殿补给点
            },
            {
                mapId = 2,x = 318,y = 298,z = -237,     --(圣域)古战场补给点
            },
            {
                mapId = 2,x = 299,y = 350,z = 265,     --(圣域)圣域狂脊之巅补给点
            },
        },
[20822]={
            {
                mapId = 2,x = -91,y = 322,z = 62,     --(圣域)商业区工艺师
            },
            {
                mapId = 2,x = -234,y = 350,z = 408,     --(圣域)神职区工艺师
            },
            {
                mapId = 2,x = -137,y = 339,z = 284,     --(圣域)高级活动区工艺师
            },
        },
[20819]={
            {
                mapId = 2,x = -103,y = 322,z = 95,     --(圣域)贸易区铁匠
            },
            {
                mapId = 2,x = -392,y = 351,z = 333,     --(圣域)十二宫入口铁匠
            },
            {
                mapId = 2,x = -249,y = 337,z = 32,     --(圣域)下城区铁匠
            },
            {
                mapId = 2,x = -286,y = 344,z = 225,     --(圣域)上城区铁匠
            },
        },
[20812]={
            {
                mapId = 2,x = -106,y = 322,z = 115,     --(圣域)商业区聚能师
            },
            {
                mapId = 2,x = -142,y = 339,z = 278,     --(圣域)高级活动区聚能师
            },
        },
[20816]={
            {
                mapId = 2,x = -111,y = 324,z = 91,     --(圣域)圣域贸易区仓库
            },
            {
                mapId = 2,x = -249,y = 351,z = 394,     --(圣域)圣域神职区仓库
            },
            {
                mapId = 2,x = -257,y = 337,z = 22,     --(圣域)圣域下城区仓库
            },
            {
                mapId = 2,x = -152,y = 339,z = 280,     --(圣域)圣域上城区仓库
            },
        },
[20821]={
            {
                mapId = 2,x = -116,y = 324,z = 74,     --(圣域)拍卖师商业区
            },
            {
                mapId = 2,x = -160,y = 339,z = 279,     --(圣域)高级活动区拍卖师
            },
        },
[11569]={
            {
                mapId = 2,x = -117,y = 324,z = 69,     --(圣域)圣域商业区邮箱
            },
            {
                mapId = 2,x = -167,y = 339,z = 289,     --(圣域)圣域高级活动区邮箱
            },
            {
                mapId = 2,x = -220,y = 337,z = 58,     --(圣域)圣域低级活动区邮箱
            },
            {
                mapId = 2,x = -231,y = 350,z = 346,     --(圣域)圣域神职区邮箱
            },
        },
[20829]={
            {
                mapId = 4,x = 111,y = 290,z = 331,     --(银河竞技场)银都镇商人1
            },
            {
                mapId = 4,x = -272,y = 283,z = -20,     --(银河竞技场)忍野牧场补给点
            },
            {
                mapId = 4,x = 161,y = 286,z = -350,     --(银河竞技场)铃之村周边补给点
            },
            {
                mapId = 4,x = -335,y = 358,z = 163,     --(银河竞技场)十风穴补给点
            },
            {
                mapId = 4,x = 314,y = 313,z = 2,     --(银河竞技场)青木原树海补给点
            },
            {
                mapId = 4,x = -300,y = 285,z = -349,     --(银河竞技场)落日海滩补给点
            },
            {
                mapId = 4,x = 43,y = 294,z = -295,     --(银河竞技场)铃之村药水商人
            },
        },
[11580]={
            {
                mapId = 4,x = 209,y = 319,z = 244,     --(银河竞技场)银都镇商人2
            },
        },
[20828]={
            {
                mapId = 4,x = 109,y = 290,z = 340,     --(银河竞技场)银都镇铁匠
            },
            {
                mapId = 4,x = 45,y = 295,z = -301,     --(银河竞技场)铃之村装备商人
            },
        },
[11577]={
            {
                mapId = 4,x = 195,y = 320,z = 269,     --(银河竞技场)装备强化师
            },
        },
[20826]={
            {
                mapId = 4,x = 180,y = 319,z = 249,     --(银河竞技场)银都镇仓库
            },
            {
                mapId = 4,x = 13,y = 295,z = -324,     --(银河竞技场)铃之村仓库
            },
        },
[11570]={
            {
                mapId = 4,x = 218,y = 316,z = 337,     --(银河竞技场)银都镇邮箱
            },
            {
                mapId = 4,x = 57,y = 289,z = -338,     --(银河竞技场)铃之村邮箱
            },
            {
                mapId = 4,x = -261,y = 285,z = -37,     --(银河竞技场)富士山麓邮箱
            },
        },
[20823]={
            {
                mapId = 3,x = -250,y = 319,z = -68,     --(庐山)城内商人1
            },
            {
                mapId = 3,x = -177,y = 484,z = 276,     --(庐山)庐山天池补给点
            },
            {
                mapId = 3,x = 36,y = 390,z = 139,     --(庐山)庐山再会岭补给商人
            },
            {
                mapId = 3,x = 13,y = 340,z = -40,     --(庐山)庐山竹林补给点
            },
            {
                mapId = 3,x = 132,y = 467,z = 350,     --(庐山)庐山圣战遗址补给商人
            },
        },
[11581]={
            {
                mapId = 3,x = -246,y = 319,z = -75,     --(庐山)城内商人2
            },
        },
[11323]={
            {
                mapId = 3,x = -267,y = 320,z = -72,     --(庐山)铁匠1
            },
        },
[11578]={
            {
                mapId = 3,x = -234,y = 319,z = -131,     --(庐山)装备强化师
            },
        },
[11567]={
            {
                mapId = 3,x = -233,y = 319,z = -128,     --(庐山)仓库
            },
        },
[11571]={
            {
                mapId = 3,x = -250,y = 319,z = -108,     --(庐山)城镇邮箱
            },
            {
                mapId = 3,x = 18,y = 340,z = -46,     --(庐山)竹林邮箱
            },
            {
                mapId = 3,x = 14,y = 451,z = 313,     --(庐山)庐山之巅邮箱
            },
        },
[736]={
            {
                mapId = 4,x = 222,y = 328,z = 392,     --(银河竞技场)纱织别墅_纱织3
            },
        },
[4619]={
            {
                mapId = 306,x = 8,y = 340,z = 4,     --(剧本：紫龙与雷虎)打树雷虎
            },
        },
[4620]={
            {
                mapId = 306,x = -163,y = 337,z = 21,     --(剧本：紫龙与雷虎)打坐台雷虎
            },
        },
[9833]={
            {
                mapId = 3,x = 0,y = 339,z = -42,     --(庐山)圆圆二
            },
        },
[9834]={
            {
                mapId = 3,x = 7,y = 450,z = 277,     --(庐山)圆圆三
            },
        },
[9837]={
            {
                mapId = 3,x = 7,y = 450,z = 277,     --(庐山)圆圆七
            },
        },
[12266]={
            {
                mapId = 3,x = 7,y = 450,z = 277,     --(庐山)团团
            },
        },
[10658]={
            {
                mapId = 2,x = -262,y = 344,z = 122,     --(圣域)星座1魔铃
            },
        },
[10659]={
            {
                mapId = 2,x = -239,y = 351,z = 283,     --(圣域)星座1艾欧里亚
            },
        },
[10660]={
            {
                mapId = 2,x = 43,y = 291,z = 96,     --(圣域)星座1尼亚
            },
        },
[12196]={
            {
                mapId = 2,x = 190,y = 290,z = 14,     --(圣域)星座1凝聚的冥界气息
            },
        },
[10662]={
            {
                mapId = 2,x = 134,y = 290,z = -182,     --(圣域)星座1初代天马之魂
            },
        },
[12198]={
            {
                mapId = 4,x = 201,y = 320,z = 274,     --(银河竞技场)星座1医生
            },
        },
[10663]={
            {
                mapId = 4,x = 204,y = 316,z = 166,     --(银河竞技场)星座1年轻市民
            },
        },
[10664]={
            {
                mapId = 4,x = 280,y = 318,z = 116,     --(银河竞技场)星座1掉地的身份牌
            },
        },
[10665]={
            {
                mapId = 4,x = 273,y = 318,z = 154,     --(银河竞技场)星座1元
            },
        },
[10666]={
            {
                mapId = 4,x = 374,y = 333,z = 250,     --(银河竞技场)星座1市
            },
        },
[10668]={
            {
                mapId = 4,x = 330,y = 318,z = 157,     --(银河竞技场)星座1受伤市
            },
        },
[10670]={
            {
                mapId = 4,x = 362,y = 318,z = 225,     --(银河竞技场)星座1受伤市民
            },
        },
[10672]={
            {
                mapId = 4,x = 375,y = 318,z = 127,     --(银河竞技场)星座1尼亚
            },
        },
[12199]={
            {
                mapId = 4,x = 256,y = 312,z = -201,     --(银河竞技场)星座1神秘的黑暗小宇宙
            },
        },
[10674]={
            {
                mapId = 4,x = 251,y = 312,z = -117,     --(银河竞技场)星座1黑暗自我
            },
        },
[10676]={
            {
                mapId = 4,x = 256,y = 312,z = -201,     --(银河竞技场)星座1教皇幻影
            },
        },
[10677]={
            {
                mapId = 4,x = 4,y = 295,z = -275,     --(银河竞技场)星座1老人
            },
        },
[10678]={
            {
                mapId = 4,x = 55,y = 294,z = -287,     --(银河竞技场)星座1小铃村
            },
        },
[10679]={
            {
                mapId = 3,x = -273,y = 314,z = -42,     --(庐山)星座1云凯1
            },
        },
[10680]={
            {
                mapId = 3,x = -273,y = 314,z = -42,     --(庐山)星座1云凯2
            },
        },
[10685]={
            {
                mapId = 3,x = -47,y = 335,z = -103,     --(庐山)星座1云凯3
            },
        },
[10686]={
            {
                mapId = 3,x = -39,y = 334,z = -97,     --(庐山)星座1黄金幻影
            },
        },
[10687]={
            {
                mapId = 3,x = 9,y = 363,z = 134,     --(庐山)星座1云峰
            },
        },
[10688]={
            {
                mapId = 3,x = -17,y = 340,z = -84,     --(庐山)星座1黑暗气息
            },
        },
[10689]={
            {
                mapId = 3,x = 115,y = 455,z = 310,     --(庐山)星座1黑暗兽影1
            },
        },
[10690]={
            {
                mapId = 3,x = 115,y = 455,z = 310,     --(庐山)星座1黑暗兽影2
            },
        },
[9188]={
            {
                mapId = 2,x = 69,y = 290,z = 172,     --(环任务)001马卡
            },
        },
[9189]={
            {
                mapId = 2,x = 96,y = 291,z = 202,     --(环任务)002马库斯
            },
        },
[11333]={
            {
                mapId = 2,x = -248,y = 337,z = 5,     --(环任务)015阿鲁迪巴
            },
        },
[11372]={
            {
                mapId = 2,x = 31,y = 289,z = 81,     --(环任务)054马库斯2
            },
        },
[11373]={
            {
                mapId = 2,x = 147,y = 292,z = -19,     --(环任务)055昆塔
            },
        },
[11374]={
            {
                mapId = 2,x = 144,y = 291,z = -20,     --(环任务)056安得斯1
            },
        },
[11375]={
            {
                mapId = 2,x = 138,y = 289,z = -157,     --(环任务)057安得斯2
            },
        },
[11376]={
            {
                mapId = 2,x = 8,y = 300,z = 265,     --(环任务)058马科斯
            },
        },
[11377]={
            {
                mapId = 2,x = 74,y = 296,z = 151,     --(环任务)059尼尼斯
            },
        },
[11378]={
            {
                mapId = 2,x = 65,y = 295,z = 127,     --(环任务)060魔铃1
            },
        },
[11379]={
            {
                mapId = 2,x = 172,y = 293,z = 1,     --(环任务)061魔铃2
            },
        },
[11380]={
            {
                mapId = 2,x = 141,y = 290,z = -144,     --(环任务)062魔铃3
            },
        },
[11384]={
            {
                mapId = 2,x = -65,y = 305,z = 4,     --(环任务)066莎尔娜1
            },
        },
[11385]={
            {
                mapId = 2,x = 79,y = 289,z = -133,     --(环任务)067莎尔娜2
            },
        },
[11386]={
            {
                mapId = 2,x = 77,y = 324,z = 399,     --(环任务)068莎尔娜3
            },
        },
[11387]={
            {
                mapId = 2,x = 176,y = 323,z = 342,     --(环任务)069莎尔娜4
            },
        },
[11388]={
            {
                mapId = 2,x = 318,y = 303,z = 158,     --(环任务)070莎尔娜5
            },
        },
[11390]={
            {
                mapId = 2,x = 175,y = 323,z = 342,     --(环任务)072格奈娅
            },
        },
[11391]={
            {
                mapId = 2,x = -74,y = 307,z = -2,     --(环任务)073卡西欧士1
            },
        },
[11392]={
            {
                mapId = 2,x = 64,y = 302,z = -197,     --(环任务)074卡西欧士2
            },
        },
[11396]={
            {
                mapId = 2,x = 378,y = 306,z = -160,     --(环任务)078塞克斯塔1
            },
        },
[11401]={
            {
                mapId = 2,x = 403,y = 289,z = -336,     --(环任务)083米罗1
            },
        },
[11402]={
            {
                mapId = 2,x = 2,y = 316,z = -392,     --(环任务)084米罗2
            },
        },
[11403]={
            {
                mapId = 2,x = 321,y = 298,z = -78,     --(环任务)085提比乌斯
            },
        },
[11591]={
            {
                mapId = 2,x = 85,y = 295,z = 138,     --(环任务)088维比娅
            },
        },
[12284]={
            {
                mapId = 2,x = 45,y = 289,z = 4,     --(环任务)091艾欧里亚
            },
        },
[12285]={
            {
                mapId = 2,x = -135,y = 339,z = 292,     --(环任务)092圣域士兵
            },
        },
[12685]={
            {
                mapId = 2,x = 303,y = 298,z = -173,     --(环任务)096魔铃的鹰
            },
        },
[11330]={
            {
                mapId = 4,x = 16,y = 282,z = -151,     --(环任务)012谜之少女1
            },
        },
[11331]={
            {
                mapId = 4,x = 156,y = 285,z = -338,     --(环任务)013谜之少女2
            },
        },
[11332]={
            {
                mapId = 4,x = 18,y = 283,z = -148,     --(环任务)014翔
            },
        },
[11334]={
            {
                mapId = 4,x = 283,y = 317,z = 194,     --(环任务)016美穗1
            },
        },
[11335]={
            {
                mapId = 4,x = 298,y = 314,z = 61,     --(环任务)017美穗2
            },
        },
[11336]={
            {
                mapId = 4,x = 222,y = 315,z = 143,     --(环任务)018美穗3
            },
        },
[11337]={
            {
                mapId = 4,x = 404,y = 305,z = -147,     --(环任务)019美穗4
            },
        },
[11341]={
            {
                mapId = 4,x = 405,y = 305,z = -147,     --(环任务)023星之子孤儿3
            },
        },
[11342]={
            {
                mapId = 4,x = 100,y = 289,z = 322,     --(环任务)024檄1
            },
        },
[11343]={
            {
                mapId = 4,x = 446,y = 312,z = -76,     --(环任务)025檄2
            },
        },
[11344]={
            {
                mapId = 4,x = 404,y = 305,z = -146,     --(环任务)026檄3
            },
        },
[11345]={
            {
                mapId = 4,x = 335,y = 305,z = -211,     --(环任务)027孤儿达野1
            },
        },
[11346]={
            {
                mapId = 4,x = 299,y = 314,z = 63,     --(环任务)028孤儿达野2
            },
        },
[11348]={
            {
                mapId = 4,x = 347,y = 305,z = -156,     --(环任务)030圣斗士市1
            },
        },
[11349]={
            {
                mapId = 4,x = 299,y = 307,z = -150,     --(环任务)031圣斗士市2
            },
        },
[11350]={
            {
                mapId = 4,x = 322,y = 312,z = -10,     --(环任务)032圣斗士市3
            },
        },
[11351]={
            {
                mapId = 4,x = 224,y = 315,z = 144,     --(环任务)033圣斗士市4
            },
        },
[11353]={
            {
                mapId = 4,x = 121,y = 284,z = -355,     --(环任务)035瘸腿青年1
            },
        },
[11354]={
            {
                mapId = 4,x = 237,y = 312,z = -190,     --(环任务)036瘸腿青年2
            },
        },
[11561]={
            {
                mapId = 4,x = -25,y = 297,z = -324,     --(环任务)086空启
            },
        },
[12410]={
            {
                mapId = 4,x = 16,y = 283,z = -149,     --(环任务)093堕落修炼者
            },
        },
[11358]={
            {
                mapId = 3,x = -146,y = 312,z = -148,     --(环任务)040春丽1
            },
        },
[11359]={
            {
                mapId = 3,x = -265,y = 313,z = -247,     --(环任务)041春丽2
            },
        },
[11360]={
            {
                mapId = 3,x = -14,y = 313,z = -188,     --(环任务)042茉莉
            },
        },
[11361]={
            {
                mapId = 3,x = -196,y = 312,z = -40,     --(环任务)043除妖师
            },
        },
[11362]={
            {
                mapId = 3,x = 17,y = 340,z = -89,     --(环任务)044穆1
            },
        },
[11365]={
            {
                mapId = 3,x = 16,y = 340,z = -81,     --(环任务)047乌鸦座1
            },
        },
[11367]={
            {
                mapId = 3,x = -142,y = 312,z = -103,     --(环任务)049贵鬼1
            },
        },
[11368]={
            {
                mapId = 3,x = -91,y = 326,z = -259,     --(环任务)050贵鬼2
            },
        },
[11370]={
            {
                mapId = 3,x = -184,y = 313,z = -209,     --(环任务)052庐山学员1
            },
        },
[11371]={
            {
                mapId = 3,x = -67,y = 313,z = -43,     --(环任务)053庐山学员2
            },
        },
[12463]={
            {
                mapId = 3,x = -262,y = 319,z = -68,     --(环任务)094庐山村民1（二虎）
            },
        },
[12464]={
            {
                mapId = 3,x = -252,y = 318,z = -157,     --(环任务)095庐山村民2（玲玲）
            },
        },
[1570]={
            {
                mapId = 3,x = -272,y = 312,z = 44,     --(庐山支线)庐山支线蓝斯
            },
        },
[12691]={
            {
                mapId = 3,x = -231,y = 322,z = -106,     --(庐山支线)庐山支线蓝斯（牡丹家）
            },
        },
[12695]={
            {
                mapId = 3,x = -161,y = 314,z = -182,     --(庐山支线)庐山支线蓝斯采花
            },
        },
[12696]={
            {
                mapId = 3,x = -158,y = 313,z = -181,     --(庐山支线)庐山支线牡丹出现
            },
        },
[12698]={
            {
                mapId = 3,x = -112,y = 312,z = -32,     --(庐山支线)庐山支线蓝斯碧龙潭
            },
        },
[12703]={
            {
                mapId = 3,x = -105,y = 313,z = -25,     --(庐山支线)庐山支线蓝斯碧龙潭2
            },
        },
[1123]={
            {
                mapId = 4,x = -142,y = 285,z = -393,     --(银河竞技场)银河竞技场支线伊万
            },
        },
[1125]={
            {
                mapId = 4,x = -123,y = 283,z = -403,     --(银河竞技场)银河竞技场支线拉克萨斯1
            },
        },
[12729]={
            {
                mapId = 4,x = -138,y = 285,z = -394,     --(银河竞技场)银河竞技场支线拉克萨斯2
            },
        },
[1126]={
            {
                mapId = 4,x = -292,y = 283,z = -361,     --(银河竞技场)银河竞技场支线美人鱼1
            },
        },
[1127]={
            {
                mapId = 4,x = -121,y = 296,z = -348,     --(银河竞技场)银河竞技场支线美人鱼2
            },
        },
[12702]={
            {
                mapId = 3,x = -233,y = 322,z = -105,     --(庐山支线)庐山支线蓝斯
            },
        },
[12672]={
            {
                mapId = 3,x = -77,y = 326,z = -275,     --(庐山支线)庐山支线苏方
            },
        },
[12671]={
            {
                mapId = 3,x = -183,y = 319,z = -299,     --(庐山支线)庐山支线苏方墓前
            },
        },
[1087]={
            {
                mapId = 4,x = 287,y = 317,z = 194,     --(银河竞技场)支线01银都市_杉智
            },
        },
[1089]={
            {
                mapId = 4,x = 191,y = 320,z = 295,     --(银河竞技场)支线03银都市_司岚
            },
        },
[1090]={
            {
                mapId = 4,x = 226,y = 315,z = 188,     --(银河竞技场)支线04银都市_美娅1
            },
        },
[1091]={
            {
                mapId = 4,x = 287,y = 317,z = 198,     --(银河竞技场)支线05银都市_成武
            },
        },
[1092]={
            {
                mapId = 4,x = 226,y = 315,z = 132,     --(银河竞技场)支线06银都市_成辉2
            },
        },
[1093]={
            {
                mapId = 4,x = 226,y = 315,z = 132,     --(银河竞技场)支线07银都市_美娅2
            },
        },
[1094]={
            {
                mapId = 4,x = 214,y = 317,z = 272,     --(银河竞技场)支线08银都市_格里夫塔
            },
        },
[1095]={
            {
                mapId = 4,x = 229,y = 326,z = 384,     --(银河竞技场)支线09银都市_那智
            },
        },
[1096]={
            {
                mapId = 4,x = 325,y = 313,z = -12,     --(银河竞技场)支线10银都市_独角兽座圣衣
            },
        },
[1097]={
            {
                mapId = 4,x = 370,y = 305,z = -73,     --(银河竞技场)支线11青木原树海_邪武
            },
        },
[1098]={
            {
                mapId = 4,x = 370,y = 305,z = -73,     --(银河竞技场)支线12青木原树海_受伤的邪武
            },
        },
[1099]={
            {
                mapId = 4,x = 370,y = 305,z = -73,     --(银河竞技场)支线13青木原树海_爆发的邪武
            },
        },
[1100]={
            {
                mapId = 4,x = 184,y = 286,z = -333,     --(银河竞技场)支线14青木原树海_斯芬克斯
            },
        },
[1101]={
            {
                mapId = 4,x = 37,y = 293,z = -296,     --(银河竞技场)支线15铃之村_村长
            },
        },
[1102]={
            {
                mapId = 4,x = 1,y = 283,z = -172,     --(银河竞技场)支线16铃之村_铃1
            },
        },
[1103]={
            {
                mapId = 4,x = 39,y = 293,z = -295,     --(银河竞技场)支线17铃之村_铃2
            },
        },
[1104]={
            {
                mapId = 4,x = 29,y = 292,z = -335,     --(银河竞技场)支线18铃之村_尼克特1
            },
        },
[1105]={
            {
                mapId = 4,x = 4,y = 292,z = -348,     --(银河竞技场)支线19铃之村_尼克特2
            },
        },
[1106]={
            {
                mapId = 4,x = 24,y = 292,z = -370,     --(银河竞技场)支线20铃之村_尼克特3
            },
        },
[1108]={
            {
                mapId = 4,x = 41,y = 292,z = -324,     --(银河竞技场)支线22铃之村_莹
            },
        },
[1109]={
            {
                mapId = 4,x = 161,y = 285,z = -343,     --(银河竞技场)支线23铃之村_银
            },
        },
[1110]={
            {
                mapId = 4,x = 115,y = 285,z = -342,     --(银河竞技场)支线24铃之村_莹2
            },
        },
[1111]={
            {
                mapId = 4,x = 120,y = 285,z = -342,     --(银河竞技场)支线25铃之村_银2
            },
        },
[1114]={
            {
                mapId = 4,x = -32,y = 297,z = -326,     --(银河竞技场)支线28铃之村_阿米尔
            },
        },
[1115]={
            {
                mapId = 4,x = -10,y = 295,z = -301,     --(银河竞技场)支线29铃之村_纳克罗
            },
        },
[1116]={
            {
                mapId = 4,x = -259,y = 285,z = -38,     --(银河竞技场)支线30忍野牧场_阿隆
            },
        },
[1117]={
            {
                mapId = 4,x = -230,y = 289,z = -93,     --(银河竞技场)支线31忍野牧场_神秘老人
            },
        },
[1118]={
            {
                mapId = 4,x = -230,y = 289,z = -93,     --(银河竞技场)支线32忍野牧场_阿尔伯特
            },
        },
[1119]={
            {
                mapId = 4,x = -375,y = 363,z = 71,     --(银河竞技场)支线33红叶断崖_乌鸦
            },
        },
[1120]={
            {
                mapId = 4,x = 36,y = 284,z = -163,     --(银河竞技场)支线34红叶断崖_卡泰林1
            },
        },
[1121]={
            {
                mapId = 4,x = 36,y = 284,z = -163,     --(银河竞技场)支线35红叶断崖_卡泰林2
            },
        },
[1232]={
            {
                mapId = 4,x = 225,y = 315,z = 189,     --(银河竞技场)支线42银都市_成辉1
            },
        },
[1553]={
            {
                mapId = 3,x = 139,y = 462,z = 359,     --(庐山支线)庐山支线小猴子
            },
        },
[12473]={
            {
                mapId = 4,x = 213,y = 315,z = 150,     --(银河竞技场)星座3小屋外师父
            },
        },
[12475]={
            {
                mapId = 4,x = 216,y = 319,z = 246,     --(银河竞技场)星座3集市医生
            },
        },
[12476]={
            {
                mapId = 4,x = 213,y = 315,z = 155,     --(银河竞技场)星座3小屋医生
            },
        },
[12474]={
            {
                mapId = 4,x = 214,y = 315,z = 151,     --(银河竞技场)星座3小屋先知躺着
            },
        },
[12477]={
            {
                mapId = 4,x = 214,y = 315,z = 151,     --(银河竞技场)星座3小屋先知站着
            },
        },
[12478]={
            {
                mapId = 4,x = 296,y = 302,z = -283,     --(银河竞技场)星座3青木原树海先知
            },
        },
[12479]={
            {
                mapId = 4,x = 290,y = 301,z = -287,     --(银河竞技场)星座3青木原树海村民
            },
        },
[12481]={
            {
                mapId = 4,x = -10,y = 296,z = -291,     --(银河竞技场)星座3铃之村先知
            },
        },
[12480]={
            {
                mapId = 4,x = -9,y = 296,z = -289,     --(银河竞技场)星座3铃之村村民
            },
        },
[12482]={
            {
                mapId = 3,x = -208,y = 314,z = -37,     --(庐山)星座3悬崖云光
            },
        },
[12483]={
            {
                mapId = 3,x = -73,y = 314,z = -9,     --(庐山)星座3碧龙潭云光
            },
        },
[12823]={
            {
                mapId = 3,x = -127,y = 312,z = -124,     --(庐山)星座3碧龙潭村民
            },
        },
[12484]={
            {
                mapId = 3,x = -70,y = 314,z = 74,     --(庐山)星座3碧龙潭深处云光
            },
        },
[12485]={
            {
                mapId = 3,x = -77,y = 327,z = 32,     --(庐山)星座3迅风庐山山路
            },
        },
[12486]={
            {
                mapId = 3,x = 51,y = 390,z = 129,     --(庐山)星座3迅风再会岭
            },
        },
[12487]={
            {
                mapId = 3,x = 19,y = 340,z = -9,     --(庐山)星座3迅风小宇宙
            },
        },
[12488]={
            {
                mapId = 3,x = 16,y = 340,z = -17,     --(庐山)星座3迅风竹林
            },
        },
[12489]={
            {
                mapId = 3,x = -232,y = 314,z = -212,     --(庐山)星座3师父隐龙村
            },
        },
[12490]={
            {
                mapId = 3,x = -164,y = 314,z = -222,     --(庐山)星座3村妇隐龙村外
            },
        },
[12491]={
            {
                mapId = 3,x = -164,y = 314,z = -222,     --(庐山)星座3师父隐龙村外
            },
        },
[12492]={
            {
                mapId = 3,x = -87,y = 326,z = -249,     --(庐山)星座3师父小庙
            },
        },
[12495]={
            {
                mapId = 3,x = 141,y = 463,z = 371,     --(庐山)星座3圣战遗址村妇
            },
        },
[12496]={
            {
                mapId = 3,x = 122,y = 467,z = 365,     --(庐山)星座3圣战遗址迪斯马斯克
            },
        },
[12497]={
            {
                mapId = 3,x = 139,y = 463,z = 375,     --(庐山)星座3圣战遗址师父
            },
        },
[12498]={
            {
                mapId = 3,x = -255,y = 319,z = -116,     --(庐山)星座3隐龙村师父
            },
        },
[12465]={
            {
                mapId = 2,x = 265,y = 300,z = -1,     --(圣域)星座3失落森林师父
            },
        },
[12467]={
            {
                mapId = 2,x = 86,y = 291,z = 45,     --(圣域)星座3魔铃
            },
        },
[12466]={
            {
                mapId = 2,x = 109,y = 290,z = -140,     --(圣域)星座3古战场师父
            },
        },
[13076]={
            {
                mapId = 2,x = 265,y = 300,z = -1,     --(圣域)星座3失落森林师父战斗后
            },
        },
[409]={
            {
                mapId = 302,x = 171,y = 294,z = -385,     --(剧本：黄泉之井)士官长
            },
        },
[13040]={
            {
                mapId = 4,x = 370,y = 305,z = -73,     --(银河竞技场)支线邪武4
            },
        },
[1107]={
            {
                mapId = 4,x = 29,y = 292,z = -335,     --(银河竞技场)支线尼克特4
            },
        },
[13400]={
            {
                mapId = 4,x = 157,y = 285,z = -335,     --(银河竞技场)支线加贝尔
            },
        },
[13595]={
            {
                mapId = 4,x = -272,y = 283,z = -20,     --(银河竞技场)忍野牧场补给点
            },
            {
                mapId = 4,x = 161,y = 286,z = -350,     --(银河竞技场)铃之村周边补给点
            },
            {
                mapId = 4,x = -335,y = 358,z = 163,     --(银河竞技场)十风穴补给点
            },
            {
                mapId = 4,x = 314,y = 313,z = 2,     --(银河竞技场)青木原树海补给点
            },
            {
                mapId = 4,x = -300,y = 285,z = -349,     --(银河竞技场)落日海滩补给点
            },
        },
[13599]={
            {
                mapId = 4,x = 8,y = 296,z = -315,     --(银河竞技场)铃之村材料商
            },
        },
[13601]={
            {
                mapId = 4,x = 43,y = 294,z = -295,     --(银河竞技场)铃之村药水商人
            },
        },
[13602]={
            {
                mapId = 4,x = 45,y = 295,z = -301,     --(银河竞技场)铃之村装备商人
            },
        },
[13596]={
            {
                mapId = 3,x = -177,y = 484,z = 276,     --(庐山)庐山天池补给点
            },
        },
[13540]={
            {
                mapId = 2,x = 51,y = 290,z = 174,     --(圣域)港口阿尔特
            },
        },
[13615]={
            {
                mapId = 4,x = -122,y = 298,z = -326,     --(银河竞技场)银河竞技场支线组队boss艾斯福格
            },
        },
[10049]={
            {
                mapId = 1,x = -421,y = 329,z = 194,     --(新手村)新手村圣斗士修炼地传送师
            },
        },
[13553]={
            {
                mapId = 2,x = -239,y = 350,z = 315,     --(传送回城功能相关)圣域卫城上传送师
            },
        },
[13554]={
            {
                mapId = 2,x = -118,y = 323,z = 80,     --(传送回城功能相关)圣域卫城下城传送师
            },
        },
[13555]={
            {
                mapId = 2,x = 56,y = 294,z = 16,     --(传送回城功能相关)圣域试炼营地传送师
            },
        },
[13556]={
            {
                mapId = 2,x = -39.41,y = 297.08,z = 344.06,     --(传送回城功能相关)圣域狂脊山村传送师
            },
        },
[13558]={
            {
                mapId = 2,x = 298,y = 350,z = 266,     --(传送回城功能相关)圣域狂脊山麓传送师
            },
        },
[13559]={
            {
                mapId = 2,x = 318,y = 298,z = -239,     --(传送回城功能相关)圣域金穗花田传送师
            },
        },
[20820]={
            {
                mapId = 2,x = -239,y = 350,z = 319,     --(传送回城功能相关)圣域卫城上城回城点
            },
            {
                mapId = 2,x = -108,y = 323,z = 81,     --(传送回城功能相关)圣域卫城下城回城点
            },
            {
                mapId = 2,x = -253.28,y = 337.48,z = 32.68,     --(传送回城功能相关)圣域回城点-贸易区
            },
            {
                mapId = 2,x = 55,y = 294,z = 15,     --(传送回城功能相关)圣域试炼营地回城点
            },
            {
                mapId = 2,x = -38.66,y = 297,z = 346.59,     --(传送回城功能相关)圣域狂脊山村回城点
            },
        },
[13564]={
            {
                mapId = 4,x = 229,y = 316,z = 296,     --(传送回城功能相关)银河竞技场银都镇传送师
            },
        },
[13565]={
            {
                mapId = 4,x = 2,y = 294,z = -306,     --(传送回城功能相关)银河竞技场铃之村传送师
            },
        },
[13566]={
            {
                mapId = 4,x = -245,y = 284,z = 14,     --(传送回城功能相关)银河竞技场忍野牧场传送师
            },
        },
[13567]={
            {
                mapId = 4,x = -332,y = 358,z = 166,     --(传送回城功能相关)银河竞技场十风穴传送师
            },
        },
[13569]={
            {
                mapId = 4,x = 312,y = 312,z = 2,     --(传送回城功能相关)银河竞技场青木原树海传送师
            },
        },
[13571]={
            {
                mapId = 4,x = -299,y = 284,z = -351,     --(传送回城功能相关)银河竞技场落日海滩传送师
            },
        },
[20830]={
            {
                mapId = 4,x = 236,y = 316,z = 299,     --(传送回城功能相关)银河竞技场银都镇回城点
            },
            {
                mapId = 4,x = 4,y = 295,z = -294,     --(传送回城功能相关)银河竞技场铃之村回城点
            },
            {
                mapId = 4,x = -251,y = 284,z = 9,     --(传送回城功能相关)银河竞技场忍野牧场回城点
            },
        },
[13573]={
            {
                mapId = 3,x = -231,y = 319,z = -144,     --(传送回城功能相关)庐山隐龙村传送师
            },
        },
[13574]={
            {
                mapId = 3,x = -185,y = 483,z = 269,     --(传送回城功能相关)庐山天池传送师
            },
        },
[13575]={
            {
                mapId = 3,x = 20,y = 340,z = -45,     --(传送回城功能相关)庐山竹林传送师
            },
        },
[13576]={
            {
                mapId = 3,x = 37,y = 390,z = 137,     --(传送回城功能相关)庐山再会岭传送师
            },
        },
[13577]={
            {
                mapId = 3,x = 130,y = 467,z = 349,     --(传送回城功能相关)庐山圣战遗迹传送师
            },
        },
[20825]={
            {
                mapId = 3,x = -232,y = 319,z = -141,     --(传送回城功能相关)庐山隐龙村回城点
            },
            {
                mapId = 3,x = -184,y = 483,z = 264,     --(传送回城功能相关)庐山天池回城点
            },
            {
                mapId = 3,x = 10,y = 340,z = -38,     --(传送回城功能相关)庐山竹林回城点
            },
        },
[13534]={
            {
                mapId = LEAGUE_BASE,x = -105.32,y = 350.06,z = -262.89,     --(军团基地)老兵加度
            },
        },
[10926]={
            {
                mapId = LEAGUE_BASE,x = -107.47,y = 350.06,z = -260.837,     --(军团基地)柏菲雅
            },
        },
[13509]={
            {
                mapId = LEAGUE_BASE,x = -109.79,y = 350.06,z = -257.81,     --(军团基地)卡琳
            },
        },
[13510]={
            {
                mapId = LEAGUE_BASE,x = -109.79,y = 350.06,z = -257.81,     --(军团基地)卡琳
            },
        },
[13511]={
            {
                mapId = LEAGUE_BASE,x = -109.79,y = 350.06,z = -257.81,     --(军团基地)卡琳
            },
        },
[13903]={
            {
                mapId = 1,x = -417,y = 329,z = 178,     --(新手村)新手村圣斗士修炼地回城点
            },
        },
[13263]={
            {
                mapId = 2,x = 134,y = 302,z = -400,     --(圣域)尤朵拉
            },
        },
[13265]={
            {
                mapId = 2,x = -6,y = 298,z = 297,     --(圣域)受伤的村民
            },
        },
[13266]={
            {
                mapId = 2,x = 133,y = 321,z = 346,     --(圣域)毕庇斯
            },
        },
[13267]={
            {
                mapId = 2,x = -201,y = 339,z = 260,     --(圣域)魔铃
            },
        },
[13268]={
            {
                mapId = 2,x = -231,y = 350,z = 326,     --(圣域)传令兵
            },
        },
[13269]={
            {
                mapId = 2,x = -255,y = 357,z = 334,     --(圣域)沙加
            },
        },
[13270]={
            {
                mapId = 2,x = -6,y = 298,z = 297,     --(圣域)尤朵拉
            },
        },
[13271]={
            {
                mapId = 2,x = 17,y = 300,z = 275,     --(圣域)尤朵拉
            },
        },
[13272]={
            {
                mapId = 2,x = -22,y = 296,z = 338,     --(圣域)艾欧里亚
            },
        },
[13273]={
            {
                mapId = 2,x = -52,y = 302,z = 398,     --(圣域)垂危的希尔曼
            },
        },
[13274]={
            {
                mapId = 2,x = -22,y = 296,z = 338,     --(圣域)莎尔娜
            },
        },
[13275]={
            {
                mapId = 2,x = 231,y = 328,z = 204,     --(圣域)2话艾欧里亚狂暴山谷
            },
        },
[13276]={
            {
                mapId = 2,x = 161,y = 324,z = 351,     --(圣域)莎尔娜
            },
        },
[13277]={
            {
                mapId = 2,x = 184,y = 326,z = 214,     --(圣域)冥兵头目
            },
        },
[13278]={
            {
                mapId = 2,x = -30,y = 296,z = 353,     --(圣域)莎尔娜
            },
        },
[13279]={
            {
                mapId = 2,x = -51,y = 296,z = 348,     --(圣域)毕庇斯
            },
        },
[13280]={
            {
                mapId = 2,x = -54,y = 297,z = 331,     --(圣域)希尔曼
            },
        },
[13281]={
            {
                mapId = 2,x = 149,y = 332,z = 393,     --(圣域)小乞丐
            },
        },
[13283]={
            {
                mapId = 2,x = 186,y = 327,z = 194,     --(圣域)冥兵百夫长
            },
        },
[13284]={
            {
                mapId = 2,x = 183,y = 334,z = 136,     --(圣域)星华
            },
        },
[13286]={
            {
                mapId = 2,x = 141,y = 332,z = 404,     --(圣域)桑坦诺亚
            },
        },
[13287]={
            {
                mapId = 2,x = 120,y = 332,z = 411,     --(圣域)撒密安
            },
        },
[13288]={
            {
                mapId = 2,x = 101,y = 324,z = 417,     --(圣域)尤朵拉
            },
        },
[13168]={
            {
                mapId = 2,x = -19,y = 297,z = 374,     --(圣域)3话尤朵拉1
            },
        },
[13169]={
            {
                mapId = 2,x = -19,y = 297,z = 374,     --(圣域)3话尤朵拉2
            },
        },
[13353]={
            {
                mapId = 2,x = -68,y = 302,z = 392,     --(圣域)3话村长
            },
        },
[13273]={
            {
                mapId = 2,x = -52,y = 302,z = 398,     --(圣域)3话垂危的希尔曼
            },
        },
[13356]={
            {
                mapId = 2,x = -52,y = 297,z = 351,     --(圣域)3话毕庇斯
            },
        },
[13170]={
            {
                mapId = 2,x = -52,y = 297,z = 349,     --(圣域)3话星华1
            },
        },
[13171]={
            {
                mapId = 2,x = -35,y = 297,z = 331,     --(圣域)3话魔铃1
            },
        },
[13172]={
            {
                mapId = 2,x = -391,y = 351,z = 348,     --(圣域)3话传令兵A
            },
        },
[13173]={
            {
                mapId = 2,x = -496,y = 399,z = 295,     --(圣域)3话传令兵B
            },
        },
[13174]={
            {
                mapId = 2,x = -378,y = 351,z = 353,     --(圣域)3话魔铃2
            },
        },
[13175]={
            {
                mapId = 2,x = -39,y = 297,z = 332,     --(圣域)3话星华2
            },
        },
[13176]={
            {
                mapId = 2,x = 214,y = 329,z = 202,     --(圣域)3话神秘的圣斗士
            },
        },
[13177]={
            {
                mapId = 2,x = 215,y = 328,z = 213,     --(圣域)3话艾欧里亚1
            },
        },
[13178]={
            {
                mapId = 2,x = 269,y = 338,z = 223,     --(圣域)3话艾欧里亚2
            },
        },
[13180]={
            {
                mapId = 2,x = 306,y = 350,z = 238,     --(圣域)3话阿鲁迪巴1
            },
        },
[13179]={
            {
                mapId = 2,x = 302,y = 350,z = 241,     --(圣域)3话沙加1
            },
        },
[13181]={
            {
                mapId = 2,x = 339,y = 372,z = 323,     --(圣域)3话魔铃3
            },
        },
[13357]={
            {
                mapId = 2,x = 375,y = 397,z = 417,     --(圣域)3话魔铃4
            },
        },
[13185]={
            {
                mapId = 2,x = 364,y = 397,z = 424,     --(圣域)3话阿鲁迪巴3
            },
        },
[13186]={
            {
                mapId = 2,x = 359,y = 397,z = 419,     --(圣域)3话艾欧里亚4
            },
        },
[13187]={
            {
                mapId = 2,x = 353,y = 397,z = 422,     --(圣域)3话沙加3
            },
        },
[13188]={
            {
                mapId = 2,x = 344,y = 397,z = 410,     --(圣域)3话莎尔娜
            },
        },
[13306]={
            {
                mapId = 2,x = -269,y = 361,z = 335,     --(圣域)教皇1
            },
        },
[13291]={
            {
                mapId = 2,x = 26,y = 290,z = 169,     --(圣域)码头管理员
            },
        },
[13931]={
            {
                mapId = 4,x = -265,y = 282,z = -388,     --(银河竞技场)主线123落日海滩_魔铃被救
            },
        },
[13294]={
            {
                mapId = 2,x = 87,y = 292,z = 196,     --(圣域)1话尤朵拉1
            },
        },
[13297]={
            {
                mapId = 2,x = -68,y = 320,z = 278,     --(圣域)1话尤朵拉2
            },
        },
[13300]={
            {
                mapId = 2,x = -161,y = 339,z = 402,     --(圣域)1话魔铃
            },
        },
[13928]={
            {
                mapId = 2,x = -174,y = 339,z = 293,     --(圣域)1话尤朵拉3
            },
        },
[13303]={
            {
                mapId = 2,x = -172,y = 343,z = 280,     --(圣域)1话银星协会会长1
            },
        },
[13309]={
            {
                mapId = 2,x = -194,y = 339,z = 272,     --(圣域)1话阿历克斯1
            },
        },
[13269]={
            {
                mapId = 2,x = -255,y = 358,z = 334,     --(圣域)1话沙加
            },
        },
[13550]={
            {
                mapId = 2,x = -199,y = 336,z = 233,     --(圣域)1话尤朵拉4
            },
        },
[13543]={
            {
                mapId = 2,x = -228,y = 350,z = 321,     --(圣域)1话尤朵拉5
            },
        },
[13546]={
            {
                mapId = 2,x = -202,y = 338,z = 58,     --(圣域)1话尤朵拉6
            },
        },
[13321]={
            {
                mapId = 2,x = 64,y = 294,z = 8,     --(圣域)1话莎尔娜
            },
        },
[13366]={
            {
                mapId = 2,x = 68,y = 289,z = 51,     --(圣域)1话候补生
            },
        },
[13393]={
            {
                mapId = 2,x = 173,y = 291,z = -46,     --(圣域)1话阿历克斯2
            },
        },
[13336]={
            {
                mapId = 2,x = 223,y = 293,z = -74,     --(圣域)1话银星协会会长2
            },
        },
[13315]={
            {
                mapId = 2,x = 178,y = 293,z = -17,     --(圣域)1话尤朵拉7
            },
        },
[13340]={
            {
                mapId = 2,x = 222,y = 293,z = -77,     --(圣域)1话发狂的炼金术士
            },
        },
[13312]={
            {
                mapId = 2,x = 182,y = 293,z = -14,     --(圣域)1话黑衣少女1
            },
        },
[13318]={
            {
                mapId = 2,x = 181,y = 293,z = -17,     --(圣域)1话尤丽缇丝1
            },
        },
[13347]={
            {
                mapId = 2,x = 398,y = 318,z = -95,     --(圣域)1话初代天马
            },
        },
[13396]={
            {
                mapId = 2,x = 329,y = 303,z = -149,     --(圣域)1话黑衣少女2
            },
        },
[13350]={
            {
                mapId = 2,x = 229,y = 313,z = -253,     --(圣域)1话阿历克斯3
            },
        },
[13354]={
            {
                mapId = 2,x = 356,y = 296,z = -253,     --(圣域)1话尤朵拉8
            },
        },
[13330]={
            {
                mapId = 2,x = 357,y = 288,z = -373,     --(圣域)1话奥路菲
            },
        },
[13324]={
            {
                mapId = 2,x = 355,y = 288,z = -370,     --(圣域)1话尤丽缇丝2
            },
        },
[13327]={
            {
                mapId = 2,x = 355,y = 289,z = -368,     --(圣域)1话尤朵拉9
            },
        },
[13360]={
            {
                mapId = 2,x = 260,y = 288,z = -392,     --(圣域)1话尤朵拉10
            },
        },
[11357]={
            {
                mapId = 4,x = 121,y = 284,z = -355,     --(环任务)039瘸腿青年5
            },
        },
[11394]={
            {
                mapId = 2,x = -74,y = 307,z = -2,     --(环任务)076卡西欧士4
            },
        },
[11397]={
            {
                mapId = 2,x = 378,y = 306,z = -160,     --(环任务)079塞克斯塔2
            },
        },
[13167]={
            {
                mapId = 2,x = -71,y = 302,z = 394,     --(圣域)2话村长
            },
        },
[13363]={
            {
                mapId = 2,x = 121,y = 303,z = -375,     --(圣域)1话黄金幻象
            },
        },
[14170]={
            {
                mapId = 2,x = 26,y = 316,z = -341,     --(圣域)1话尤朵拉11
            },
        },
[14155]={
            {
                mapId = 2,x = 226,y = 313,z = -254,     --(圣域)1话阿历克斯古战场2
            },
        },
[14156]={
            {
                mapId = 2,x = -269,y = 361,z = 335,     --(圣域)教皇2
            },
        },
[12838]={
            {
                mapId = 2,x = -203,y = 337,z = 17,     --(圣域)三环接待蜜西儿
            },
        },
[12839]={
            {
                mapId = 2,x = -206,y = 337,z = 15,     --(圣域)三环接待奥利娜
            },
        },
[12840]={
            {
                mapId = 2,x = -274,y = 337,z = 8,     --(圣域)三环接待卡特琳
            },
        },
[14165]={
            {
                mapId = 2,x = -291,y = 344,z = 6,     --(圣域)三环接待瑞贝卡
            },
        },
[13950]={
            {
                mapId = 2,x = -241,y = 341,z = 47,     --(圣域)圣战回忆索娜
            },
        },
[13057]={
            {
                mapId = 1,x = -208.24,y = 308.34,z = -80.77,     --(新手村)低级纱织希望沙滩
            },
        },
[14420]={
            {
                mapId = 2,x = -191,y = 289,z = -142,     --(圣域)二环普朗克
            },
        },
[13949]={
            {
                mapId = 2,x = -275,y = 344,z = 124,     --(圣域)圣域护卫队长
            },
        },
[14557]={
            {
                mapId = 2,x = 134,y = 324,z = 364,     --(圣域)2话尤朵拉泰坦遗迹
            },
        },
[14558]={
            {
                mapId = 2,x = 115,y = 324,z = 378,     --(圣域)2话撒密安2
            },
        },
[14556]={
            {
                mapId = 2,x = 261,y = 288,z = -392,     --(圣域)1话尤朵拉黄泉之井
            },
        },
[14799]={
            {
                mapId = 2,x = -240,y = 353,z = 400,     --(圣域)军团管理员
            },
        },
[14838]={
            {
                mapId = 2,x = -253,y = 338,z = 22,     --(圣域)大地图双倍发放
            },
        },
[10661]={
            {
                mapId = 2,x = 43,y = 291,z = 96,     --(圣域)圣域尼亚
            },
        },
[14888]={
            {
                mapId = 3,x = 27,y = 339,z = 1,     --(庐山)龙虎副本雷虎
            },
        },
[14891]={
            {
                mapId = 3,x = 27,y = 339,z = 1,     --(庐山)龙虎副本后雷虎
            },
        },
[14895]={
            {
                mapId = 2,x = -164,y = 339,z = 420,     --(圣域)地宫传送
            },
        },
[14629]={
            {
                mapId = 2,x = -238,y = 350,z = 310,     --(圣域)圣域军需官
            },
        },
[14686]={
            {
                mapId = 2,x = -234,y = 350,z = 353,     --(圣域)白银军需官1
            },
        },
[14687]={
            {
                mapId = 2,x = -234,y = 350,z = 357,     --(圣域)黄金军需官1
            },
        },
[14688]={
            {
                mapId = 2,x = -234,y = 350,z = 361,     --(圣域)黄金军需官2
            },
        },
[14631]={
            {
                mapId = 3,x = -227,y = 319,z = -113,     --(庐山)庐山军需官
            },
        },
[14630]={
            {
                mapId = 4,x = 201,y = 317,z = 290,     --(银河竞技场)银河竞技场军需官
            },
        },
[14918]={
            {
                mapId = 47,x = 361,y = 300,z = -212,     --(地宫)地宫幻境使者
            },
        },
[14919]={
            {
                mapId = 48,x = 361,y = 300,z = -212,     --(地宫)地宫幻境使者
            },
        },
[14920]={
            {
                mapId = 49,x = 361,y = 300,z = -212,     --(地宫)地宫幻境使者
            },
        },
[10635]={
            {
                mapId = 2,x = -227,y = 337,z = 82,     --(圣域)星辰试炼
            },
        },
[15294]={
            {
                mapId = 4,x = -481.73,y = 359.02,z = 180.77,     --(银河竞技场)十风穴副本入口
            },
        },
[15340]={
            {
                mapId = 2,x = -178,y = 325,z = -18,     --(圣域)沐浴荣光1
            },
            {
                mapId = 2,x = -291,y = 344,z = 4,     --(圣域)沐浴荣光2
            },
            {
                mapId = 2,x = -272,y = 344,z = 111,     --(圣域)沐浴荣光3
            },
        },
[12468]={
            {
                mapId = 4,x = 223,y = 317,z = 259,     --(银河竞技场)银都市市民
            },
        },
[13612]={
            {
                mapId = 2,x = -21,y = 296,z = 374,     --(圣域)尤朵拉死亡
            },
        },
[15458]={
            {
                mapId = 2,x = -220,y = 350,z = 320,     --(圣域)阿历克斯神殿
            },
        },
[14887]={
            {
                mapId = 4,x = 222,y = 329,z = 392,     --(银河竞技场)进银河战争副本纱织
            },
        },
[15593]={
            {
                mapId = 2,x = -239,y = 350,z = 315,     --(圣域)圣域卫城上传送师
            },
            {
                mapId = 2,x = -251,y = 337,z = 32,     --(圣域)圣域贸易区传送师
            },
            {
                mapId = 2,x = -118,y = 323,z = 80,     --(圣域)圣域卫城下城传送师
            },
            {
                mapId = 2,x = 104,y = 289,z = -140,     --(圣域)圣域-失落森林
            },
            {
                mapId = 2,x = 56,y = 294,z = 16,     --(圣域)圣域试炼营地传送师
            },
            {
                mapId = 2,x = -39.41,y = 297,z = 344,     --(圣域)圣域狂脊山村传送师
            },
            {
                mapId = 2,x = 298,y = 350,z = 266,     --(圣域)圣域狂脊山麓传送师
            },
            {
                mapId = 2,x = 107.33,y = 305.08,z = -385.58,     --(圣域)圣域-黄泉之井传送师
            },
            {
                mapId = 2,x = 318,y = 298,z = -239,     --(圣域)圣域金穗花田传送师
            },
        },
[15595]={
            {
                mapId = 4,x = 229,y = 316,z = 296,     --(银河竞技场)银河竞技场银都镇传送师
            },
            {
                mapId = 4,x = 2,y = 294,z = -306,     --(银河竞技场)银河竞技场铃之村传送师
            },
            {
                mapId = 4,x = -245,y = 284,z = 14,     --(银河竞技场)银河竞技场忍野牧场传送师
            },
            {
                mapId = 4,x = -332,y = 358,z = 166,     --(银河竞技场)银河竞技场十风穴传送师
            },
            {
                mapId = 4,x = 312,y = 312,z = 2,     --(银河竞技场)银河竞技场青木原树海传送师
            },
            {
                mapId = 4,x = -299,y = 284,z = -351,     --(银河竞技场)银河竞技场落日海滩传送师
            },
        },
[15594]={
            {
                mapId = 3,x = -231,y = 319,z = -144,     --(庐山)庐山隐龙村传送师
            },
            {
                mapId = 3,x = -185,y = 483,z = 269,     --(庐山)庐山天池传送师
            },
            {
                mapId = 3,x = 20,y = 340,z = -45,     --(庐山)庐山竹林传送师
            },
            {
                mapId = 3,x = 37,y = 390,z = 137,     --(庐山)庐山再会岭传送师
            },
            {
                mapId = 3,x = 130,y = 467,z = 349,     --(庐山)庐山圣战遗迹传送师
            },
        },
[15578]={
            {
                mapId = 2,x = -223,y = 338,z = 46,     --(圣域)圣域神谕祭司
            },
        },
[15801]={
            {
                mapId = 2,x = -251,y = 337,z = 32,     --(传送回城功能相关)圣域贸易区传送师
            },
        },
[15800]={
            {
                mapId = 1,x = -144,y = 372,z = 354,     --(传送回城功能相关)群星之地圣斗士墓地传送师
            },
        },
[15808]={
            {
                mapId = 1,x = -144,y = 372,z = 354,     --(传送回城功能相关)圣斗士墓地传送师（不明）
            },
        },
[10049]={
            {
                mapId = 1,x = -421,y = 329,z = 194,     --(传送回城功能相关)群星之地圣斗士修炼地传送师
            },
        },
[15540]={
            {
                mapId = 303,x = 841,y = 11,z = -1767,     --(剧本：勇闯十二宫)卫兵队长
            },
        },
[20815]={
            {
                mapId = 1,x = -426,y = 326,z = 100,     --(新手村)新手村面包商人
            },
            {
                mapId = 1,x = 22,y = 367,z = 290,     --(新手村)圣战之墙补给商人
            },
            {
                mapId = 1,x = -394,y = 309,z = 357,     --(新手村)港口补给商人
            },
            {
                mapId = 1,x = -156,y = 351,z = 120,     --(新手村)竞技场补给商人
            },
        },
[20818]={
            {
                mapId = 2,x = -94,y = 322,z = 84,     --(圣域)圣域商业区区面包商人
            },
            {
                mapId = 2,x = -265,y = 344,z = 217,     --(圣域)圣域神职区面包商人
            },
            {
                mapId = 2,x = -246,y = 337,z = 31,     --(圣域)圣域低级活动区面包商人
            },
            {
                mapId = 2,x = -188,y = 339,z = 294,     --(圣域)圣域高级活动区面包商人
            },
            {
                mapId = 2,x = 58,y = 294,z = 18,     --(圣域)试炼营补给点
            },
            {
                mapId = 2,x = -34,y = 297,z = 339,     --(圣域)狂脊山脉补给点
            },
            {
                mapId = 2,x = 192,y = 334,z = 370,     --(圣域)泰坦神殿补给点
            },
            {
                mapId = 2,x = 318,y = 298,z = -237,     --(圣域)古战场补给点
            },
            {
                mapId = 2,x = 299,y = 350,z = 265,     --(圣域)圣域狂脊之巅补给点
            },
        },
[20824]={
            {
                mapId = 3,x = -216,y = 319,z = -154,     --(庐山)庐山面包商人
            },
            {
                mapId = 3,x = -177,y = 484,z = 276,     --(庐山)庐山天池补给点
            },
            {
                mapId = 3,x = 36,y = 390,z = 139,     --(庐山)庐山再会岭补给商人
            },
            {
                mapId = 3,x = 13,y = 340,z = -40,     --(庐山)庐山竹林补给点
            },
            {
                mapId = 3,x = 132,y = 467,z = 350,     --(庐山)庐山圣战遗址补给商人
            },
        },
[20827]={
            {
                mapId = 4,x = 108,y = 290,z = 329,     --(银河竞技场)银河竞技场面包商人
            },
            {
                mapId = 4,x = 21,y = 294,z = -327,     --(银河竞技场)铃之村面包商人
            },
            {
                mapId = 4,x = -272,y = 283,z = -20,     --(银河竞技场)忍野牧场补给点
            },
            {
                mapId = 4,x = 161,y = 286,z = -350,     --(银河竞技场)铃之村周边补给点
            },
            {
                mapId = 4,x = -335,y = 358,z = 163,     --(银河竞技场)十风穴补给点
            },
            {
                mapId = 4,x = 314,y = 313,z = 2,     --(银河竞技场)青木原树海补给点
            },
            {
                mapId = 4,x = -300,y = 285,z = -349,     --(银河竞技场)落日海滩补给点
            },
        },
[15827]={
            {
                mapId = 5,x = -136,y = 290,z = -388,     --(遗忘之路)支线01流放峡谷_佐拉顿
            },
        },
[15828]={
            {
                mapId = 5,x = -13,y = 280,z = -449,     --(遗忘之路)支线02流放峡谷_死去的少女
            },
        },
[15829]={
            {
                mapId = 5,x = -94,y = 289,z = -384,     --(遗忘之路)支线03流放峡谷_希德尔多
            },
        },
[15830]={
            {
                mapId = 5,x = -88,y = 288,z = -414,     --(遗忘之路)支线04流放峡谷_隆多1
            },
        },
[15831]={
            {
                mapId = 5,x = -88,y = 288,z = -414,     --(遗忘之路)支线05流放峡谷_隆多2
            },
        },
[15832]={
            {
                mapId = 5,x = -88,y = 288,z = -414,     --(遗忘之路)支线06流放峡谷_隆多3
            },
        },
[15833]={
            {
                mapId = 5,x = 18,y = 306,z = -168,     --(遗忘之路)支线07遗忘之村涅菲德娅
            },
        },
[15834]={
            {
                mapId = 5,x = 5,y = 305,z = -181,     --(遗忘之路)支线08遗忘之村少女
            },
        },
[15835]={
            {
                mapId = 5,x = -6,y = 305,z = -200,     --(遗忘之路)支线09遗忘之村林登1
            },
        },
[15836]={
            {
                mapId = 5,x = -19,y = 313,z = -158,     --(遗忘之路)支线10遗忘之村哈尔娜
            },
        },
[15837]={
            {
                mapId = 5,x = 26,y = 308,z = -141,     --(遗忘之路)支线11遗忘之村拉格雷斯
            },
        },
[15838]={
            {
                mapId = 5,x = 26,y = 307,z = -108,     --(遗忘之路)支线12遗忘之村伊佐尔
            },
        },
[15839]={
            {
                mapId = 5,x = -22,y = 313,z = -159,     --(遗忘之路)支线13遗忘之村彭索斯病倒
            },
        },
[15840]={
            {
                mapId = 5,x = -22,y = 313,z = -159,     --(遗忘之路)支线14遗忘之村彭索斯
            },
        },
[15841]={
            {
                mapId = 5,x = 35,y = 308,z = -155,     --(遗忘之路)支线15遗忘之村塔纳
            },
        },
[15842]={
            {
                mapId = 5,x = -68,y = 311,z = -133,     --(遗忘之路)支线16遗忘之村彭索斯2
            },
        },
[15843]={
            {
                mapId = 5,x = 26,y = 308,z = -141,     --(遗忘之路)支线17遗忘之村拉格雷斯2
            },
        },
[15844]={
            {
                mapId = 5,x = 113,y = 328,z = -351,     --(遗忘之路)支线18命运神殿_诡异的瓶子1
            },
        },
[15845]={
            {
                mapId = 5,x = 257,y = 388,z = -287,     --(遗忘之路)支线19命运神殿_诡异的瓶子2
            },
        },
[15846]={
            {
                mapId = 5,x = 271,y = 388,z = -268,     --(遗忘之路)支线20命运神殿_祭司
            },
        },
[15848]={
            {
                mapId = 5,x = 259,y = 388,z = -282,     --(遗忘之路)支线22命运神殿_阿蒙斯2
            },
        },
[15849]={
            {
                mapId = 5,x = 257,y = 388,z = -287,     --(遗忘之路)支线23命运神殿_菲尼斯
            },
        },
[15850]={
            {
                mapId = 5,x = 259,y = 388,z = -282,     --(遗忘之路)支线24命运神殿_阿蒙斯3
            },
        },
[15851]={
            {
                mapId = 5,x = -15,y = 307,z = -377,     --(遗忘之路)支线25流放峡谷_特洛罗
            },
        },
[15852]={
            {
                mapId = 5,x = -63,y = 294,z = -383,     --(遗忘之路)支线26流放峡谷_米莲娜
            },
        },
[15853]={
            {
                mapId = 5,x = 4,y = 314,z = -420,     --(遗忘之路)支线27流放峡谷_埃雷
            },
        },
[15854]={
            {
                mapId = 5,x = 79,y = 327,z = -251,     --(遗忘之路)支线28流放峡谷_安杰
            },
        },
[15855]={
            {
                mapId = 5,x = 252,y = 388,z = -255,     --(遗忘之路)支线29命运神殿_克罗托
            },
        },
[15856]={
            {
                mapId = 5,x = 254,y = 388,z = -298,     --(遗忘之路)支线30命运神殿_拉切西斯
            },
        },
[15857]={
            {
                mapId = 5,x = 291,y = 388,z = -274,     --(遗忘之路)支线31命运神殿_阿特洛波斯
            },
        },
[15858]={
            {
                mapId = 5,x = 259,y = 388,z = -266,     --(遗忘之路)支线32命运神殿_纱织
            },
        },
[15859]={
            {
                mapId = 5,x = 268,y = 388,z = -266,     --(遗忘之路)支线33命运神殿_一辉
            },
        },
[15860]={
            {
                mapId = 5,x = 275,y = 388,z = -272,     --(遗忘之路)支线34命运神殿_卡西欧士
            },
        },
[15861]={
            {
                mapId = 5,x = 275,y = 388,z = -280,     --(遗忘之路)支线35命运神殿_莎尔娜
            },
        },
[15862]={
            {
                mapId = 5,x = 268,y = 388,z = -283,     --(遗忘之路)支线36命运神殿_艾欧里亚
            },
        },
[15863]={
            {
                mapId = 5,x = -25,y = 315,z = 135,     --(遗忘之路)支线37船坞_雷克托1
            },
        },
[15864]={
            {
                mapId = 5,x = 86,y = 319,z = 22,     --(遗忘之路)支线38船坞_萨克基米安
            },
        },
[15865]={
            {
                mapId = 5,x = -149,y = 320,z = -1,     --(遗忘之路)支线39遗忘之村纳格雅1
            },
        },
[15866]={
            {
                mapId = 5,x = -100,y = 330,z = 43,     --(遗忘之路)支线40遗忘之村纳格雅2
            },
        },
[15867]={
            {
                mapId = 5,x = -100,y = 330,z = 43,     --(遗忘之路)支线41遗忘之村纳格雅3
            },
        },
[15868]={
            {
                mapId = 5,x = -293,y = 365,z = 126,     --(遗忘之路)支线42遗忘之村海斗士灵魂
            },
        },
[15869]={
            {
                mapId = 5,x = -12,y = 310,z = 132,     --(遗忘之路)支线43船坞_菲舍
            },
        },
[15870]={
            {
                mapId = 5,x = 200,y = 340,z = 25,     --(遗忘之路)支线44朱利安大宅罗杰
            },
        },
[15873]={
            {
                mapId = 5,x = -103,y = 340,z = 110,     --(遗忘之路)支线47流放峡谷_格里夫塔
            },
        },
[15874]={
            {
                mapId = 5,x = -126,y = 340,z = 135,     --(遗忘之路)支线48流放峡谷_白夜
            },
        },
[15875]={
            {
                mapId = 5,x = 46,y = 308,z = 180,     --(遗忘之路)支线49海滩_乔安娜1
            },
        },
[15876]={
            {
                mapId = 5,x = 40,y = 308,z = 177,     --(遗忘之路)支线50海滩_雷克托2
            },
        },
[15877]={
            {
                mapId = 5,x = 45,y = 307,z = 186,     --(遗忘之路)支线51海滩_乔安娜
            },
        },
[15878]={
            {
                mapId = 5,x = 40,y = 307,z = 183,     --(遗忘之路)支线52海滩_美人鱼
            },
        },
[16112]={
            {
                mapId = 5,x = 258,y = 388,z = -271,     --(遗忘之路)支线53命运神殿_安杰2收任务
            },
        },
[16454]={
            {
                mapId = 5,x = -36,y = 314,z = 40,     --(遗忘之路)支线54海滩_塔纳2
            },
        },
[16838]={
            {
                mapId = 1,x = -487,y = 375,z = -32,     --(群星之地)群星_01出生地魔铃
            },
        },
[16845]={
            {
                mapId = 1,x = -317,y = 327,z = 101,     --(群星之地)群星_02训练地卡西欧士
            },
        },
[16846]={
            {
                mapId = 1,x = -318,y = 327,z = 99,     --(群星之地)群星_03训练地魔铃
            },
        },
[16847]={
            {
                mapId = 1,x = -297,y = 313,z = 8,     --(群星之地)群星_04拳壁艾德
            },
        },
[16848]={
            {
                mapId = 1,x = -270,y = 309,z = -50,     --(群星之地)群星_05沙滩星矢
            },
        },
[16849]={
            {
                mapId = 1,x = -174,y = 351,z = 145,     --(群星之地)群星_06竞技场魔铃
            },
        },
[16850]={
            {
                mapId = 1,x = -141,y = 352,z = 127,     --(群星之地)群星_07竞技场教皇
            },
        },
[16851]={
            {
                mapId = 1,x = -401,y = 327,z = 143,     --(群星之地)群星_08村子魔铃
            },
        },
[16852]={
            {
                mapId = 1,x = -401,y = 327,z = 124,     --(群星之地)群星_09村子候补生
            },
        },
[16853]={
            {
                mapId = 1,x = -398.491,y = 326.617,z = 155.927,     --(群星之地)群星_10村子星矢
            },
        },
[16854]={
            {
                mapId = 1,x = -106,y = 371,z = 387,     --(群星之地)群星_11墓地候补生
            },
        },
[16855]={
            {
                mapId = 1,x = -99,y = 377,z = 439,     --(群星之地)群星_12墓地圣斗士英灵
            },
        },
[16856]={
            {
                mapId = 1,x = 12,y = 366,z = 294,     --(群星之地)群星_13裂隙圣斗士英灵
            },
        },
[16857]={
            {
                mapId = 1,x = 36,y = 342,z = 181,     --(群星之地)群星_14圣域守卫
            },
        },
[16858]={
            {
                mapId = 1,x = 162,y = 421,z = 323,     --(群星之地)群星_15祭坛1
            },
        },
[16859]={
            {
                mapId = 1,x = 162,y = 421,z = 323,     --(群星之地)群星_16祭坛2
            },
        },
[16860]={
            {
                mapId = 1,x = 131,y = 430,z = 308,     --(群星之地)群星_17艾德幻象
            },
        },
[16862]={
            {
                mapId = 1,x = -430,y = 315,z = 270,     --(群星之地)群星_19古遗迹魔铃
            },
        },
[16863]={
            {
                mapId = 1,x = -438,y = 315,z = 281,     --(群星之地)群星_20古遗迹星矢
            },
        },
[16864]={
            {
                mapId = 1,x = -396,y = 311,z = 385,     --(群星之地)群星_21港口船夫
            },
        },
[17373]={
            {
                mapId = 1,x = -461,y = 373,z = -50,     --(群星之地)群星_22圣斗士纪念碑
            },
        },
[17528]={
            {
                mapId = 1,x = -141,y = 352,z = 127,     --(群星之地)群星_23竞技场教皇
            },
        },
[17075]={
            {
                mapId = 2,x = 25,y = 290,z = 168,     --(新版圣域)01船夫码头
            },
        },
[17076]={
            {
                mapId = 2,x = 55,y = 290,z = 174,     --(新版圣域)02黑衣少女1码头
            },
        },
[17077]={
            {
                mapId = 2,x = 67,y = 292,z = 201,     --(新版圣域)03尤朵拉1码头
            },
        },
[17078]={
            {
                mapId = 2,x = -106,y = 334,z = 299,     --(新版圣域)04尤朵拉2圣城门口
            },
        },
[17079]={
            {
                mapId = 2,x = -172,y = 339,z = 335,     --(新版圣域)05艾欧里亚1神职区
            },
        },
[17080]={
            {
                mapId = 2,x = -268,y = 361,z = 335,     --(新版圣域)06教皇1神职区
            },
        },
[17081]={
            {
                mapId = 40,x = -305,y = 359,z = 335,     --(新版圣域)07雅典娜幻象
            },
        },
[17082]={
            {
                mapId = 2,x = -214,y = 337,z = 79,     --(新版圣域)08尤朵拉3贸易区
            },
        },
[17083]={
            {
                mapId = 2,x = -220,y = 338,z = 76,     --(新版圣域)09尤丽缇丝1贸易区
            },
        },
[17084]={
            {
                mapId = 2,x = -155,y = 333,z = 65,     --(新版圣域)10黑衣少女2贸易区
            },
        },
[17092]={
            {
                mapId = 2,x = -131,y = 326,z = 16,     --(新版圣域)11艾欧里亚2生息区
            },
        },
[17093]={
            {
                mapId = 2,x = 67,y = 289,z = 50,     --(新版圣域)12营地候补生
            },
        },
[17094]={
            {
                mapId = 2,x = 63,y = 294,z = 7,     --(新版圣域)13奥路菲1营地
            },
        },
[17095]={
            {
                mapId = 2,x = 186,y = 291,z = -46,     --(新版圣域)14奄奄一息的候补生1森林
            },
        },
[17096]={
            {
                mapId = 2,x = 315,y = 299,z = -94,     --(新版圣域)15黑衣少女3森林
            },
        },
[17097]={
            {
                mapId = 2,x = 336,y = 304,z = -151,     --(新版圣域)16奥路菲2森林
            },
        },
[17098]={
            {
                mapId = 2,x = 333,y = 304,z = -148,     --(新版圣域)17尤丽缇丝2森林
            },
        },
[17100]={
            {
                mapId = 2,x = 399,y = 318,z = -94,     --(新版圣域)18罗德里奥古战场
            },
        },
[17101]={
            {
                mapId = 2,x = 222,y = 313,z = -257,     --(新版圣域)19阿历克斯1古战场
            },
        },
[17103]={
            {
                mapId = 2,x = 354,y = 289,z = -368,     --(新版圣域)20奥路菲3花田
            },
        },
[17105]={
            {
                mapId = 2,x = -7,y = 316,z = -394,     --(新版圣域)21奄奄一息的候补生2黄泉井
            },
        },
[17106]={
            {
                mapId = 2,x = -49,y = 316,z = -372,     --(新版圣域)22神秘的黄金圣斗士
            },
        },
[17107]={
            {
                mapId = 2,x = -206,y = 337,z = 49,     --(新版圣域)23尤朵拉4贸易区
            },
        },
[17108]={
            {
                mapId = 2,x = -216,y = 337,z = 101,     --(新版圣域)24艾欧里亚3贸易区
            },
        },
[17109]={
            {
                mapId = 2,x = -231,y = 350,z = 326,     --(新版圣域)25圣域侍卫神职区
            },
        },
[17110]={
            {
                mapId = 2,x = -256,y = 358,z = 335,     --(新版圣域)26沙加1神职区
            },
        },
[17111]={
            {
                mapId = 2,x = 8,y = 300,z = 280,     --(新版圣域)27尤朵拉5村口
            },
        },
[17112]={
            {
                mapId = 2,x = -16,y = 297,z = 343,     --(新版圣域)28艾欧里亚4村子
            },
        },
[17113]={
            {
                mapId = 2,x = -52,y = 297,z = 348,     --(新版圣域)29村长1村子
            },
        },
[17114]={
            {
                mapId = 2,x = 238,y = 329,z = 207,     --(新版圣域)30艾欧里亚5山谷
            },
        },
[17115]={
            {
                mapId = 2,x = 184,y = 326,z = 212,     --(新版圣域)31冥兵队长山谷
            },
        },
[17116]={
            {
                mapId = 2,x = -42,y = 297,z = 331,     --(新版圣域)32毕庇斯1村子
            },
        },
[17117]={
            {
                mapId = 2,x = 177,y = 332,z = 375,     --(新版圣域)33老乞丐神殿
            },
        },
[17118]={
            {
                mapId = 2,x = 180,y = 334,z = 139,     --(新版圣域)34失忆少女1山谷
            },
        },
[17119]={
            {
                mapId = 2,x = -43,y = 297,z = 335,     --(新版圣域)35村长2村子
            },
        },
[17120]={
            {
                mapId = 2,x = 121,y = 324,z = 375,     --(新版圣域)36加米安1神殿
            },
        },
[17121]={
            {
                mapId = 2,x = 121,y = 332,z = 410,     --(新版圣域)37加米安2神殿
            },
        },
[17122]={
            {
                mapId = 2,x = 101,y = 324,z = 418,     --(新版圣域)38尤朵拉6神殿
            },
        },
[17123]={
            {
                mapId = 2,x = -21,y = 297,z = 357,     --(新版圣域)39尤朵拉7村子垂死
            },
        },
[17124]={
            {
                mapId = 2,x = -21,y = 297,z = 357,     --(新版圣域)40尤朵拉8村子死亡
            },
        },
[17129]={
            {
                mapId = 2,x = -50,y = 297,z = 345,     --(新版圣域)41村长3村子死亡
            },
        },
[17130]={
            {
                mapId = 2,x = -42,y = 297,z = 332,     --(新版圣域)42毕庇斯2村子死亡
            },
        },
[17131]={
            {
                mapId = 2,x = -41,y = 297,z = 331,     --(新版圣域)43失忆少女2村子
            },
        },
[17132]={
            {
                mapId = 2,x = -393,y = 351,z = 348,     --(新版圣域)44十二宫守卫
            },
        },
[17133]={
            {
                mapId = 2,x = -31,y = 297,z = 328,     --(新版圣域)45失忆少女3村子
            },
        },
[17134]={
            {
                mapId = 2,x = 180,y = 334,z = 414,     --(新版圣域)46阿历克斯2神殿
            },
        },
[17135]={
            {
                mapId = 2,x = 227,y = 328,z = 200,     --(新版圣域)47沉睡的侍从山谷
            },
        },
[17136]={
            {
                mapId = 2,x = 374,y = 302,z = 196,     --(新版圣域)48艾欧里亚6山谷
            },
        },
[17137]={
            {
                mapId = 2,x = 245,y = 331,z = 215,     --(新版圣域)49艾欧里亚7山顶入口
            },
        },
[17138]={
            {
                mapId = 2,x = 248,y = 331,z = 210,     --(新版圣域)50阿鲁迪巴1山顶入口
            },
        },
[17139]={
            {
                mapId = 2,x = 247,y = 331,z = 212,     --(新版圣域)51沙加2山顶入口
            },
        },
[17140]={
            {
                mapId = 2,x = 328,y = 372,z = 332,     --(新版圣域)52艾欧里亚8山顶
            },
        },
[17141]={
            {
                mapId = 2,x = 340,y = 372,z = 378,     --(新版圣域)53失忆少女4山顶昏迷
            },
        },
[17142]={
            {
                mapId = 2,x = 337,y = 372,z = 355,     --(新版圣域)54沙加3山顶
            },
        },
[17143]={
            {
                mapId = 2,x = 333,y = 372,z = 357,     --(新版圣域)55阿鲁迪巴2山顶
            },
        },
[17144]={
            {
                mapId = 2,x = 341,y = 372,z = 352,     --(新版圣域)56艾欧里亚9山顶
            },
        },
[17145]={
            {
                mapId = 2,x = -268,y = 361,z = 335,     --(新版圣域)57教皇2神殿
            },
        },
[17174]={
            {
                mapId = 2,x = -160,y = 339,z = 352,     --(新版圣域)70圣域精兵神职区
            },
        },
[17180]={
            {
                mapId = 2,x = 339,y = 372,z = 378,     --(新版圣域)71失忆少女5山顶
            },
        },
[17181]={
            {
                mapId = 2,x = 203,y = 328,z = 198,     --(新版圣域)72冥界士兵1山谷
            },
        },
[17182]={
            {
                mapId = 2,x = 197,y = 326,z = 220,     --(新版圣域)73冥界士兵2山谷
            },
        },
[17184]={
            {
                mapId = 2,x = 184,y = 327,z = 198,     --(新版圣域)74冥界士兵3山谷
            },
        },
[17329]={
            {
                mapId = 2,x = 348,y = 375,z = 372,     --(新版圣域)75冥王神衣狂脊之巅
            },
        },
[1000001]={
            {
                mapId = 2,x = -116,y = 332,z = 125,     --(新版圣域)摆摊区域传送,
            },
        },
[17439]={
            {
                mapId = 2,x = -234,y = 337,z = 80,     --(青铜匠师 约瑟夫)发放青铜圣衣NPC
            },
        },
[17440]={
            {
                mapId = 2,x = -238,y = 337,z = 81,     --(白银匠师 阿尔泰)发放白银圣衣NPC
            },
        },
[17336]={
            {
                mapId = 2,x = -176,y = 332,z = 138,     --(新版圣域)占星术师NPC
            },
        },
[17860]={
            {
                mapId = 2,x = -239,y = 350,z = 359,     --(新版圣域)黄金军需官3
            },
        },
[17861]={
            {
                mapId = 2,x = -240,y = 350,z = 363,     --(新版圣域)黄金军需官4
            },
        },
[17400]={
            {
                mapId = 1,x = -141,y = 352,z = 127,     --(群星之地)教皇_进入副本
            },
        },
[18003]={
            {
                mapId = 1,x = -438,y = 371,z = -35,     --(群星之地)群星_41出生地魔铃石块旁
            },
        },
[16861]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_教皇观星楼内1
            },
        },
[17545]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_教皇观星楼内2
            },
        },
[17546]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_教皇观星楼内3
            },
        },
[17547]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_教皇观星楼内4
            },
        },
[17548]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_教皇观星楼内5
            },
        },
[16867]={
            {
                mapId = 1,x = -154,y = 351,z = 131,     --(群星之地)群星_竞技场星矢
            },
        },
[15629]={
            {
                mapId = 5,x = 84,y = 325,z = -405,     --(环任务)峡谷守卫
            },
        },
[15630]={
            {
                mapId = 5,x = 127,y = 310,z = -156,     --(环任务)遗忘之村村民
            },
        },
[15631]={
            {
                mapId = 5,x = -147,y = 325,z = -157,     --(环任务)铸剑大师1
            },
        },
[15632]={
            {
                mapId = 5,x = -147,y = 325,z = -157,     --(环任务)铸剑大师2
            },
        },
[15633]={
            {
                mapId = 5,x = -183,y = 320,z = -105,     --(环任务)修罗1
            },
        },
[15634]={
            {
                mapId = 2,x = -271,y = 337,z = 34,     --(环任务)米罗3
            },
        },
[15635]={
            {
                mapId = 2,x = -196,y = 337,z = 75,     --(环任务)穆2
            },
        },
[15636]={
            {
                mapId = 5,x = -145,y = 320,z = -40,     --(环任务)遗忘之路卫队长
            },
        },
[15637]={
            {
                mapId = 5,x = -135,y = 310,z = 216,     --(环任务)吉米
            },
        },
[15638]={
            {
                mapId = 5,x = -43,y = 310,z = 154,     --(环任务)沙加1
            },
        },
[15639]={
            {
                mapId = 6,x = -99,y = 349,z = 34,     --(环任务)沙加2
            },
        },
[15640]={
            {
                mapId = 6,x = -211,y = 354,z = 11,     --(环任务)沙加3
            },
        },
[15641]={
            {
                mapId = 2,x = -196,y = 337,z = 65,     --(环任务)纱织
            },
        },
[15642]={
            {
                mapId = 4,x = 65,y = 284,z = -219,     --(环任务)玛尔斯1
            },
        },
[15643]={
            {
                mapId = 4,x = -4,y = 285,z = -42,     --(环任务)玛尔斯2
            },
        },
[15644]={
            {
                mapId = 4,x = -51,y = 282,z = 34,     --(环任务)玛尔斯3
            },
        },
[15645]={
            {
                mapId = 4,x = -11,y = 282,z = -70,     --(环任务)艾欧利亚1
            },
        },
[15646]={
            {
                mapId = 6,x = -319,y = 362,z = 49,     --(环任务)面具少女杰茜1
            },
        },
[15647]={
            {
                mapId = 6,x = -314,y = 362,z = 40,     --(环任务)面具少女杰茜2
            },
        },
[15649]={
            {
                mapId = 6,x = -341,y = 364,z = 16,     --(环任务)面具少女杰茜4
            },
        },
[15650]={
            {
                mapId = 6,x = -292,y = 366,z = 136,     --(环任务)劳伦斯1
            },
        },
[15651]={
            {
                mapId = 6,x = -318,y = 363,z = 51,     --(环任务)劳伦斯2
            },
        },
[15652]={
            {
                mapId = 6,x = -132,y = 364,z = -122,     --(环任务)奴隶主1
            },
        },
[15653]={
            {
                mapId = 6,x = -88,y = 365,z = -175,     --(环任务)奴隶主2
            },
        },
[15654]={
            {
                mapId = 6,x = -106,y = 351,z = 16,     --(环任务)皇后岛学员琳1
            },
        },
[15655]={
            {
                mapId = 6,x = -327,y = 361,z = 34,     --(环任务)皇后岛学员琳2
            },
        },
[15657]={
            {
                mapId = 6,x = -230,y = 351,z = -50,     --(环任务)黑暗杂兵1
            },
        },
[15659]={
            {
                mapId = 6,x = -246,y = 351,z = -231,     --(环任务)黑暗杂兵队长1
            },
        },
[15660]={
            {
                mapId = 6,x = -246,y = 351,z = -231,     --(环任务)黑暗杂兵队长2
            },
        },
[15662]={
            {
                mapId = 6,x = -173,y = 332,z = -289,     --(环任务)一辉1
            },
        },
[15665]={
            {
                mapId = 6,x = 105,y = 355,z = -153,     --(环任务)小奴隶
            },
        },
[15666]={
            {
                mapId = 6,x = -157,y = 352,z = -23,     --(环任务)老奴隶
            },
        },
[15667]={
            {
                mapId = 6,x = -224,y = 364,z = 37,     --(环任务)奴隶青年A
            },
        },
[15668]={
            {
                mapId = 6,x = -29,y = 359,z = -237,     --(环任务)奴隶青年B
            },
        },
[15669]={
            {
                mapId = 6,x = 227,y = 341,z = -285,     --(环任务)奴隶青年C
            },
        },
[15671]={
            {
                mapId = 6,x = -110,y = 347,z = -255,     --(环任务)汤姆1
            },
        },
[15672]={
            {
                mapId = 6,x = -206,y = 341,z = -345,     --(环任务)汤姆2
            },
        },
[15673]={
            {
                mapId = 6,x = -138,y = 352,z = -30,     --(环任务)面具家族青年
            },
        },
[15674]={
            {
                mapId = 6,x = 189,y = 325,z = 3,     --(环任务)鸦1
            },
        },
[15675]={
            {
                mapId = 6,x = 190,y = 325,z = 3,     --(环任务)鸦2
            },
        },
[15676]={
            {
                mapId = 6,x = -97,y = 348,z = 68,     --(环任务)鸦3
            },
        },
[15677]={
            {
                mapId = 6,x = 114,y = 355,z = -221,     --(环任务)梅兰1
            },
        },
[15678]={
            {
                mapId = 6,x = 342,y = 319,z = -375,     --(环任务)梅兰2
            },
        },
[18405]={
            {
                mapId = 2,x = -193,y = 337,z = 90,     --(圣域)职业转换师
            },
        },
[18165]={
            {
                mapId = 2,x = -193,y = 337,z = 86,     --(圣域)宝物商人
            },
        },
[17014]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_进入副本金色幻象1
            },
        },
[17015]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_进入副本金色幻象2
            },
        },
[17016]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_进入副本金色幻象3
            },
        },
[17017]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_进入副本金色幻象4
            },
        },
[17018]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(群星之地)群星_进入副本金色幻象5
            },
        },
[15971]={
            {
                mapId = 5,x = -26,y = 315,z = 126,     --(遗忘之路)支线失聪的船匠
            },
        },
[16373]={
            {
                mapId = 2,x = -196,y = 337,z = 80,     --(圣域)圣域支线小男孩阿沃里
            },
        },
[18406]={
            {
                mapId = 2,x = -244,y = 340,z = 55,     --(圣域)祭祀学徒
            },
        },
[18479]={
            {
                mapId = 2,x = -434,y = 361,z = 350,     --(圣域)十二宫入口始
            },
        },
[18846]={
            {
                mapId = 5,x = 262.45,y = 388.1,z = -262.15,     --(遗忘之路)射手逃亡入口
            },
        },
[19317]={
            {
                mapId = 2,x = -183,y = 339,z = 402,     --(圣域)战场奖励
            },
        },
[16355]={
            {
                mapId = 2,x = -183,y = 339,z = 405,     --(圣域)战场指引
            },
        },
[20220]={
            {
                mapId = 2,x = -183,y = 339,z = 408,     --(圣域)周限次任务
            },
        },
[16122]={
            {
                mapId = 2,x = -249,y = 338,z = 32,     --(圣域)卢卡斯
            },
        },
[17283]={
            {
                mapId = 2,x = -246,y = 337,z = 31,     --(圣域)戴安娜
            },
        },
[15817]={
            {
                mapId = 2,x = -257,y = 338,z = 22,     --(圣域)辛吉德
            },
        },
[16466]={
            {
                mapId = 5,x = -162,y = 288,z = -434,     --(遗忘之路)多吉
            },
        },
[16469]={
            {
                mapId = 5,x = -114,y = 288,z = -390,     --(遗忘之路)多吉
            },
        },
[16487]={
            {
                mapId = 5,x = -116,y = 288,z = -390,     --(遗忘之路)高龙巴
            },
        },
[16484]={
            {
                mapId = 5,x = -196,y = 294,z = -354,     --(遗忘之路)高龙巴
            },
        },
[16475]={
            {
                mapId = 5,x = -122,y = 290,z = -381,     --(遗忘之路)放逐者B
            },
        },
[16472]={
            {
                mapId = 5,x = -118,y = 290,z = -380,     --(遗忘之路)放逐者A
            },
        },
[16493]={
            {
                mapId = 5,x = 35,y = 276,z = -458,     --(遗忘之路)海鸣之影
            },
        },
[16481]={
            {
                mapId = 5,x = -74,y = 288,z = -400,     --(遗忘之路)海鸣之影
            },
        },
[16478]={
            {
                mapId = 5,x = -97,y = 289,z = -383,     --(遗忘之路)放逐守卫
            },
        },
[16496]={
            {
                mapId = 5,x = 35,y = 276,z = -460,     --(遗忘之路)奥古斯塔
            },
        },
[16490]={
            {
                mapId = 5,x = 41,y = 277,z = -458,     --(遗忘之路)放逐守卫
            },
        },
[16503]={
            {
                mapId = 5,x = 53,y = 326,z = -409,     --(遗忘之路)高龙巴
            },
        },
[17794]={
            {
                mapId = 5,x = 55,y = 326,z = -413,     --(遗忘之路)加密安
            },
        },
[16500]={
            {
                mapId = 5,x = 55,y = 326,z = -413,     --(遗忘之路)加密安
            },
        },
[16506]={
            {
                mapId = 5,x = 208,y = 372,z = -299,     --(遗忘之路)堕落放逐者
            },
        },
[16509]={
            {
                mapId = 5,x = 225,y = 381,z = -275,     --(遗忘之路)扫地老妇
            },
        },
[16515]={
            {
                mapId = 5,x = 207,y = 376,z = -272,     --(遗忘之路)陆震之影
            },
        },
[16518]={
            {
                mapId = 5,x = 259,y = 388,z = -276,     --(遗忘之路)高龙巴
            },
        },
[16521]={
            {
                mapId = 5,x = 249,y = 389,z = -252,     --(遗忘之路)命运女神1
            },
        },
[16527]={
            {
                mapId = 5,x = 295,y = 389,z = -274,     --(遗忘之路)命运女神2
            },
        },
[16524]={
            {
                mapId = 5,x = 252,y = 389,z = -301,     --(遗忘之路)命运女神3
            },
        },
[16530]={
            {
                mapId = 5,x = 91,y = 328,z = -263,     --(遗忘之路)高龙巴
            },
        },
[16533]={
            {
                mapId = 5,x = 89,y = 328,z = -262,     --(遗忘之路)商人
            },
        },
[16545]={
            {
                mapId = 5,x = 133,y = 310,z = -165,     --(遗忘之路)商人
            },
        },
[16548]={
            {
                mapId = 5,x = 135,y = 310,z = -167,     --(遗忘之路)高龙巴
            },
        },
[16536]={
            {
                mapId = 5,x = 144,y = 310,z = -176,     --(遗忘之路)圣军士兵A
            },
        },
[16539]={
            {
                mapId = 5,x = 118,y = 310,z = -161,     --(遗忘之路)圣军士兵B
            },
        },
[16542]={
            {
                mapId = 5,x = 138,y = 310,z = -155,     --(遗忘之路)卡阿
            },
        },
[16551]={
            {
                mapId = 5,x = 56,y = 304,z = -207,     --(遗忘之路)遗忘守卫
            },
        },
[16554]={
            {
                mapId = 5,x = 45,y = 312,z = -153,     --(遗忘之路)村长
            },
        },
[16557]={
            {
                mapId = 5,x = 46,y = 312,z = -154,     --(遗忘之路)高龙巴
            },
        },
[16575]={
            {
                mapId = 5,x = -4,y = 305,z = -182,     --(遗忘之路)狮子
            },
        },
[16563]={
            {
                mapId = 5,x = -2,y = 305,z = -183,     --(遗忘之路)高龙巴
            },
        },
[16566]={
            {
                mapId = 5,x = 6,y = 309,z = -123,     --(遗忘之路)潘恩
            },
        },
[16629]={
            {
                mapId = 5,x = 15,y = 305,z = -178,     --(遗忘之路)队长
            },
        },
[16572]={
            {
                mapId = 5,x = 19,y = 305,z = -191,     --(遗忘之路)潘恩
            },
        },
[16569]={
            {
                mapId = 5,x = 19,y = 305,z = -191,     --(遗忘之路)潘恩
            },
        },
[16626]={
            {
                mapId = 5,x = 21,y = 305,z = -211,     --(遗忘之路)奥古斯塔
            },
        },
[17806]={
            {
                mapId = 5,x = 17,y = 305,z = -175,     --(遗忘之路)希尔汗
            },
        },
[16578]={
            {
                mapId = 5,x = -194,y = 326,z = -222,     --(遗忘之路)希尔汗
            },
        },
[16602]={
            {
                mapId = 5,x = -186,y = 326,z = -179,     --(遗忘之路)命运女神
            },
        },
[16635]={
            {
                mapId = 5,x = -178,y = 320,z = -103,     --(遗忘之路)奥古斯塔
            },
        },
[16638]={
            {
                mapId = 5,x = -178,y = 320,z = -103,     --(遗忘之路)奥古斯塔
            },
        },
[16632]={
            {
                mapId = 5,x = -164,y = 324,z = -191,     --(遗忘之路)后勤商
            },
        },
[17460]={
            {
                mapId = 5,x = -176,y = 320,z = -48,     --(遗忘之路)村长
            },
        },
[16641]={
            {
                mapId = 5,x = -27,y = 315,z = 129,     --(遗忘之路)苏兰特
            },
        },
[16644]={
            {
                mapId = 5,x = -29,y = 315,z = 136,     --(遗忘之路)海皇
            },
        },
[16647]={
            {
                mapId = 5,x = -20,y = 315,z = 129,     --(遗忘之路)海盗
            },
        },
[16668]={
            {
                mapId = 5,x = 4,y = 308,z = 183,     --(遗忘之路)苏兰特
            },
        },
[16671]={
            {
                mapId = 5,x = 0,y = 307,z = 184,     --(遗忘之路)海皇
            },
        },
[16650]={
            {
                mapId = 5,x = -37,y = 310,z = 109,     --(遗忘之路)海盗
            },
        },
[16653]={
            {
                mapId = 5,x = 206,y = 340,z = -2,     --(遗忘之路)索罗门卫
            },
        },
[16656]={
            {
                mapId = 5,x = 212,y = 340,z = 0,     --(遗忘之路)管家
            },
        },
[16659]={
            {
                mapId = 5,x = 214,y = 340,z = 1,     --(遗忘之路)地中海王
            },
        },
[16683]={
            {
                mapId = 5,x = 212,y = 340,z = -4,     --(遗忘之路)海皇
            },
        },
[16707]={
            {
                mapId = 5,x = 212,y = 346,z = 133,     --(遗忘之路)海皇
            },
        },
[16710]={
            {
                mapId = 5,x = 200,y = 343,z = 155,     --(遗忘之路)苏兰特
            },
        },
[16686]={
            {
                mapId = 5,x = -95,y = 330,z = 57,     --(遗忘之路)造船厂厂主
            },
        },
[16689]={
            {
                mapId = 5,x = -110,y = 340,z = 121,     --(遗忘之路)船大工
            },
        },
[16692]={
            {
                mapId = 5,x = -138,y = 340,z = 112,     --(遗忘之路)黑独角兽
            },
        },
[16731]={
            {
                mapId = 5,x = -282,y = 355,z = 128,     --(遗忘之路)希尔汗
            },
        },
[16734]={
            {
                mapId = 5,x = -200,y = 355,z = 116,     --(遗忘之路)希尔汗
            },
        },
[16713]={
            {
                mapId = 5,x = -106,y = 309,z = 239,     --(遗忘之路)美人鱼
            },
        },
[16695]={
            {
                mapId = 5,x = -107,y = 308,z = 235,     --(遗忘之路)黑凤凰
            },
        },
[16701]={
            {
                mapId = 5,x = -105,y = 308,z = 235,     --(遗忘之路)黑独角兽
            },
        },
[16719]={
            {
                mapId = 5,x = -182,y = 306,z = 262,     --(遗忘之路)美人鱼
            },
        },
[16725]={
            {
                mapId = 5,x = -191,y = 306,z = 297,     --(遗忘之路)双子幻象
            },
        },
[16737]={
            {
                mapId = 5,x = -199,y = 355,z = 174,     --(遗忘之路)美人鱼
            },
        },
[18917]={
            {
                mapId = 6,x = 346,y = 319,z = -312,     --(死亡皇后岛)主线01港口船夫
            },
        },
[18918]={
            {
                mapId = 6,x = 413,y = 319,z = -261,     --(死亡皇后岛)主线02暗穴昏迷逃奴
            },
        },
[18919]={
            {
                mapId = 6,x = 413,y = 319,z = -261,     --(死亡皇后岛)主线03暗穴清醒逃奴
            },
        },
[18920]={
            {
                mapId = 6,x = 328,y = 319,z = -346,     --(死亡皇后岛)主线04海望沙滩枫
            },
        },
[18921]={
            {
                mapId = 6,x = 322,y = 322,z = -427,     --(死亡皇后岛)主线05海望沙滩学员
            },
        },
[18922]={
            {
                mapId = 6,x = 204,y = 335,z = -349,     --(死亡皇后岛)主线06平原入口瞬
            },
        },
[18923]={
            {
                mapId = 6,x = 198,y = 335,z = -350,     --(死亡皇后岛)主线07平原入口枫
            },
        },
[18924]={
            {
                mapId = 6,x = 200,y = 335,z = -347,     --(死亡皇后岛)主线08皇后岛学员雷火
            },
        },
[18925]={
            {
                mapId = 6,x = 231,y = 341,z = -268,     --(死亡皇后岛)主线09矿场奴隶
            },
        },
[18926]={
            {
                mapId = 6,x = 203,y = 334,z = -348,     --(死亡皇后岛)主线10平原入口逃奴
            },
        },
[18927]={
            {
                mapId = 6,x = 110,y = 347,z = -390,     --(死亡皇后岛)主线11杉树林中心瞬
            },
        },
[18928]={
            {
                mapId = 6,x = -26,y = 353,z = -405,     --(死亡皇后岛)主线12重伤的候补生
            },
        },
[18929]={
            {
                mapId = 6,x = -43,y = 353,z = -397,     --(死亡皇后岛)主线13杉树林深处一辉
            },
        },
[18930]={
            {
                mapId = 6,x = 76,y = 346,z = -394,     --(死亡皇后岛)主线14石林入口枫
            },
        },
[18931]={
            {
                mapId = 6,x = 73,y = 347,z = -393,     --(死亡皇后岛)主线15石林入口逃奴
            },
        },
[18932]={
            {
                mapId = 6,x = -49,y = 360,z = -244,     --(死亡皇后岛)主线16石林中瞬1
            },
        },
[18933]={
            {
                mapId = 6,x = -49,y = 360,z = -244,     --(死亡皇后岛)主线17石林中瞬2
            },
        },
[18934]={
            {
                mapId = 6,x = -47,y = 360,z = -246,     --(死亡皇后岛)主线18石林一辉
            },
        },
[18935]={
            {
                mapId = 6,x = -45,y = 360,z = -251,     --(死亡皇后岛)主线19石林逃奴
            },
        },
[18936]={
            {
                mapId = 6,x = 42,y = 357,z = -147,     --(死亡皇后岛)主线20营地瞬
            },
        },
[18937]={
            {
                mapId = 6,x = 44,y = 357,z = -146,     --(死亡皇后岛)主线21营地逃奴
            },
        },
[18938]={
            {
                mapId = 6,x = -16,y = 355,z = -160,     --(死亡皇后岛)主线22黑暗水蛇座
            },
        },
[18939]={
            {
                mapId = 6,x = -16,y = 355,z = -160,     --(死亡皇后岛)主线23黑暗水蛇座尸体
            },
        },
[18940]={
            {
                mapId = 6,x = 86,y = 360,z = -163,     --(死亡皇后岛)主线24营地沙加
            },
        },
[18941]={
            {
                mapId = 6,x = 82,y = 358,z = -161,     --(死亡皇后岛)主线25沙加边上瞬
            },
        },
[18942]={
            {
                mapId = 6,x = -91,y = 365,z = -160,     --(死亡皇后岛)主线26淘金者之村枫
            },
        },
[18943]={
            {
                mapId = 6,x = -122,y = 366,z = -165,     --(死亡皇后岛)主线27淘金者之村老奴隶
            },
        },
[18944]={
            {
                mapId = 6,x = -106,y = 365,z = -142,     --(死亡皇后岛)主线28淘金者之村奴隶1
            },
        },
[18945]={
            {
                mapId = 6,x = -96,y = 365,z = -140,     --(死亡皇后岛)主线29淘金者之村奴隶2
            },
        },
[18946]={
            {
                mapId = 6,x = -112,y = 365,z = -190,     --(死亡皇后岛)主线30淘金者之村奴隶3
            },
        },
[18947]={
            {
                mapId = 6,x = -91,y = 365,z = -163,     --(死亡皇后岛)主线31淘金者之村逃奴
            },
        },
[18948]={
            {
                mapId = 6,x = -189,y = 339,z = -362,     --(死亡皇后岛)主线32死亡矿坑奴隶主的人
            },
        },
[18949]={
            {
                mapId = 6,x = -228,y = 333,z = -372,     --(死亡皇后岛)主线33死亡矿坑逃奴
            },
        },
[18950]={
            {
                mapId = 6,x = -192,y = 339,z = -371,     --(死亡皇后岛)主线34死亡矿坑皇后岛学员
            },
        },
[18951]={
            {
                mapId = 6,x = -101,y = 365,z = -150,     --(死亡皇后岛)主线35淘金者之村奴隶主的人
            },
        },
[18952]={
            {
                mapId = 6,x = -115,y = 365,z = -124,     --(死亡皇后岛)主线36淘金者之村奴隶主
            },
        },
[18953]={
            {
                mapId = 6,x = -372.157,y = 349.88,z = -200.124,     --(死亡皇后岛)主线37矿道中间瞬
            },
        },
[18954]={
            {
                mapId = 6,x = -327.824,y = 343.448,z = -247.65,     --(死亡皇后岛)主线38矿道中间枫
            },
        },
[18955]={
            {
                mapId = 6,x = -343.714,y = 363.201,z = -160.244,     --(死亡皇后岛)主线39矿道末端瞬
            },
        },
[18956]={
            {
                mapId = 6,x = -283,y = 337,z = -273,     --(死亡皇后岛)主线40矿道皇后岛学员
            },
        },
[18957]={
            {
                mapId = 6,x = -325,y = 363,z = -167,     --(死亡皇后岛)主线41熔金营地瞬
            },
        },
[18958]={
            {
                mapId = 6,x = -322,y = 363,z = -168,     --(死亡皇后岛)主线42熔金营地一辉
            },
        },
[18959]={
            {
                mapId = 6,x = -321,y = 363,z = -171,     --(死亡皇后岛)主线43熔金营地枫
            },
        },
[18960]={
            {
                mapId = 6,x = -243,y = 339,z = -189,     --(死亡皇后岛)主线44奄奄一息的塔瓦娜遗民
            },
        },
[18961]={
            {
                mapId = 6,x = -261,y = 352,z = -217,     --(死亡皇后岛)主线45熔金营地外枫
            },
        },
[18962]={
            {
                mapId = 6,x = -241,y = 352,z = -58,     --(死亡皇后岛)主线46矿道内部瞬
            },
        },
[18963]={
            {
                mapId = 6,x = -240,y = 352,z = -58,     --(死亡皇后岛)主线47矿道内部枫
            },
        },
[18964]={
            {
                mapId = 6,x = -316.279,y = 354.549,z = 10.5912,     --(死亡皇后岛)主线48矿道出口一辉
            },
        },
[18965]={
            {
                mapId = 6,x = -378,y = 379,z = 45,     --(死亡皇后岛)主线49遗迹建筑中遗民1
            },
        },
[18966]={
            {
                mapId = 6,x = -403,y = 382,z = 65,     --(死亡皇后岛)主线50大长老
            },
        },
[18967]={
            {
                mapId = 6,x = -405,y = 368,z = -17,     --(死亡皇后岛)主线51面具家族人遗迹建筑外
            },
        },
[18968]={
            {
                mapId = 6,x = -389,y = 381,z = 61,     --(死亡皇后岛)主线52遗迹建筑中遗民2
            },
        },
[18969]={
            {
                mapId = 6,x = -396,y = 381,z = 52,     --(死亡皇后岛)主线53遗迹建筑面具家族人
            },
        },
[18970]={
            {
                mapId = 6,x = -376,y = 367,z = 135,     --(死亡皇后岛)主线54面具家族找叛徒
            },
        },
[18971]={
            {
                mapId = 6,x = -374,y = 368,z = 133,     --(死亡皇后岛)主线55塔瓦娜遗民找叛徒
            },
        },
[18972]={
            {
                mapId = 6,x = -380,y = 367,z = 180,     --(死亡皇后岛)主线56塔瓦娜背叛者
            },
        },
[18973]={
            {
                mapId = 6,x = -424,y = 371,z = 221,     --(死亡皇后岛)主线57黑暗独角兽座
            },
        },
[18974]={
            {
                mapId = 6,x = -424,y = 371,z = 221,     --(死亡皇后岛)主线58黑暗独角兽尸体
            },
        },
[18976]={
            {
                mapId = 6,x = -335,y = 368,z = 158,     --(死亡皇后岛)主线60面具家族人巨石前
            },
        },
[18977]={
            {
                mapId = 6,x = -327.837,y = 342.27,z = 222.609,     --(死亡皇后岛)主线61重伤的遗民
            },
        },
[18978]={
            {
                mapId = 6,x = -299.33,y = 341.746,z = 304.2,     --(死亡皇后岛)主线62沙加罪赎之地
            },
        },
[18979]={
            {
                mapId = 6,x = -315,y = 342,z = 298,     --(死亡皇后岛)主线63一辉罪赎之地
            },
        },
[18980]={
            {
                mapId = 6,x = -255,y = 343,z = 322,     --(死亡皇后岛)主线64遗迹大长老被锁着
            },
        },
[18981]={
            {
                mapId = 6,x = -255,y = 343,z = 322,     --(死亡皇后岛)主线65遗迹大长老解放
            },
        },
[18983]={
            {
                mapId = 6,x = -213,y = 353,z = -4,     --(死亡皇后岛)主线67凤凰之尾一辉
            },
        },
[18984]={
            {
                mapId = 6,x = -211,y = 353,z = -5,     --(死亡皇后岛)主线68凤凰之尾枫
            },
        },
[18985]={
            {
                mapId = 6,x = -101,y = 351,z = 22,     --(死亡皇后岛)主线69墓地瞬
            },
        },
[18986]={
            {
                mapId = 6,x = -103,y = 349,z = 40,     --(死亡皇后岛)主线70墓地一辉
            },
        },
[18987]={
            {
                mapId = 6,x = -99,y = 352,z = 21,     --(死亡皇后岛)主线71墓地星矢
            },
        },
[18990]={
            {
                mapId = 6,x = -90,y = 351,z = 26,     --(死亡皇后岛)主线74墓地枫
            },
        },
[18991]={
            {
                mapId = 6,x = -90,y = 351,z = 26,     --(死亡皇后岛)主线75墓地戴面具枫
            },
        },
[18992]={
            {
                mapId = 6,x = 129,y = 325,z = -1,     --(死亡皇后岛)主线76火山入口瞬
            },
        },
[18993]={
            {
                mapId = 6,x = 63,y = 303,z = 95,     --(死亡皇后岛)主线77火山中冰河
            },
        },
[18994]={
            {
                mapId = 6,x = 19,y = 326,z = 185,     --(死亡皇后岛)主线78火山中紫龙
            },
        },
[18995]={
            {
                mapId = 6,x = 84,y = 346,z = 220,     --(死亡皇后岛)主线79王座一辉
            },
        },
[19001]={
            {
                mapId = 6,x = 193,y = 346,z = -225,     --(死亡皇后岛)主线85奴隶居所奴隶
            },
        },
[19442]={
            {
                mapId = 6,x = -129.071,y = 365.696,z = -154.182,     --(死亡皇后岛)主线86最后的枫
            },
        },
[19443]={
            {
                mapId = 6,x = -124.407,y = 366.428,z = -158.553,     --(死亡皇后岛)主线87最后的瞬
            },
        },
[19444]={
            {
                mapId = 6,x = -121.258,y = 366.35,z = -158.756,     --(死亡皇后岛)主线88最后的沙织
            },
        },
[19445]={
            {
                mapId = 6,x = -130.028,y = 365.752,z = -153.114,     --(死亡皇后岛)主线89最后的逃奴大有
            },
        },
[16414]={
            {
                mapId = 3,x = -287,y = 323,z = -92,     --(庐山)生活NPC庐山
            },
        },
[17511]={
            {
                mapId = 5,x = 18,y = 306,z = -204,     --(遗忘之路)遗忘之路生活NPC
            },
        },
[19938]={
            {
                mapId = 3,x = -97,y = 326,z = -255,     --(庐山)生活NPC庐山
            },
        },
[19939]={
            {
                mapId = 6,x = -150,y = 365,z = -137,     --(死亡皇后岛)生活NPC死亡皇后岛
            },
        },
[19940]={
            {
                mapId = 6,x = -311,y = 363,z = -178,     --(死亡皇后岛)生活NPC死亡皇后岛
            },
        },
[19941]={
            {
                mapId = 6,x = -418,y = 384,z = 29,     --(死亡皇后岛)生活NPC死亡皇后岛
            },
        },
[17850]={
            {
                mapId = 2,x = -88,y = 322,z = 77,     --(圣域)符文镶嵌师
            },
        },
[20026]={
            {
                mapId = 6,x = -403,y = 382,z = 69,     --(死亡皇后岛)支线塔瓦娜长老
            },
        },
[17542]={
            {
                mapId = 2,x = -94,y = 322,z = 58,     --(圣域)圣域神匠
            },
        },
[18730]={
            {
                mapId = 6,x = 180,y = 346,z = -204,     --(死亡皇后岛)支线休提斯1
            },
        },
[18732]={
            {
                mapId = 6,x = 236,y = 330,z = -368,     --(死亡皇后岛)支线马瓦塔1
            },
        },
[18733]={
            {
                mapId = 6,x = 307,y = 319,z = -355,     --(死亡皇后岛)支持马瓦塔2
            },
        },
[18734]={
            {
                mapId = 6,x = -97,y = 365,z = -130,     --(死亡皇后岛)支线希斯旻
            },
        },
[18735]={
            {
                mapId = 6,x = -122,y = 350,z = -228,     --(死亡皇后岛)支线卡耐尔1
            },
        },
[18736]={
            {
                mapId = 6,x = -327,y = 363,z = -153,     --(死亡皇后岛)支线卡耐尔2
            },
        },
[18737]={
            {
                mapId = 6,x = -240,y = 352,z = -157,     --(死亡皇后岛)支线卡耐尔3
            },
        },
[18738]={
            {
                mapId = 6,x = -433,y = 379,z = 6,     --(死亡皇后岛)支线卡耐尔4
            },
        },
[18739]={
            {
                mapId = 6,x = 1,y = 356,z = -144,     --(死亡皇后岛)支线洛里尼
            },
        },
[18740]={
            {
                mapId = 6,x = -26,y = 359,z = -238,     --(死亡皇后岛)支线帕斯卡1
            },
        },
[18741]={
            {
                mapId = 6,x = -36,y = 365,z = -58,     --(死亡皇后岛)支线帕斯卡2
            },
        },
[18742]={
            {
                mapId = 6,x = 1,y = 355,z = -191,     --(死亡皇后岛)支线帕斯卡13
            },
        },
[18743]={
            {
                mapId = 6,x = 1,y = 356,z = -191,     --(死亡皇后岛)支线瞬
            },
        },
[18744]={
            {
                mapId = 6,x = -358,y = 347,z = -228,     --(死亡皇后岛)支线凯文罗斯
            },
        },
[18745]={
            {
                mapId = 6,x = 63,y = 362,z = -350,     --(死亡皇后岛)支线伊尔莎
            },
        },
[18746]={
            {
                mapId = 6,x = 159,y = 355,z = -240,     --(死亡皇后岛)支线瓦帕特1
            },
        },
[18747]={
            {
                mapId = 6,x = 42,y = 359,z = -367,     --(死亡皇后岛)支线瓦帕特2
            },
        },
[18748]={
            {
                mapId = 6,x = -114,y = 348,z = -271,     --(死亡皇后岛)支线瓦帕特3
            },
        },
[18749]={
            {
                mapId = 6,x = -72,y = 363,z = -40,     --(死亡皇后岛)支线瓦帕特4
            },
        },
[18750]={
            {
                mapId = 6,x = 4,y = 356,z = -208,     --(死亡皇后岛)支线瓦帕特5
            },
        },
[18751]={
            {
                mapId = 6,x = 27,y = 363,z = -359,     --(死亡皇后岛)支线赛普路斯
            },
        },
[18752]={
            {
                mapId = 6,x = -26,y = 359,z = -223,     --(死亡皇后岛)支线小厮
            },
        },
[18753]={
            {
                mapId = 6,x = -19,y = 353,z = -411,     --(死亡皇后岛)支线米提拉1
            },
        },
[18754]={
            {
                mapId = 6,x = -71,y = 353,z = -363,     --(死亡皇后岛)支线米提拉2
            },
        },
[18755]={
            {
                mapId = 6,x = -22,y = 356,z = -154,     --(死亡皇后岛)支线雪莉
            },
        },
[18756]={
            {
                mapId = 6,x = -34,y = 362,z = -280,     --(死亡皇后岛)支线弗兰克
            },
        },
[18757]={
            {
                mapId = 6,x = -177,y = 362,z = -37,     --(死亡皇后岛)支线贝塔1
            },
        },
[18759]={
            {
                mapId = 6,x = -129,y = 340,z = 52,     --(死亡皇后岛)支线麦里森
            },
        },
[18760]={
            {
                mapId = 6,x = -114,y = 345,z = 62,     --(死亡皇后岛)支线艾里1
            },
        },
[18761]={
            {
                mapId = 6,x = -100,y = 349,z = 70,     --(死亡皇后岛)支线艾里2
            },
        },
[18762]={
            {
                mapId = 6,x = -99,y = 349,z = 69,     --(死亡皇后岛)支线财宝箱
            },
        },
[18763]={
            {
                mapId = 6,x = -372,y = 357,z = 234,     --(死亡皇后岛)支线洪赛斯
            },
        },
[13659]={
            {
                mapId = 2,x = -228,y = 337,z = 37,     --(圣域)周常活动 卡蒙
            },
        },
[17797]={
            {
                mapId = 5,x = -5,y = 308,z = -159,     --(遗忘之路)村民甲
            },
        },
[17800]={
            {
                mapId = 5,x = 39,y = 305,z = -195,     --(遗忘之路)村民乙
            },
        },
[16560]={
            {
                mapId = 5,x = 46,y = 312,z = -154,     --(遗忘之路)高龙巴
            },
        },
[20036]={
            {
                mapId = 6,x = 157,y = 345,z = -288,     --(死亡皇后岛)死亡皇后岛矿场奴隶
            },
        },
[20054]={
            {
                mapId = 6,x = -306,y = 365,z = -160,     --(死亡皇后岛)死亡皇后岛挑战候补生
            },
        },
[14633]={
            {
                mapId = 6,x = -132,y = 365,z = -144,     --(死亡皇后岛)死亡皇后岛军需官
            },
        },
[14632]={
            {
                mapId = 5,x = -1,y = 308,z = -164,     --(遗忘之路)遗忘之路军需官
            },
        },
[20242]={
            {
                mapId = 5,x = 21,y = 305,z = -193,     --(遗忘之路)遗忘之村邮箱
            },
            {
                mapId = 5,x = 209,y = 340,z = 1,     --(遗忘之路)索罗大宅邮箱
            },
        },
[20831]={
            {
                mapId = 5,x = 3,y = 308,z = -155,     --(遗忘之路)遗忘之村仓库
            },
            {
                mapId = 5,x = 238,y = 340,z = 32,     --(遗忘之路)索罗大宅仓库
            },
        },
[20832]={
            {
                mapId = 5,x = 2,y = 308,z = -153,     --(遗忘之路)遗忘村面包商人
            },
            {
                mapId = 5,x = 236,y = 340,z = 36,     --(遗忘之路)索罗大宅面包商人
            },
            {
                mapId = 5,x = -27,y = 315,z = 132,     --(遗忘之路)海滩补给商人
            },
            {
                mapId = 5,x = -101,y = 289,z = -385,     --(遗忘之路)营地补给商人
            },
            {
                mapId = 5,x = 224,y = 381,z = -265,     --(遗忘之路)无名神殿补给商人
            },
        },
[20834]={
            {
                mapId = 5,x = 2,y = 308,z = -158,     --(遗忘之路)遗忘村药剂商人
            },
            {
                mapId = 5,x = 236,y = 340,z = 27,     --(遗忘之路)索罗大宅药剂商人
            },
            {
                mapId = 5,x = -27,y = 315,z = 132,     --(遗忘之路)海滩补给商人
            },
            {
                mapId = 5,x = -101,y = 289,z = -385,     --(遗忘之路)营地补给商人
            },
            {
                mapId = 5,x = 224,y = 381,z = -265,     --(遗忘之路)无名神殿补给商人
            },
        },
[20833]={
            {
                mapId = 5,x = 53,y = 309,z = -190,     --(遗忘之路)遗忘村装备售卖
            },
            {
                mapId = 5,x = 227,y = 340,z = 23,     --(遗忘之路)索罗大宅装备售卖
            },
        },
[20243]={
            {
                mapId = 5,x = 227,y = 340,z = 40,     --(遗忘之路)索罗大宅装备聚能师
            },
        },
[20298]={
            {
                mapId = 5,x = 207,y = 343,z = 71,     --(遗忘之路)支线朱利安管家
            },
        },
[20293]={
            {
                mapId = 6,x = -154,y = 365,z = -168,     --(死亡皇后岛)皇后岛装备服务
            },
        },
[20641]={
            {
                mapId = 6,x = -156,y = 365,z = -162,     --(死亡皇后岛)淘金者之村仓库
            },
            {
                mapId = 6,x = -412,y = 383,z = 74,     --(死亡皇后岛)塔瓦娜移民仓库
            },
        },
[20835]={
            {
                mapId = 6,x = -126,y = 365,z = -119,     --(死亡皇后岛)淘金者之村面包商人
            },
            {
                mapId = 6,x = -410,y = 383,z = 63,     --(死亡皇后岛)皇后岛塔瓦娜补给点
            },
            {
                mapId = 6,x = 190,y = 336,z = -356,     --(死亡皇后岛)皇后岛平原入口补给点
            },
            {
                mapId = 6,x = 135,y = 325,z = 0,     --(死亡皇后岛)皇后岛火山入口补给点
            },
            {
                mapId = 6,x = -323,y = 363,z = -154,     --(死亡皇后岛)皇后岛学员据点补给点
            },
            {
                mapId = 6,x = 62,y = 363,z = -355,     --(死亡皇后岛)皇后岛淘金平原补给点
            },
        },
[20836]={
            {
                mapId = 6,x = -122,y = 365,z = -120,     --(死亡皇后岛)淘金者之村药品售卖
            },
            {
                mapId = 6,x = -410,y = 383,z = 63,     --(死亡皇后岛)皇后岛塔瓦娜补给点
            },
            {
                mapId = 6,x = 190,y = 336,z = -356,     --(死亡皇后岛)皇后岛平原入口补给点
            },
            {
                mapId = 6,x = 135,y = 325,z = 0,     --(死亡皇后岛)皇后岛火山入口补给点
            },
            {
                mapId = 6,x = -323,y = 363,z = -154,     --(死亡皇后岛)皇后岛学员据点补给点
            },
            {
                mapId = 6,x = 62,y = 363,z = -355,     --(死亡皇后岛)皇后岛淘金平原补给点
            },
        },
[20640]={
            {
                mapId = 6,x = -154,y = 365,z = -146,     --(死亡皇后岛)皇后岛淘金者之村装备修理售卖
            },
            {
                mapId = 6,x = -400,y = 382,z = 71,     --(死亡皇后岛)皇后岛塔瓦娜遗迹装备修理售卖
            },
        },
[20292]={
            {
                mapId = 6,x = -151,y = 365,z = -126,     --(死亡皇后岛)皇后岛淘金者村邮箱
            },
            {
                mapId = 6,x = -393,y = 381,z = 57,     --(死亡皇后岛)皇后岛塔瓦娜遗迹邮箱
            },
        },
[19884]={
            {
                mapId = 2,x = -236,y = 337,z = 73,     --(个人库)雅典娜的试炼者
            },
        },
[20069]={
            {
                mapId = 2,x = -183,y = 339,z = 411,     --(圣域)时空大使
            },
        },
[20308]={
            {
                mapId = 2,x = -195,y = 337,z = 33,     --(圣域)幸运星大使
            },
        },
[20313]={
            {
                mapId = 2,x = -239,y = 350,z = 306,     --(圣域)鲁大师的西弗勒斯
            },
        },
[20091]={
            {
                mapId = 2,x = -166,y = 339,z = 368,     --(圣域)娄悦裁判
            },
        },
[16359]={
            {
                mapId = 2,x = -113,y = 323,z = 97,     --(圣域)坐骑商人
            },
        },
[16357]={
            {
                mapId = 501,x = 193,y = 311,z = 229,     --(阿提卡遗迹)蓝方军官
            },
        },
[16356]={
            {
                mapId = 501,x = -20,y = 299,z = -274,     --(阿提卡遗迹)红方军官
            },
        },
[10927]={
            {
                mapId = 3,x = -235,y = 320,z = -94,     --(庐山)被拷问圣域密探
            },
        },
[20415]={
            {
                mapId = 3,x = -140,y = 314,z = -185,     --(庐山)支线宠物指引敏儿
            },
        },
[17366]={
            {
                mapId = 5,x = -5,y = 307,z = -191,     --(遗忘之路)火焰
            },
        },
[20241]={
            {
                mapId = 5,x = 236,y = 340,z = 27,     --(遗忘之路)药剂师珍妮
            },
        },
[20235]={
            {
                mapId = 5,x = 237,y = 340,z = 32,     --(遗忘之路)仓库管理员法尔范
            },
        },
[13392]={
            {
                mapId = 2,x = -206,y = 337,z = 97,     --(圣域)祭祀学徒
            },
        },
[10279]={
            {
                mapId = 3,x = -295,y = 322,z = -86,     --(庐山)鬼鬼祟祟的人
            },
        },
[9850]={
            {
                mapId = 3,x = -86,y = 334,z = -106,     --(庐山)异化李云
            },
        },
[15370]={
            {
                mapId = 3,x = -138,y = 404,z = 222,     --(庐山)紫龙福地
            },
        },
[13589]={
            {
                mapId = 3,x = -185,y = 484,z = 265,     --(庐山)天池明美
            },
        },
[16117]={
            {
                mapId = 2,x = -248,y = 341,z = 52,     --(圣域)艾玛
            },
        },
[20575]={
            {
                mapId = 3,x = -284,y = 314,z = -270,     --(庐山)宠物指引支线晶晶
            },
        },
[20593]={
            {
                mapId = 2,x = 104,y = 289,z = -140,     --(传送回城功能相关)圣域-失落森林
            },
        },
[20594]={
            {
                mapId = 5,x = -103,y = 288,z = -387,     --(传送回城功能相关)遗忘之路-放逐者营地
            },
        },
[20595]={
            {
                mapId = 5,x = 224,y = 381,z = -266,     --(传送回城功能相关)遗忘之路-无名神殿
            },
        },
[20596]={
            {
                mapId = 5,x = -7,y = 305,z = -184,     --(传送回城功能相关)遗忘之路-遗忘之村
            },
        },
[20597]={
            {
                mapId = 5,x = -132,y = 339,z = 89,     --(传送回城功能相关)遗忘之路-波塞冬平原
            },
        },
[20598]={
            {
                mapId = 5,x = 188,y = 340,z = 36,     --(传送回城功能相关)遗忘之路-索罗大宅
            },
        },
[20599]={
            {
                mapId = 5,x = -82,y = 310,z = 194,     --(传送回城功能相关)遗忘之路-西方沙滩
            },
        },
[20600]={
            {
                mapId = 6,x = 300,y = 318,z = -373,     --(传送回城功能相关)死亡皇后岛-海望沙滩
            },
        },
[20601]={
            {
                mapId = 6,x = 62,y = 362,z = -358,     --(传送回城功能相关)死亡皇后岛-乱石林
            },
        },
[20602]={
            {
                mapId = 6,x = -98,y = 364,z = -128,     --(传送回城功能相关)死亡皇后岛-淘金者之村
            },
        },
[20603]={
            {
                mapId = 6,x = -317,y = 363,z = -156,     --(传送回城功能相关)死亡皇后岛-熔金营地
            },
        },
[20604]={
            {
                mapId = 6,x = -394,y = 381,z = 47,     --(传送回城功能相关)死亡皇后岛-塔瓦娜遗迹
            },
        },
[20605]={
            {
                mapId = 6,x = 138,y = 324,z = -1,     --(传送回城功能相关)死亡皇后岛-沉眠火山
            },
        },
[20585]={
            {
                mapId = 5,x = -105,y = 288,z = -387,     --(传送回城功能相关)遗忘之路-放逐者营地回城点
            },
        },
[20586]={
            {
                mapId = 5,x = -9,y = 305,z = -181,     --(传送回城功能相关)遗忘之路-遗忘之村回城点
            },
        },
[20587]={
            {
                mapId = 5,x = 188,y = 340,z = 27,     --(传送回城功能相关)遗忘之路-索罗大宅回城点
            },
        },
[20588]={
            {
                mapId = 5,x = -134,y = 339,z = 84,     --(传送回城功能相关)遗忘之路-波塞冬平原回城点
            },
        },
[20589]={
            {
                mapId = 6,x = 299,y = 318,z = -377,     --(传送回城功能相关)死亡皇后岛-海望沙滩回城点
            },
        },
[20590]={
            {
                mapId = 6,x = -99,y = 364,z = -124,     --(传送回城功能相关)死亡皇后岛-淘金者之村回城点
            },
        },
[20591]={
            {
                mapId = 6,x = -391,y = 380,z = 43,     --(传送回城功能相关)死亡皇后岛-塔瓦娜遗迹回城点
            },
        },
[20592]={
            {
                mapId = 6,x = 136,y = 324,z = -1,     --(传送回城功能相关)死亡皇后岛-沉眠火山回城点
            },
        },
[19885]={
            {
                mapId = 5,x = -125,y = 289,z = -406,     --(个人库)峡谷监视人
            },
        },
[19886]={
            {
                mapId = 3,x = 143,y = 462,z = 331,     --(个人库)遗迹监视人
            },
        },
[19887]={
            {
                mapId = 4,x = 376,y = 301,z = -122,     --(个人库)树海监视人
            },
        },
[19888]={
            {
                mapId = 5,x = 205,y = 312,z = -385,     --(个人库)神殿监视人
            },
        },
[19889]={
            {
                mapId = 4,x = -4,y = 285,z = -37,     --(个人库)石阵监视人
            },
        },
[19890]={
            {
                mapId = 6,x = -228,y = 351,z = -74,     --(个人库)坑道监视人
            },
        },
[19891]={
            {
                mapId = 6,x = 349,y = 320,z = -334,     --(个人库)沙滩监视人
            },
        },
[19892]={
            {
                mapId = 2,x = 178.93,y = 293.406,z = -392.11,     --(个人库)黄泉之井监视人
            },
        },
[16512]={
            {
                mapId = 5,x = 156,y = 326,z = -368,     --(遗忘之路)熊
            },
        },
[20633]={
            {
                mapId = 6,x = 27,y = 302,z = 105,     --(死亡皇后岛)冰河
            },
        },
[20635]={
            {
                mapId = 6,x = -115,y = 365,z = -123,     --(死亡皇后岛)奴隶主
            },
        },
[20295]={
            {
                mapId = 6,x = -400,y = 382,z = 71,     --(死亡皇后岛)塔瓦娜遗民(装备）
            },
        },
[20287]={
            {
                mapId = 6,x = -410,y = 383,z = 63,     --(死亡皇后岛)塔瓦娜遗民（野外补给）
            },
        },
[20284]={
            {
                mapId = 6,x = -412,y = 383,z = 74,     --(死亡皇后岛)塔瓦娜遗民（仓库）
            },
        },
[20294]={
            {
                mapId = 6,x = -154,y = 365,z = -146,     --(死亡皇后岛)皇后岛淘金者之村装备修理售卖
            },
        },
[20283]={
            {
                mapId = 6,x = -156,y = 365,z = -162,     --(死亡皇后岛)淘金者之村仓库
            },
        },
[20642]={
            {
                mapId = 5,x = -103,y = 288,z = -387,     --(遗忘之路)遗忘之路-放逐者营地传送师
            },
            {
                mapId = 5,x = 224,y = 381,z = -266,     --(遗忘之路)遗忘之路-无名神殿
            },
            {
                mapId = 5,x = -7,y = 305,z = -184,     --(遗忘之路)遗忘之路-遗忘之村
            },
            {
                mapId = 5,x = -132,y = 339,z = 89,     --(遗忘之路)遗忘之路-波塞冬平原
            },
            {
                mapId = 5,x = 188,y = 340,z = 36,     --(遗忘之路)遗忘之路-索罗大宅
            },
            {
                mapId = 5,x = -82,y = 310,z = 194,     --(遗忘之路)遗忘之路-西方沙滩
            },
        },
[20643]={
            {
                mapId = 5,x = -105,y = 288,z = -387,     --(遗忘之路)遗忘之路-放逐者营地回城点
            },
            {
                mapId = 5,x = -9,y = 305,z = -181,     --(遗忘之路)遗忘之路-遗忘之村回城点
            },
            {
                mapId = 5,x = 188,y = 340,z = 27,     --(遗忘之路)遗忘之路-索罗大宅回城点
            },
            {
                mapId = 5,x = -134,y = 339,z = 84,     --(遗忘之路)遗忘之路-波塞冬平原回城点
            },
        },
[20644]={
            {
                mapId = 6,x = 300,y = 318,z = -373,     --(死亡皇后岛)死亡皇后岛-海望沙滩传送师
            },
            {
                mapId = 6,x = 62,y = 362,z = -358,     --(死亡皇后岛)死亡皇后岛-乱石林
            },
            {
                mapId = 6,x = -98,y = 364,z = -128,     --(死亡皇后岛)死亡皇后岛-淘金者之村
            },
            {
                mapId = 6,x = -317,y = 363,z = -156,     --(死亡皇后岛)死亡皇后岛-熔金营地
            },
            {
                mapId = 6,x = -394,y = 381,z = 47,     --(死亡皇后岛)死亡皇后岛-塔瓦娜遗迹
            },
            {
                mapId = 6,x = 138,y = 324,z = -1,     --(死亡皇后岛)死亡皇后岛-沉眠火山传送师
            },
        },
[20645]={
            {
                mapId = 6,x = 299,y = 318,z = -377,     --(死亡皇后岛)死亡皇后岛-海望沙滩回城点
            },
            {
                mapId = 6,x = -99,y = 364,z = -124,     --(死亡皇后岛)死亡皇后岛-淘金者之村回城点
            },
            {
                mapId = 6,x = -391,y = 380,z = 43,     --(死亡皇后岛)死亡皇后岛-塔瓦娜遗迹回城点
            },
            {
                mapId = 6,x = 136,y = 324,z = -1,     --(死亡皇后岛)死亡皇后岛-沉眠火山回城点
            },
        },
[530]={
            {
                mapId = 304,x = 377.184,y = 331.132,z = 320.262,     --(剧本：银河战争)那智最终
            },
        },
[20140]={
            {
                mapId = 2,x = -160,y = 340,z = 368,     --(圣域)大丸子
            },
        },
[11576]={
            {
                mapId = 2,x = -106,y = 322,z = 115,     --(圣域)商业区聚能师
            },
        },
[17281]={
            {
                mapId = 1,x = -426,y = 326,z = 100,     --(新手村)新手村面包商人
            },
        },
[11302]={
            {
                mapId = 1,x = -412,y = 327,z = 136,     --(新手村)城内药水商人
            },
        },
[11565]={
            {
                mapId = 2,x = -111,y = 324,z = 91,     --(圣域)圣域贸易区仓库
            },
        },
[11303]={
            {
                mapId = 2,x = -114,y = 324,z = 52,     --(圣域)商业区药剂师
            },
        },
[17282]={
            {
                mapId = 2,x = -94,y = 322,z = 84,     --(圣域)圣域商业区区面包商人
            },
        },
[11321]={
            {
                mapId = 2,x = -103,y = 322,z = 95,     --(圣域)贸易区铁匠
            },
        },
[13581]={
            {
                mapId = 2,x = -239,y = 350,z = 319,     --(传送回城功能相关)圣域卫城上城回城点
            },
        },
[11575]={
            {
                mapId = 2,x = -116,y = 324,z = 74,     --(圣域)拍卖师商业区
            },
        },
[11579]={
            {
                mapId = 2,x = -91,y = 322,z = 62,     --(圣域)商业区工艺师
            },
        },
[11305]={
            {
                mapId = 3,x = -250,y = 319,z = -68,     --(庐山)城内商人1
            },
        },
[17285]={
            {
                mapId = 3,x = -212,y = 321,z = -155,     --(庐山)庐山面包商人
            },
        },
[13588]={
            {
                mapId = 3,x = -232,y = 319,z = -141,     --(传送回城功能相关)庐山隐龙村回城点
            },
        },
[11566]={
            {
                mapId = 4,x = 180,y = 319,z = 249,     --(银河竞技场)银都镇仓库
            },
        },
[17286]={
            {
                mapId = 4,x = 108,y = 290,z = 329,     --(银河竞技场)银河竞技场面包商人
            },
        },
[11322]={
            {
                mapId = 4,x = 109,y = 290,z = 340,     --(银河竞技场)银都镇铁匠
            },
        },
[11304]={
            {
                mapId = 4,x = 111,y = 290,z = 331,     --(银河竞技场)银都镇商人1
            },
        },
[13585]={
            {
                mapId = 4,x = 236,y = 316,z = 299,     --(传送回城功能相关)银河竞技场银都市回城点
            },
        },
[20234]={
            {
                mapId = 5,x = 3,y = 308,z = -155,     --(遗忘之路)遗忘之村仓库
            },
        },
[20236]={
            {
                mapId = 5,x = 2,y = 308,z = -153,     --(遗忘之路)遗忘村面包商人
            },
        },
[20244]={
            {
                mapId = 5,x = 53,y = 309,z = -190,     --(遗忘之路)遗忘村装备售卖
            },
        },
[20240]={
            {
                mapId = 5,x = 2,y = 308,z = -158,     --(遗忘之路)遗忘村药剂商人
            },
        },
[20285]={
            {
                mapId = 6,x = -126,y = 365,z = -119,     --(死亡皇后岛)淘金者之村面包商人
            },
        },
[20286]={
            {
                mapId = 6,x = -122,y = 365,z = -120,     --(死亡皇后岛)淘金者之村药品售卖
            },
        },
[20856]={
            {
                mapId = 2,x = 92,y = 292,z = 47,     --(圣域)圣域军团相关
            },
        },
[20882]={
            {
                mapId = 2,x = -223,y = 337,z = 103,     --(圣域)圣域尤娜
            },
        },
[20870]={
            {
                mapId = 3,x = -150,y = 483,z = 161,     --(庐山)庐山紫龙保护神龙
            },
        },
[20895]={
            {
                mapId = 6,x = -327,y = 363,z = -153,     --(死亡皇后岛)支线卡耐尔5
            },
        },
[20896]={
            {
                mapId = 6,x = -327,y = 363,z = -153,     --(死亡皇后岛)支线卡耐尔6
            },
        },
[20897]={
            {
                mapId = 6,x = -72,y = 363,z = -40,     --(死亡皇后岛)支线瓦帕特6
            },
        },
[20898]={
            {
                mapId = 6,x = -72,y = 363,z = -40,     --(死亡皇后岛)支线瓦帕特7
            },
        },
[1548]={
            {
                mapId = 3,x = 12,y = 451,z = 313,     --(庐山)支线阿步
            },
        },
[18436]={
            {
                mapId = 302,x = 368,y = 288,z = -353,     --(剧本：黄泉之井)尤莉提斯跳舞
            },
        },
[21041]={
            {
                mapId = 2,x = -79,y = 301,z = 376,     --(新版圣域)雅典娜封印火焰
            },
        },
[20966]={
            {
                mapId = 4,x = 322.36,y = 334.08,z = 352.01,     --(剧本：银河战争大地图版)接待员
            },
        },
[20993]={
            {
                mapId = 4,x = 381.05,y = 331.16,z = 318.02,     --(剧本：银河战争大地图版)那智最终
            },
        },
[15871]={
            {
                mapId = 5,x = -27,y = 315,z = 125,     --(遗忘之路)失聪的船匠
            },
        },
[22694]={
            {
                mapId = 1,x = -138,y = 309,z = -49,     --(传送回城功能相关)群星之地希望沙滩传送师
            },
        },
[21141]={
            {
                mapId = 7,x = -361,y = 296,z = 358,     --(东西伯利亚)主线01码头_船长
            },
        },
[21142]={
            {
                mapId = 7,x = -337,y = 292,z = 371,     --(东西伯利亚)主线02码头_雅科夫1
            },
        },
[21143]={
            {
                mapId = 7,x = -273,y = 292,z = 339,     --(东西伯利亚)主线03科霍提克村_冰河1
            },
        },
[21144]={
            {
                mapId = 7,x = -267,y = 292,z = 321,     --(东西伯利亚)主线04科霍提克村_彼特鲁沙
            },
        },
[21145]={
            {
                mapId = 7,x = -154,y = 297,z = 309,     --(东西伯利亚)主线05修炼地_尼基塔
            },
        },
[21146]={
            {
                mapId = 7,x = -106,y = 307,z = 349,     --(东西伯利亚)主线06修炼地_冰河2
            },
        },
[21147]={
            {
                mapId = 7,x = -145,y = 297,z = 296,     --(东西伯利亚)主线07修炼地_被困的村民
            },
        },
[21148]={
            {
                mapId = 7,x = -237,y = 296,z = 331,     --(东西伯利亚)主线08修炼地训练生导师
            },
        },
[21149]={
            {
                mapId = 7,x = -270,y = 292,z = 323,     --(东西伯利亚)主线09科霍提克村_冰河3
            },
        },
[21150]={
            {
                mapId = 7,x = -255,y = 292,z = 332,     --(东西伯利亚)主线10科霍提克村_圣斗士候补生
            },
        },
[21151]={
            {
                mapId = 7,x = -303,y = 293,z = 261,     --(东西伯利亚)主线11沉船处_冰河4
            },
        },
[21152]={
            {
                mapId = 7,x = -306,y = 297,z = 229,     --(东西伯利亚)主线12黑暗森林_冰河5
            },
        },
[21153]={
            {
                mapId = 7,x = -320,y = 297,z = 196,     --(东西伯利亚)主线13黑暗森林_格里高利
            },
        },
[21154]={
            {
                mapId = 7,x = -360,y = 297,z = 165,     --(东西伯利亚)主线14黑暗森林_瓦基姆
            },
        },
[21155]={
            {
                mapId = 7,x = -288,y = 298,z = 157,     --(东西伯利亚)主线15冰川裂隙_冰河6
            },
        },
[21156]={
            {
                mapId = 7,x = -60,y = 297,z = 227,     --(东西伯利亚)主线16冰川裂隙_冰河7
            },
        },
[21157]={
            {
                mapId = 7,x = -247,y = 310,z = -2,     --(东西伯利亚)主线17雪落村_伯尔曼
            },
        },
[21158]={
            {
                mapId = 7,x = -272,y = 310,z = 0,     --(东西伯利亚)主线18雪落村_冰河8
            },
        },
[21159]={
            {
                mapId = 7,x = -258,y = 310,z = -40,     --(东西伯利亚)主线19雪落村_昏迷的娜塔莎1
            },
        },
[21160]={
            {
                mapId = 7,x = -260,y = 310,z = -14,     --(东西伯利亚)主线20雪落村_昏迷的娜塔莎2
            },
        },
[21161]={
            {
                mapId = 7,x = -260,y = 310,z = -14,     --(东西伯利亚)主线21雪落村_娜塔莎3
            },
        },
[21162]={
            {
                mapId = 7,x = -242,y = 297,z = -221,     --(东西伯利亚)主线22冰点哨塔_冰河9
            },
        },
[21163]={
            {
                mapId = 7,x = -176,y = 316,z = -147,     --(东西伯利亚)主线23冰点哨塔_娜塔莎4
            },
        },
[21164]={
            {
                mapId = 7,     --(东西伯利亚)主线24冰点哨塔_冰河10
            },
        },
[21165]={
            {
                mapId = 7,     --(东西伯利亚)主线25冰点哨塔_亚雷库萨1
            },
        },
[21166]={
            {
                mapId = 7,x = -140,y = 318,z = -138,     --(东西伯利亚)主线26冰点哨塔_艾尔扎克1
            },
        },
[21167]={
            {
                mapId = 7,x = -180,y = 314,z = -165,     --(东西伯利亚)主线27冰点哨塔_诺迪克
            },
        },
[21168]={
            {
                mapId = 7,x = -385,y = 297,z = -277,     --(东西伯利亚)主线28魔鬼礁群_苏兰特1
            },
        },
[21169]={
            {
                mapId = 7,x = -387,y = 296,z = -278,     --(东西伯利亚)主线29魔鬼礁群_朱利安1
            },
        },
[21170]={
            {
                mapId = 7,x = -379,y = 297,z = -277,     --(东西伯利亚)主线30魔鬼礁群_加隆1
            },
        },
[21171]={
            {
                mapId = 7,x = -324,y = 297,z = -284,     --(东西伯利亚)主线31魔鬼礁群_诺曼
            },
        },
[21172]={
            {
                mapId = 7,x = -415,y = 296,z = -340,     --(东西伯利亚)主线32魔鬼礁群_冰河11
            },
        },
[21173]={
            {
                mapId = 7,x = -335,y = 296,z = -289,     --(东西伯利亚)主线33魔鬼礁群_雅科夫2
            },
        },
[21174]={
            {
                mapId = 7,x = -333,y = 296,z = -288,     --(东西伯利亚)主线34魔鬼礁群_冰河12
            },
        },
[21175]={
            {
                mapId = 7,x = -200,y = 297,z = -223,     --(东西伯利亚)主线35大裂隙_冰河13
            },
        },
[21176]={
            {
                mapId = 7,x = -190,y = 297,z = -225,     --(东西伯利亚)主线36大裂隙_古神屏蔽1
            },
        },
[21177]={
            {
                mapId = 7,x = -133,y = 295,z = -259,     --(东西伯利亚)主线37大裂隙_古神屏蔽2
            },
        },
[21178]={
            {
                mapId = 7,x = -41,y = 297,z = -250,     --(东西伯利亚)主线38大裂隙_古神屏蔽3
            },
        },
[21179]={
            {
                mapId = 7,x = 254,y = 377,z = 414,     --(东西伯利亚)主线39大裂隙_古神屏蔽4
            },
        },
[21180]={
            {
                mapId = 7,x = 52,y = 297,z = -274,     --(东西伯利亚)主线40大裂隙_加隆2
            },
        },
[21181]={
            {
                mapId = 7,x = 53,y = 296,z = -278,     --(东西伯利亚)主线41大裂隙_冰河14
            },
        },
[21182]={
            {
                mapId = 7,x = 53,y = 296,z = -278,     --(东西伯利亚)主线42大裂隙_冰河矿装饰
            },
        },
[21183]={
            {
                mapId = 7,x = 266,y = 258,z = -260,     --(东西伯利亚)主线43世界之树_加隆3
            },
        },
[21184]={
            {
                mapId = 7,x = 288,y = 258,z = -262,     --(东西伯利亚)主线44世界之树_奄奄一息的居民
            },
        },
[21185]={
            {
                mapId = 7,x = 264,y = 258,z = -268,     --(东西伯利亚)主线45世界之树_冰河15
            },
        },
[21186]={
            {
                mapId = 7,x = 370,y = 260,z = -400,     --(东西伯利亚)主线46世界之树_北欧长老
            },
        },
[21187]={
            {
                mapId = 7,x = 343,y = 258,z = -429,     --(东西伯利亚)主线47世界之树_战死的勇士
            },
        },
[21188]={
            {
                mapId = 7,x = 372,y = 319,z = -140,     --(东西伯利亚)主线48风息谷_风息谷守卫
            },
        },
[21189]={
            {
                mapId = 7,x = 435,y = 319,z = -69,     --(东西伯利亚)主线49风息谷_瓦尔基里1
            },
        },
[21190]={
            {
                mapId = 7,x = 443,y = 320,z = -77,     --(东西伯利亚)主线50风息谷_北欧族长
            },
        },
[21191]={
            {
                mapId = 7,x = 415,y = 315,z = -75,     --(东西伯利亚)主线51风息谷_冰河16
            },
        },
[21192]={
            {
                mapId = 7,x = 418,y = 315,z = -74,     --(东西伯利亚)主线52风息谷_加隆4
            },
        },
[21193]={
            {
                mapId = 7,x = 448,y = 324,z = -89,     --(东西伯利亚)主线53风息谷_瓦尔基里2
            },
        },
[21194]={
            {
                mapId = 7,x = 423,y = 316,z = -75,     --(东西伯利亚)主线54风息谷_强壮的勇士
            },
        },
[21195]={
            {
                mapId = 7,x = 423,y = 316,z = -75,     --(东西伯利亚)主线55风息谷_受伤的勇士
            },
        },
[21196]={
            {
                mapId = 7,x = 344,y = 328,z = 20,     --(东西伯利亚)主线56暗冰前哨_瓦尔基里3
            },
        },
[21197]={
            {
                mapId = 7,x = 337,y = 328,z = 22,     --(东西伯利亚)主线57暗冰前哨_加隆5
            },
        },
[21198]={
            {
                mapId = 7,x = 324,y = 315,z = 184,     --(东西伯利亚)主线58暗冰前哨_冰河17
            },
        },
[21199]={
            {
                mapId = 7,x = 221,y = 327,z = 107,     --(东西伯利亚)主线59暗冰前哨_撒卡迪
            },
        },
[21200]={
            {
                mapId = 7,x = 241,y = 323,z = 114,     --(东西伯利亚)主线60暗冰前哨_瓦尔基里4
            },
        },
[21201]={
            {
                mapId = 7,x = 148,y = 316,z = 58,     --(东西伯利亚)主线61极光雪原_维达尔
            },
        },
[21202]={
            {
                mapId = 7,x = 148,y = 316,z = 62,     --(东西伯利亚)主线62极光雪原_被俘的极光女斗士
            },
        },
[21203]={
            {
                mapId = 7,x = 153,y = 316,z = 61,     --(东西伯利亚)主线63极光雪原_冰河18
            },
        },
[21204]={
            {
                mapId = 7,x = -10,y = 291,z = 90,     --(东西伯利亚)主线64极光雪原_苏兰特2
            },
        },
[21205]={
            {
                mapId = 7,x = -11,y = 291,z = 88,     --(东西伯利亚)主线65极光雪原_朱利安2
            },
        },
[21206]={
            {
                mapId = 7,x = 35,y = 297,z = 135,     --(东西伯利亚)主线66极光雪原_瓦尔基里5
            },
        },
[21207]={
            {
                mapId = 7,x = 31,y = 296,z = 136,     --(东西伯利亚)主线67极光雪原_冰河19
            },
        },
[21208]={
            {
                mapId = 7,x = 36,y = 296,z = 142,     --(东西伯利亚)主线68极光雪原_艾尔扎克2
            },
        },
[21209]={
            {
                mapId = 7,x = 36,y = 296,z = 142,     --(东西伯利亚)主线69极光雪原_艾尔扎克3
            },
        },
[21210]={
            {
                mapId = 7,x = 78,y = 404,z = 247,     --(东西伯利亚)主线70蓝冰堡_瓦尔基里6
            },
        },
[21211]={
            {
                mapId = 7,x = 145,y = 384,z = 269,     --(东西伯利亚)主线71蓝冰堡_冰河20
            },
        },
[21212]={
            {
                mapId = 7,x = 122,y = 402,z = 298,     --(东西伯利亚)主线72蓝冰堡_冰河21
            },
        },
[21213]={
            {
                mapId = 7,x = 120,y = 402,z = 302,     --(东西伯利亚)主线73蓝冰堡_亚雷库萨2
            },
        },
[21214]={
            {
                mapId = 7,x = 116,y = 402,z = 300,     --(东西伯利亚)主线74蓝冰堡_娜塔莎5
            },
        },
[21215]={
            {
                mapId = 7,x = 201,y = 370,z = 390,     --(东西伯利亚)主线75蓝冰堡_冰河22
            },
        },
[21216]={
            {
                mapId = 7,x = 100,y = 372,z = 335,     --(东西伯利亚)主线76蓝冰堡亚雷库萨3
            },
        },
[21217]={
            {
                mapId = 7,x = 207,y = 370,z = 397,     --(东西伯利亚)主线76蓝冰堡_亚雷库萨4
            },
        },
[21218]={
            {
                mapId = 7,x = 207,y = 370,z = 397,     --(东西伯利亚)主线77蓝冰堡_亚雷库萨5
            },
        },
[21219]={
            {
                mapId = 7,x = 208,y = 370,z = 392,     --(东西伯利亚)主线78蓝冰堡_娜塔莎6
            },
        },
[21220]={
            {
                mapId = 7,x = 186,y = 370,z = 388,     --(东西伯利亚)主线79蓝冰堡_瓦尔基里7
            },
        },
[21221]={
            {
                mapId = 7,x = 290,y = 383,z = 435,     --(东西伯利亚)主线80蓝冰堡_艾尔扎克4
            },
        },
[21222]={
            {
                mapId = 7,x = 291,y = 383,z = 429,     --(东西伯利亚)主线81蓝冰堡_冰河23
            },
        },
[21223]={
            {
                mapId = 7,x = 346,y = 393,z = 462,     --(东西伯利亚)主线82蓝冰堡_加隆6
            },
        },
[21224]={
            {
                mapId = 7,x = 283,y = 381,z = 425,     --(东西伯利亚)主线83蓝冰堡_瓦尔基里8
            },
        },
[21225]={
            {
                mapId = 7,x = 345,y = 395,z = 472,     --(东西伯利亚)主线84蓝冰堡_瓦尔基里9
            },
        },
[21226]={
            {
                mapId = 7,x = 342,y = 395,z = 469,     --(东西伯利亚)主线84蓝冰堡_冰河24
            },
        },
[22677]={
            {
                mapId = 7,x = 243,y = 323,z = 116,     --(东西伯利亚)主线85暗冰前哨_加隆7
            },
        },
[22802]={
            {
                mapId = 7,x = -235,y = 300,z = -208,     --(东西伯利亚)主线86冰点哨塔冰刺
            },
        },
[21978]={
            {
                mapId = 8,x = -374,y = 358,z = -363,     --(亚特兰蒂斯)主线01受伤的船员
            },
        },
[21979]={
            {
                mapId = 8,x = -303,y = 363,z = -323,     --(亚特兰蒂斯)主线02雅弗遇难者沉船
            },
        },
[21980]={
            {
                mapId = 8,x = -260,y = 362,z = -339,     --(亚特兰蒂斯)主线03饥饿的船员
            },
        },
[21981]={
            {
                mapId = 8,x = -261,y = 362,z = -347,     --(亚特兰蒂斯)主线04口渴的船员
            },
        },
[21982]={
            {
                mapId = 8,x = -310,y = 360,z = -365,     --(亚特兰蒂斯)主线05索罗家族船员阿诺
            },
        },
[21983]={
            {
                mapId = 8,x = -363,y = 359,z = -380,     --(亚特兰蒂斯)主线06疯狂的船员
            },
        },
[21984]={
            {
                mapId = 8,x = -303,y = 363,z = -323,     --(亚特兰蒂斯)主线07雅弗海盗入侵后
            },
        },
[21985]={
            {
                mapId = 8,x = -262,y = 340,z = -209,     --(亚特兰蒂斯)主线08雅弗涅柔斯村前
            },
        },
[21986]={
            {
                mapId = 8,x = -279,y = 357,z = -156,     --(亚特兰蒂斯)主线09人鱼守卫涅柔斯村前
            },
        },
[21987]={
            {
                mapId = 8,x = -316,y = 357,z = -104,     --(亚特兰蒂斯)主线10狄蒂斯村中
            },
        },
[21988]={
            {
                mapId = 8,x = -310,y = 357,z = -105,     --(亚特兰蒂斯)主线11人鱼守卫狄蒂斯身边
            },
        },
[21989]={
            {
                mapId = 8,x = -327,y = 367,z = 19,     --(亚特兰蒂斯)主线12族长特里休斯村后小屋
            },
        },
[21990]={
            {
                mapId = 8,x = -336,y = 363,z = -25,     --(亚特兰蒂斯)主线13可疑的村民
            },
        },
[21991]={
            {
                mapId = 8,x = -276,y = 366,z = -79,     --(亚特兰蒂斯)主线14族长特里休斯村中平坡
            },
        },
[21992]={
            {
                mapId = 8,x = -226,y = 377,z = -46,     --(亚特兰蒂斯)主线15族长特里休斯老管家旁
            },
        },
[21993]={
            {
                mapId = 8,x = -243,y = 367,z = -107,     --(亚特兰蒂斯)主线16祭祀涅柔斯之村
            },
        },
[21994]={
            {
                mapId = 8,x = -301,y = 357,z = -107,     --(亚特兰蒂斯)主线17小人鱼躲藏前1
            },
        },
[21995]={
            {
                mapId = 8,x = -304,y = 357,z = -109,     --(亚特兰蒂斯)主线18小人鱼躲藏前2
            },
        },
[21996]={
            {
                mapId = 8,x = -287,y = 357,z = -109,     --(亚特兰蒂斯)主线19小人鱼躲藏前3
            },
        },
[21997]={
            {
                mapId = 8,x = -312,y = 357,z = -87,     --(亚特兰蒂斯)主线20小人鱼躲藏后
            },
        },
[21998]={
            {
                mapId = 8,x = -229,y = 377,z = -48,     --(亚特兰蒂斯)主线21受伤的老管家
            },
        },
[21999]={
            {
                mapId = 8,x = -229,y = 377,z = -48,     --(亚特兰蒂斯)主线22治疗后的老管家
            },
        },
[22000]={
            {
                mapId = 8,x = -243,y = 377,z = -46,     --(亚特兰蒂斯)主线23贵鬼老管家旁
            },
        },
[22001]={
            {
                mapId = 8,x = -253,y = 367,z = -37,     --(亚特兰蒂斯)主线24贵鬼村后出口
            },
        },
[22002]={
            {
                mapId = 8,x = -264,y = 367,z = -32,     --(亚特兰蒂斯)主线25修亚涅柔斯村后
            },
        },
[22003]={
            {
                mapId = 8,x = -234,y = 375,z = 88.14,     --(亚特兰蒂斯)主线26拜安战斗前
            },
        },
[22004]={
            {
                mapId = 8,x = -312,y = 384,z = 93,     --(亚特兰蒂斯)主线27拜安战斗后
            },
        },
[22005]={
            {
                mapId = 8,x = -201,y = 366,z = 107,     --(亚特兰蒂斯)主线28修亚珊瑚林入口
            },
        },
[22006]={
            {
                mapId = 8,x = -143,y = 366,z = 74,     --(亚特兰蒂斯)主线29贪婪的海斗士
            },
        },
[22007]={
            {
                mapId = 8,x = -56,y = 329,z = -186,     --(亚特兰蒂斯)主线30被束缚的涅柔斯村人
            },
        },
[22008]={
            {
                mapId = 8,x = -55,y = 329,z = -190,     --(亚特兰蒂斯)主线31修亚珊瑚林中央
            },
        },
[22009]={
            {
                mapId = 8,x = 77,y = 330,z = -248,     --(亚特兰蒂斯)主线32雅典娜塞壬石林中央
            },
        },
[22010]={
            {
                mapId = 8,x = 75,y = 331,z = -249,     --(亚特兰蒂斯)主线33苏兰特塞壬石林中央
            },
        },
[22011]={
            {
                mapId = 8,x = 67,y = 339,z = -378,     --(亚特兰蒂斯)主线34魔铃圣兽像前
            },
        },
[22012]={
            {
                mapId = 8,x = 78,y = 338,z = -386,     --(亚特兰蒂斯)主线35金牛座圣兽像前
            },
        },
[22013]={
            {
                mapId = 8,x = 75,y = 338,z = -386,     --(亚特兰蒂斯)主线36天蝎座圣兽像前
            },
        },
[22014]={
            {
                mapId = 8,x = 71,y = 338,z = -387,     --(亚特兰蒂斯)主线37狮子座圣兽像前
            },
        },
[22015]={
            {
                mapId = 8,x = 78,y = 338,z = -379,     --(亚特兰蒂斯)主线38修亚圣兽像前
            },
        },
[22016]={
            {
                mapId = 8,x = 169,y = 350,z = -348,     --(亚特兰蒂斯)主线39修亚塞壬石林出口
            },
        },
[22017]={
            {
                mapId = 8,x = 371,y = 387,z = -355,     --(亚特兰蒂斯)主线40修亚海之心外
            },
        },
[22018]={
            {
                mapId = 8,x = 397,y = 391,z = -361,     --(亚特兰蒂斯)主线41修亚海之心内
            },
        },
[22019]={
            {
                mapId = 8,x = 400,y = 391,z = -362,     --(亚特兰蒂斯)主线42假海皇
            },
        },
[22020]={
            {
                mapId = 8,x = 391,y = 391,z = -360,     --(亚特兰蒂斯)主线43海龙海之心
            },
        },
[22021]={
            {
                mapId = 8,x = 395,y = 391,z = -361,     --(亚特兰蒂斯)主线44修亚死去
            },
        },
[22022]={
            {
                mapId = 8,x = 369,y = 387,z = -357,     --(亚特兰蒂斯)主线45星矢海之心
            },
        },
[22023]={
            {
                mapId = 8,x = 369,y = 387,z = -360,     --(亚特兰蒂斯)主线46紫龙海之心
            },
        },
[22026]={
            {
                mapId = 8,x = 352,y = 365,z = -3,     --(亚特兰蒂斯)主线49海龙侍卫秘营
            },
        },
[22027]={
            {
                mapId = 8,x = 445,y = 365,z = 53,     --(亚特兰蒂斯)主线50海龙侍卫秘营贵鬼旁
            },
        },
[22028]={
            {
                mapId = 8,x = 439,y = 367,z = 64,     --(亚特兰蒂斯)主线51贵鬼秘营被困
            },
        },
[22029]={
            {
                mapId = 8,x = 439,y = 367,z = 64,     --(亚特兰蒂斯)主线52贵鬼秘营解脱
            },
        },
[22030]={
            {
                mapId = 8,x = 443,y = 366,z = 57,     --(亚特兰蒂斯)主线53一辉秘营解救贵鬼前
            },
        },
[22031]={
            {
                mapId = 8,x = 443,y = 366,z = 57,     --(亚特兰蒂斯)主线54一辉秘营解救贵鬼后
            },
        },
[22032]={
            {
                mapId = 8,x = 349,y = 345,z = -135,     --(亚特兰蒂斯)主线55星矢秘银前
            },
        },
[22035]={
            {
                mapId = 8,x = 350,y = 344,z = -129,     --(亚特兰蒂斯)主线58瞬秘营前
            },
        },
[22037]={
            {
                mapId = 8,x = 211,y = 400,z = -22,     --(亚特兰蒂斯)主线60星矢城墙前
            },
        },
[22039]={
            {
                mapId = 8,x = 224,y = 400,z = -22,     --(亚特兰蒂斯)主线62冰河城墙前
            },
        },
[22041]={
            {
                mapId = 8,x = 220,y = 400,z = -22,     --(亚特兰蒂斯)主线64贵鬼城墙前
            },
        },
[22042]={
            {
                mapId = 8,x = 159,y = 374,z = -114,     --(亚特兰蒂斯)主线65冰河要塞边
            },
        },
[22047]={
            {
                mapId = 8,x = 220,y = 400,z = 59,     --(亚特兰蒂斯)主线70贵鬼波塞多尼亚入口
            },
        },
[22048]={
            {
                mapId = 8,x = 212,y = 401,z = 31,     --(亚特兰蒂斯)主线71海龙潜藏者波塞多尼亚入口
            },
        },
[22049]={
            {
                mapId = 8,x = 112,y = 405,z = 176,     --(亚特兰蒂斯)主线72海龙潜藏者海豚之心旁
            },
        },
[22050]={
            {
                mapId = 8,x = 26,y = 400,z = 234,     --(亚特兰蒂斯)主线73紫龙城中机关旁
            },
        },
[22051]={
            {
                mapId = 8,x = 30,y = 435,z = 309,     --(亚特兰蒂斯)主线74紫龙城中巨弩旁
            },
        },
[22052]={
            {
                mapId = 8,x = 27,y = 435,z = 329,     --(亚特兰蒂斯)主线75海皇子城中巨弩旁
            },
        },
[22053]={
            {
                mapId = 8,x = 146,y = 447,z = 425,     --(亚特兰蒂斯)主线76海皇子镇守
            },
        },
[22054]={
            {
                mapId = 8,x = 135,y = 447,z = 452,     --(亚特兰蒂斯)主线77海龙潜藏者海皇子旁
            },
        },
[22055]={
            {
                mapId = 8,x = 166,y = 448,z = 472,     --(亚特兰蒂斯)主线78紫龙海皇雕像旁
            },
        },
[22056]={
            {
                mapId = 8,x = 168,y = 448,z = 464,     --(亚特兰蒂斯)主线79贵鬼海皇雕像旁
            },
        },
[22057]={
            {
                mapId = 8,x = 328,y = 405,z = 181,     --(亚特兰蒂斯)主线80冰河被冰封
            },
        },
[22058]={
            {
                mapId = 8,x = 327,y = 405,z = 179,     --(亚特兰蒂斯)主线81瞬保护冰封冰河
            },
        },
[22059]={
            {
                mapId = 8,x = 403,y = 400,z = 161,     --(亚特兰蒂斯)主线82海斗士冰卫首领
            },
        },
[22060]={
            {
                mapId = 8,x = 407,y = 400,z = 159,     --(亚特兰蒂斯)主线83海龙潜藏者被冰封
            },
        },
[22061]={
            {
                mapId = 8,x = 407,y = 400,z = 159,     --(亚特兰蒂斯)主线84海龙潜藏者解脱
            },
        },
[22062]={
            {
                mapId = 8,x = 334,y = 447,z = 421,     --(亚特兰蒂斯)主线85艾尔扎克镇守
            },
        },
[22063]={
            {
                mapId = 8,x = 340,y = 447,z = 420,     --(亚特兰蒂斯)主线86星矢艾尔扎克旁
            },
        },
[22066]={
            {
                mapId = 8,x = 225,y = 400,z = 98,     --(亚特兰蒂斯)主线89冰河收集海豚之心后
            },
        },
[22069]={
            {
                mapId = 8,x = 216,y = 447,z = 283,     --(亚特兰蒂斯)主线92星矢城中大圈
            },
        },
[22074]={
            {
                mapId = 8,x = 220,y = 447,z = 295,     --(亚特兰蒂斯)主线97狄蒂斯城中大圈
            },
        },
[22075]={
            {
                mapId = 8,x = 220,y = 447,z = 315,     --(亚特兰蒂斯)主线98海龙城中大圈
            },
        },
[22076]={
            {
                mapId = 8,x = 219,y = 447,z = 283,     --(亚特兰蒂斯)主线99莎尔娜城中大圈
            },
        },
[22077]={
            {
                mapId = 8,x = 220,y = 455,z = 465,     --(亚特兰蒂斯)主线100贵鬼城中大圈后
            },
        },
[21446]={
            {
                mapId = 7,x = -312,y = 297,z = -278,     --(东西伯利亚)主线87魔鬼礁群_被俘的蓝冰战士
            },
        },
[23493]={
            {
                mapId = 4,x = 203,y = 316,z = 326,     --(银河竞技场)主线美穗
            },
        },
[23494]={
            {
                mapId = 4,x = 355,y = 329,z = 337,     --(银河竞技场)主线辰巳
            },
        },
[23531]={
            {
                mapId = 4,x = 394,y = 306,z = -71,     --(银河竞技场)主线151青木原树海瞬
            },
        },
[22937]={
            {
                mapId = 8,x = 112.216,y = 340.187,z = -348.716,     --(亚特兰蒂斯)主线修亚劝说玩家
            },
        },
[22960]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22961]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22965]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22966]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22970]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22971]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22975]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22976]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22982]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22983]={
            {
                mapId = 2,x = -402,y = 351,z = 285,     --(圣域)职业任务18级莎尔娜
            },
        },
[22962]={
            {
                mapId = 4,x = 336.265,y = 297.104,z = -281.441,     --(银河竞技场)职业任务25级
            },
        },
[22963]={
            {
                mapId = 4,x = 336.265,y = 297.104,z = -281.441,     --(银河竞技场)职业任务25级
            },
        },
[22967]={
            {
                mapId = 4,x = 373.136,y = 315.947,z = -344.342,     --(银河竞技场)职业任务25级
            },
        },
[22968]={
            {
                mapId = 4,x = 373.136,y = 315.947,z = -344.342,     --(银河竞技场)职业任务25级
            },
        },
[22972]={
            {
                mapId = 4,x = 415.144,y = 305.826,z = -83.2069,     --(银河竞技场)职业任务25级
            },
        },
[22973]={
            {
                mapId = 4,x = 415.144,y = 305.826,z = -83.2069,     --(银河竞技场)职业任务25级
            },
        },
[22977]={
            {
                mapId = 4,x = 317.74,y = 306.581,z = -148.576,     --(银河竞技场)职业任务25级
            },
        },
[22980]={
            {
                mapId = 4,x = 317.74,y = 306.581,z = -148.576,     --(银河竞技场)职业任务25级
            },
        },
[22984]={
            {
                mapId = 4,x = 196.008,y = 310.264,z = -127.68,     --(银河竞技场)职业任务25级
            },
        },
[22985]={
            {
                mapId = 4,x = 196.008,y = 310.264,z = -127.68,     --(银河竞技场)职业任务25级
            },
        },
[22955]={
            {
                mapId = 2,x = -278,y = 343.5,z = 220,     --(圣域)守护星大使
            },
        },
[22956]={
            {
                mapId = 2,x = -280,y = 343.5,z = 220,     --(圣域)守护星军需官
            },
        },
[22959]={
            {
                mapId = 2,x = -401.525,y = 350.507,z = 284.893,     --(圣域)职业任务18级莎尔娜
            },
        },
[22964]={
            {
                mapId = 2,x = -401.525,y = 350.507,z = 284.893,     --(圣域)职业任务18级莎尔娜
            },
        },
[22969]={
            {
                mapId = 2,x = -401.525,y = 350.507,z = 284.893,     --(圣域)职业任务18级莎尔娜
            },
        },
[22974]={
            {
                mapId = 2,x = -401.525,y = 350.507,z = 284.893,     --(圣域)职业任务18级莎尔娜
            },
        },
[22981]={
            {
                mapId = 2,x = -401.525,y = 350.507,z = 284.893,     --(圣域)职业任务18级莎尔娜
            },
        },
[23307]={
            {
                mapId = 7,x = -400,y = 297,z = -321,     --(东西伯利亚)主线87魔鬼礁群_被俘的蓝冰战士
            },
        },
[22447]={
            {
                mapId = 7,x = -322.901,y = 293.214,z = 376.951,     --(东西伯利亚)支线01霍科提克村_约纳斯1
            },
        },
[22448]={
            {
                mapId = 7,x = -302.778,y = 292.823,z = 374.141,     --(东西伯利亚)支线02霍科提克村_约纳斯2
            },
        },
[22449]={
            {
                mapId = 7,x = -297.88,y = 292.395,z = 340.907,     --(东西伯利亚)支线03修炼地_冰河1
            },
        },
[22450]={
            {
                mapId = 7,x = -272.351,y = 297.529,z = 252.115,     --(东西伯利亚)支线04修炼地_冰河2
            },
        },
[22451]={
            {
                mapId = 7,x = -346.961,y = 291.832,z = 349.44,     --(东西伯利亚)支线05沉船处_神秘人1
            },
        },
[22452]={
            {
                mapId = 7,x = -339.02,y = 297.677,z = 194.163,     --(东西伯利亚)支线06黑暗森林_神秘人2
            },
        },
[22453]={
            {
                mapId = 7,x = -327.123,y = 298.12,z = -249.536,     --(东西伯利亚)支线07魔鬼礁群_神秘人3
            },
        },
[22454]={
            {
                mapId = 7,x = -161.741,y = 300.397,z = 142.301,     --(东西伯利亚)支线08永久冰壁_费恩1
            },
        },
[22455]={
            {
                mapId = 7,x = -244.198,y = 305.599,z = 37.4217,     --(东西伯利亚)支线09雪落村_米娅1
            },
        },
[22456]={
            {
                mapId = 7,x = -249.329,y = 309.764,z = -26.7197,     --(东西伯利亚)支线10雪落村_安德烈1
            },
        },
[22457]={
            {
                mapId = 7,x = -297.989,y = 305.421,z = -71.772,     --(东西伯利亚)支线11雪落村_安德烈2
            },
        },
[22458]={
            {
                mapId = 7,x = -297.989,y = 305.421,z = -71.772,     --(东西伯利亚)支线12雪落村_安德烈3
            },
        },
[22459]={
            {
                mapId = 7,x = -181.323,y = 298.027,z = 128.183,     --(东西伯利亚)支线13冰点哨塔_普鲁登斯1
            },
        },
[22460]={
            {
                mapId = 7,x = -320.726,y = 305.698,z = 40.6768,     --(东西伯利亚)支线14冰点哨塔_山姆1
            },
        },
[22461]={
            {
                mapId = 7,x = -281.544,y = 305.609,z = 46.7649,     --(东西伯利亚)支线15冰点哨塔_保罗1
            },
        },
[22462]={
            {
                mapId = 7,x = -207.754,y = 305.538,z = 6.54707,     --(东西伯利亚)支线16雪落村_娜塔莎1
            },
        },
[22463]={
            {
                mapId = 7,x = -241.382,y = 302.001,z = 116.497,     --(东西伯利亚)支线17冰点哨塔_尼科拉斯1
            },
        },
[22464]={
            {
                mapId = 7,x = -241.382,y = 302.001,z = 116.497,     --(东西伯利亚)支线18冰点哨塔_尼科拉斯2
            },
        },
[22465]={
            {
                mapId = 7,x = -195.475,y = 312.477,z = -159.624,     --(东西伯利亚)支线19冰点哨塔_华服男子1
            },
        },
[22466]={
            {
                mapId = 7,x = -207.907,y = 298.022,z = -236.412,     --(东西伯利亚)支线20冰点哨塔_华服男子2
            },
        },
[22467]={
            {
                mapId = 7,x = -340.486,y = 297.558,z = -190.513,     --(东西伯利亚)支线21冰点哨塔_华服男子3
            },
        },
[22468]={
            {
                mapId = 7,x = -14.5079,y = 292.959,z = -3.28715,     --(东西伯利亚)支线22蓝冰堡_华服男子4
            },
        },
[22469]={
            {
                mapId = 7,x = 55.3403,y = 370.197,z = 346.166,     --(东西伯利亚)支线23蓝冰堡_华服男子5
            },
        },
[22470]={
            {
                mapId = 7,x = 107.899,y = 370.397,z = 386.317,     --(东西伯利亚)支线24蓝冰堡_华服男子6
            },
        },
[22471]={
            {
                mapId = 7,x = 237.229,y = 378.302,z = 435.152,     --(东西伯利亚)支线25蓝冰堡_华服男子7
            },
        },
[22472]={
            {
                mapId = 7,x = -289.527,y = 299.445,z = -264.348,     --(东西伯利亚)支线26魔鬼礁群_菲利普1
            },
        },
[22473]={
            {
                mapId = 7,x = -335.613,y = 296.771,z = -281.362,     --(东西伯利亚)支线27魔鬼礁群_海斗士1
            },
        },
[22474]={
            {
                mapId = 7,x = -392.862,y = 297.51,z = -278.301,     --(东西伯利亚)支线28魔鬼礁群_大卫1
            },
        },
[22475]={
            {
                mapId = 7,x = -398.112,y = 297.099,z = -305.869,     --(东西伯利亚)支线29魔鬼礁群_奥德1
            },
        },
[22476]={
            {
                mapId = 7,x = -398.112,y = 297.099,z = -305.869,     --(东西伯利亚)支线30魔鬼礁群_奥德2
            },
        },
[22477]={
            {
                mapId = 7,x = -407.13,y = 296.786,z = -343.894,     --(东西伯利亚)支线31魔鬼礁群_莫妮卡1
            },
        },
[22478]={
            {
                mapId = 7,x = -310.493,y = 297.883,z = -266.096,     --(东西伯利亚)支线32魔鬼礁群_卡莫1
            },
        },
[22479]={
            {
                mapId = 7,x = -310.493,y = 297.883,z = -266.096,     --(东西伯利亚)支线33魔鬼礁群_卡莫2
            },
        },
[22480]={
            {
                mapId = 7,x = 297.401,y = 259.652,z = -259.196,     --(东西伯利亚)支线34世界之树_卢卡斯1
            },
        },
[22481]={
            {
                mapId = 7,x = 297.401,y = 259.652,z = -259.196,     --(东西伯利亚)支线35世界之树_卢卡斯2
            },
        },
[22482]={
            {
                mapId = 7,x = 397.124,y = 260.746,z = -376.147,     --(东西伯利亚)支线36世界之树_卢卡斯3
            },
        },
[22483]={
            {
                mapId = 7,x = 314.341,y = 257.991,z = -357.163,     --(东西伯利亚)支线37世界之树_布鲁克1
            },
        },
[22484]={
            {
                mapId = 7,x = 314.341,y = 257.991,z = -357.163,     --(东西伯利亚)支线38世界之树_布鲁克2
            },
        },
[22485]={
            {
                mapId = 7,x = 424.279,y = 257.812,z = -313.139,     --(东西伯利亚)支线39世界之树_帕赛1
            },
        },
[22486]={
            {
                mapId = 7,x = 364.578,y = 318.836,z = -139.932,     --(东西伯利亚)支线40世界之树_帕赛2
            },
        },
[22487]={
            {
                mapId = 7,x = 441.512,y = 319.547,z = -73.0468,     --(东西伯利亚)支线41风息谷_罗尔1
            },
        },
[22488]={
            {
                mapId = 7,x = 388.446,y = 320.539,z = -69.3086,     --(东西伯利亚)支线42风息谷_罗尔2
            },
        },
[22489]={
            {
                mapId = 7,x = 386.028,y = 320.796,z = -64.7534,     --(东西伯利亚)支线43风息谷_石碑1
            },
        },
[22490]={
            {
                mapId = 7,x = 439.404,y = 325.417,z = -99.5201,     --(东西伯利亚)支线44风息谷_奥丁神魂1
            },
        },
[22491]={
            {
                mapId = 7,x = 334.474,y = 328.444,z = 33.9107,     --(东西伯利亚)支线45暗冰前哨_穆德1
            },
        },
[22492]={
            {
                mapId = 7,x = 137.915,y = 315.292,z = 63.9862,     --(东西伯利亚)支线46极光雪原_穆德2
            },
        },
[22493]={
            {
                mapId = 7,x = 348.538,y = 328.344,z = 29.9443,     --(东西伯利亚)支线47暗冰前哨_暗冰斗士
            },
        },
[22494]={
            {
                mapId = 7,x = 316.415,y = 318.586,z = 156.51,     --(东西伯利亚)支线48暗冰前哨_达拉丁1
            },
        },
[22495]={
            {
                mapId = 7,x = 271.044,y = 316.18,z = 307.876,     --(东西伯利亚)支线49暗冰前哨_达拉丁2
            },
        },
[22496]={
            {
                mapId = 7,x = 45.9115,y = 298.314,z = 80.898,     --(东西伯利亚)支线50极光雪原_法尔泰1
            },
        },
[22497]={
            {
                mapId = 7,x = -62.3064,y = 292.131,z = 52.4565,     --(东西伯利亚)支线51极光雪原_法尔泰2
            },
        },
[22498]={
            {
                mapId = 7,x = 75.2223,y = 404.596,z = 255.777,     --(东西伯利亚)支线52蓝冰堡_法尔泰3
            },
        },
[22499]={
            {
                mapId = 7,x = 115.919,y = 293.495,z = -66.545,     --(东西伯利亚)支线53极光雪原_隐者1
            },
        },
[22500]={
            {
                mapId = 7,x = 115.919,y = 293.495,z = -66.545,     --(东西伯利亚)支线54极光雪原_隐者2
            },
        },
[22501]={
            {
                mapId = 7,x = 207.122,y = 386.636,z = 294.06,     --(东西伯利亚)支线55蓝冰堡_隐者3
            },
        },
[22502]={
            {
                mapId = 7,x = 129.831,y = 383.942,z = 260.239,     --(东西伯利亚)支线56蓝冰堡_隐者4
            },
        },
[22503]={
            {
                mapId = 7,x = 232.711,y = 378.272,z = 441.064,     --(东西伯利亚)支线57蓝冰堡_加隆1
            },
        },
[22921]={
            {
                mapId = 7,x = 201.836,y = 387.038,z = 299.36,     --(东西伯利亚)支线58蓝冰堡_华服男子8
            },
        },
[25136]={
            {
                mapId = 2,x = 3,y = 288,z = -107,     --(库任务)库任务_阿特洛波斯
            },
        },
[23679]={
            {
                mapId = 7,x = -271,y = 292,z = 320,     --(东西伯利亚)科霍提克村仓库
            },
            {
                mapId = 7,x = -275,y = 310,z = -33,     --(东西伯利亚)雪落村仓库
            },
        },
[23686]={
            {
                mapId = 7,x = -240,y = 297,z = 314,     --(东西伯利亚)科霍提克村锻造师
            },
            {
                mapId = 7,x = -223,y = 306,z = 24,     --(东西伯利亚)雪落村锻造师
            },
        },
[23682]={
            {
                mapId = 7,x = -255,y = 293,z = 348,     --(东西伯利亚)科霍提克村面包商人
            },
            {
                mapId = 7,x = -206,y = 306,z = -30,     --(东西伯利亚)雪落村面包商人
            },
            {
                mapId = 7,x = 444,y = 325,z = -93,     --(东西伯利亚)风息谷面包商人
            },
            {
                mapId = 7,x = -390,y = 297,z = -277,     --(东西伯利亚)西伯利亚魔鬼礁群补给点
            },
            {
                mapId = 7,x = 368,y = 262,z = -390,     --(东西伯利亚)西伯利亚世界之树补给点
            },
            {
                mapId = 7,x = 78,y = 405,z = 254,     --(东西伯利亚)西伯利亚蓝冰堡补给点
            },
            {
                mapId = 7,x = -22,y = 291,z = 23,     --(东西伯利亚)西伯利亚极光雪原补给点
            },
        },
[23684]={
            {
                mapId = 7,x = -281,y = 292,z = 345,     --(东西伯利亚)科霍提克村药水商人
            },
            {
                mapId = 7,x = -206,y = 306,z = -2,     --(东西伯利亚)雪落村药水商人
            },
            {
                mapId = 7,x = 444,y = 325,z = -93,     --(东西伯利亚)风息谷补给点
            },
            {
                mapId = 7,x = -390,y = 297,z = -277,     --(东西伯利亚)西伯利亚魔鬼礁群补给点
            },
            {
                mapId = 7,x = 368,y = 262,z = -390,     --(东西伯利亚)西伯利亚世界之树补给点
            },
            {
                mapId = 7,x = 78,y = 405,z = 254,     --(东西伯利亚)西伯利亚蓝冰堡补给点
            },
            {
                mapId = 7,x = -22,y = 291,z = 23,     --(东西伯利亚)西伯利亚极光雪原补给点
            },
        },
[25219]={
            {
                mapId = 8,x = -294,y = 357,z = -94,     --(亚特兰蒂斯)涅柔丝之村仓库
            },
            {
                mapId = 8,x = 356,y = 365,z = 2,     --(亚特兰蒂斯)秘营仓库
            },
        },
[25222]={
            {
                mapId = 8,x = -236,y = 369,z = -106,     --(亚特兰蒂斯)涅柔丝之村面包商人
            },
            {
                mapId = 8,x = 358,y = 365,z = 4,     --(亚特兰蒂斯)秘密营地补给点
            },
            {
                mapId = 8,x = -39,y = 329,z = -155,     --(亚特兰蒂斯)珊瑚林补给点
            },
            {
                mapId = 8,x = 194,y = 400,z = 57,     --(亚特兰蒂斯)波塞多尼亚补给点
            },
            {
                mapId = 8,x = 365,y = 387,z = -374,     --(亚特兰蒂斯)海洋之心补给点
            },
            {
                mapId = 8,x = 104,y = 338,z = -367,     --(亚特兰蒂斯)塞壬石林补给点
            },
            {
                mapId = 8,x = 201,y = 352,z = -237,     --(亚特兰蒂斯)圣兽森林补给点
            },
        },
[25223]={
            {
                mapId = 8,x = -224,y = 377,z = -71,     --(亚特兰蒂斯)涅柔丝之村药水商人
            },
            {
                mapId = 8,x = 358,y = 365,z = 4,     --(亚特兰蒂斯)秘密营地补给点
            },
            {
                mapId = 8,x = -39,y = 329,z = -155,     --(亚特兰蒂斯)珊瑚林补给点
            },
            {
                mapId = 8,x = 194,y = 400,z = 57,     --(亚特兰蒂斯)波塞多尼亚补给点
            },
            {
                mapId = 8,x = 365,y = 387,z = -374,     --(亚特兰蒂斯)海洋之心补给点
            },
            {
                mapId = 8,x = 104,y = 338,z = -367,     --(亚特兰蒂斯)塞壬石林补给点
            },
            {
                mapId = 8,x = 201,y = 352,z = -237,     --(亚特兰蒂斯)圣兽森林补给点
            },
        },
[23685]={
            {
                mapId = 7,x = -269,y = 292,z = 317,     --(东西伯利亚)科霍提克村邮箱
            },
            {
                mapId = 7,x = -241,y = 306,z = 53,     --(东西伯利亚)雪落村邮箱
            },
            {
                mapId = 7,x = 409,y = 316,z = -70,     --(东西伯利亚)风息谷邮箱
            },
        },
[23689]={
            {
                mapId = 7,x = -283,y = 310,z = -9,     --(东西伯利亚)东西伯利亚装备聚能
            },
        },
[25224]={
            {
                mapId = 8,x = -296,y = 357,z = -95,     --(亚特兰蒂斯)涅柔丝村邮箱
            },
            {
                mapId = 8,x = 354,y = 365,z = -1,     --(亚特兰蒂斯)秘密营地邮箱
            },
        },
[25064]={
            {
                mapId = 8,x = -275,y = 367,z = -93,     --(亚特兰蒂斯)亚特兰蒂斯装备聚能
            },
        },
[23657]={
            {
                mapId = 6,x = -418.068,y = 368.343,z = 159.294,     --(侍从任务)宠物01侍从总管
            },
        },
[23658]={
            {
                mapId = 6,x = -417.968,y = 368.343,z = 151.094,     --(侍从任务)宠物02侍从地
            },
        },
[23659]={
            {
                mapId = 6,x = -409.616,y = 368.343,z = 158.083,     --(侍从任务)宠物03侍从水
            },
        },
[23660]={
            {
                mapId = 6,x = -426.284,y = 368.343,z = 157.617,     --(侍从任务)宠物04侍从火
            },
        },
[23661]={
            {
                mapId = 6,x = -413.173,y = 368.343,z = 165.908,     --(侍从任务)宠物05侍从风
            },
        },
[23662]={
            {
                mapId = 6,x = -423.204,y = 368.343,z = 165.623,     --(侍从任务)宠物06侍从雷
            },
        },
[23309]={
            {
                mapId = 8,x = -267.521,y = 361.899,z = -346.5,     --(亚特兰蒂斯)亚特兰蒂斯支线01海难者
            },
        },
[23310]={
            {
                mapId = 8,x = -225.089,y = 346.478,z = -234.441,     --(亚特兰蒂斯)亚特兰蒂斯支线02尼摩船长1
            },
        },
[23311]={
            {
                mapId = 8,x = -230.971,y = 376.947,z = -62.6216,     --(亚特兰蒂斯)亚特兰蒂斯支线03尼摩船长2
            },
        },
[23312]={
            {
                mapId = 8,x = 161.447,y = 373.763,z = -79.0679,     --(亚特兰蒂斯)亚特兰蒂斯支线04尼摩船长3
            },
        },
[23313]={
            {
                mapId = 8,x = -241.926,y = 366.676,z = -113.124,     --(亚特兰蒂斯)亚特兰蒂斯支线05大长老
            },
        },
[23314]={
            {
                mapId = 8,x = -265.888,y = 340.408,z = -207.652,     --(亚特兰蒂斯)亚特兰蒂斯支线06涅柔斯密探
            },
        },
[23315]={
            {
                mapId = 8,x = -26.2923,y = 328.785,z = -97.3267,     --(亚特兰蒂斯)亚特兰蒂斯支线07阿龙纳斯
            },
        },
[23316]={
            {
                mapId = 8,x = -27.4889,y = 329.382,z = -84.3784,     --(亚特兰蒂斯)亚特兰蒂斯支线08康塞尔
            },
        },
[23317]={
            {
                mapId = 8,x = -63.1606,y = 330.83,z = -114.529,     --(亚特兰蒂斯)亚特兰蒂斯支线09尼德·兰
            },
        },
[23318]={
            {
                mapId = 8,x = -46.6787,y = 330.614,z = -290.614,     --(亚特兰蒂斯)亚特兰蒂斯支线10鲸鱼老人
            },
        },
[23319]={
            {
                mapId = 8,x = -237.579,y = 341.018,z = -251.963,     --(亚特兰蒂斯)亚特兰蒂斯支线11死去的海盗
            },
        },
[23320]={
            {
                mapId = 8,x = -312.193,y = 340.388,z = -211.099,     --(亚特兰蒂斯)亚特兰蒂斯支线12海盗头子1
            },
        },
[23321]={
            {
                mapId = 8,x = -312.093,y = 340.388,z = -210.999,     --(亚特兰蒂斯)亚特兰蒂斯支线13海盗头子2
            },
        },
[23322]={
            {
                mapId = 8,x = -251.241,y = 341.408,z = -245.22,     --(亚特兰蒂斯)亚特兰蒂斯支线14遇难少女1
            },
        },
[23323]={
            {
                mapId = 8,x = -275.896,y = 341.883,z = -230.026,     --(亚特兰蒂斯)亚特兰蒂斯支线15遇难少女2
            },
        },
[23324]={
            {
                mapId = 8,x = -282.109,y = 342.437,z = -233.067,     --(亚特兰蒂斯)亚特兰蒂斯支线16皮克斯1
            },
        },
[23325]={
            {
                mapId = 8,x = -282.009,y = 342.437,z = -232.967,     --(亚特兰蒂斯)亚特兰蒂斯支线17皮克斯2
            },
        },
[23326]={
            {
                mapId = 8,x = -280.164,y = 358.088,z = -102.868,     --(亚特兰蒂斯)亚特兰蒂斯支线18皮克斯3
            },
        },
[23327]={
            {
                mapId = 8,x = 341.001,y = 350.203,z = -116.775,     --(亚特兰蒂斯)亚特兰蒂斯支线19皮克斯4
            },
        },
[23328]={
            {
                mapId = 8,x = 318.261,y = 348.402,z = -50.4138,     --(亚特兰蒂斯)亚特兰蒂斯支线20皮克斯5
            },
        },
[23329]={
            {
                mapId = 8,x = 418.815,y = 363.859,z = -84.6878,     --(亚特兰蒂斯)亚特兰蒂斯支线21皮克斯6
            },
        },
[23330]={
            {
                mapId = 8,x = 393.989,y = 359.794,z = -75.742,     --(亚特兰蒂斯)亚特兰蒂斯支线22小美人鱼1
            },
        },
[23331]={
            {
                mapId = 8,x = 421.027,y = 362.977,z = -89.6859,     --(亚特兰蒂斯)亚特兰蒂斯支线23小美人鱼2
            },
        },
[23333]={
            {
                mapId = 8,x = 417.53,y = 363.469,z = -95.8499,     --(亚特兰蒂斯)亚特兰蒂斯支线25人鱼祖母
            },
        },
[23334]={
            {
                mapId = 8,x = -313.098,y = 356.744,z = -149.027,     --(亚特兰蒂斯)亚特兰蒂斯支线26被绑架的孩子
            },
        },
[23499]={
            {
                mapId = 8,x = -293.516,y = 356.685,z = -94.5322,     --(亚特兰蒂斯)亚特兰蒂斯支线27村民
            },
        },
[23501]={
            {
                mapId = 8,x = -46.5787,y = 330.614,z = -290.514,     --(亚特兰蒂斯)亚特兰蒂斯支线28鲸鱼老人2
            },
        },
[23582]={
            {
                mapId = 8,x = -287.84,y = 361.176,z = -358.338,     --(亚特兰蒂斯)亚特兰蒂斯支线29商人特鲁
            },
        },
[23583]={
            {
                mapId = 8,x = -192.286,y = 366.385,z = 101.063,     --(亚特兰蒂斯)亚特兰蒂斯支线30涅柔斯哨兵
            },
        },
[23584]={
            {
                mapId = 8,x = -337.578,y = 363.235,z = -32.6616,     --(亚特兰蒂斯)亚特兰蒂斯支线31索隆
            },
        },
[23585]={
            {
                mapId = 8,x = 338.323,y = 346.802,z = -148.908,     --(亚特兰蒂斯)亚特兰蒂斯支线32辛
            },
        },
[23586]={
            {
                mapId = 8,x = -185.538,y = 366.467,z = 99.0145,     --(亚特兰蒂斯)亚特兰蒂斯支线33希拉贡
            },
        },
[23587]={
            {
                mapId = 8,x = 399.606,y = 345.936,z = -172.955,     --(亚特兰蒂斯)亚特兰蒂斯支线34皮尔
            },
        },
[23588]={
            {
                mapId = 8,x = 336.677,y = 365.217,z = -14.8371,     --(亚特兰蒂斯)亚特兰蒂斯支线35涅柔斯密探
            },
        },
[23589]={
            {
                mapId = 8,x = 172.494,y = 364.814,z = -167.926,     --(亚特兰蒂斯)亚特兰蒂斯支线36卡普特
            },
        },
[23549]={
            {
                mapId = 1,x = -130.84,y = 372.34,z = 437.16,     --(新手村)高级纱织圣斗士墓地
            },
        },
[25198]={
            {
                mapId = 4,x = 296,y = 310,z = -4,     --(银河竞技场)主线147银都市_黑暗白鸟3
            },
        },
[25199]={
            {
                mapId = 4,x = 296,y = 310,z = -4,     --(银河竞技场)主线148银都市_黑暗白鸟4
            },
        },
[25200]={
            {
                mapId = 4,x = 223,y = 315,z = 180,     --(银河竞技场)主线149银都市_市民
            },
        },
[23712]={
            {
                mapId = 2,x = -215,y = 337,z = 44,     --(服务器进程)59雅典娜
            },
        },
[23713]={
            {
                mapId = 2,x = -224,y = 350,z = 334,     --(服务器进程)79雅典娜
            },
        },
[25699]={
            {
                mapId = 2,x = -306.355,y = 358.583,z = 334.635,     --(圣域)传送小宇宙之心蒂娜
            },
        },
[25700]={
            {
                mapId = 40,x = -288.825,y = 358.583,z = 334.48,     --(圣域)传送小宇宙之心塞琳娜
            },
        },
[21125]={
            {
                mapId = 320,x = 143,y = 362,z = -278,     --(剧本：七大洋之战！)七海_1北太平洋之柱
            },
        },
[21126]={
            {
                mapId = 320,x = -256,y = 368,z = -219,     --(剧本：七大洋之战！)七海_2南冰洋之柱
            },
        },
[21628]={
            {
                mapId = 2,x = -270,y = 356,z = 307,     --(圣域)深渊！魔星末日入口
            },
        },
[23580]={
            {
                mapId = 2,x = -175,y = 339,z = 423,     --(圣域)重生！圣域镇魂歌入口
            },
        },
[23212]={
            {
                mapId = 2,x = -194,y = 339,z = 384,     --(圣域)深渊入口
            },
        },
[25234]={
            {
                mapId = 2,x = -269,y = 356,z = 363,     --(圣域)北欧小镇入口
            },
        },
[21087]={
            {
                mapId = 2,x = -325,y = 350,z = 408,     --(圣域)大蛇入口
            },
        },
[23683]={
            {
                mapId = 8,x = 219.55,y = 455.46,z = 495.42,     --(亚特兰蒂斯)七大洋柱入口
            },
        },
[25711]={
            {
                mapId = 1,x = -470.693,y = 373.165,z = -27.8385,     --(群星之地)星矢出生地
            },
        },
[25713]={
            {
                mapId = 1,x = -330.078,y = 328.449,z = 80.7876,     --(群星之地)莎尔娜修行地
            },
        },
[16873]={
            {
                mapId = 1,x = -403.606,y = 326.618,z = 141.906,     --(群星之地)星矢村子
            },
        },
[17341]={
            {
                mapId = 2,x = -268,y = 333,z = 228,     --(圣域)宠物粮食
            },
        },
[17146]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17147]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17150]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17158]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17159]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17163]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17165]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17167]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17168]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17169]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17170]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[17172]={
            {
                mapId = 40,x = -298,y = 359,z = 335,     --(小宇宙之心)黄金幻象
            },
        },
[25768]={
            {
                mapId = 7,x = -270.84,y = 292.4,z = 324.91,     --(传送回城功能相关)传送东西伯利亚-科霍提克村
            },
        },
[25769]={
            {
                mapId = 7,x = -277.86,y = 309.8,z = -2.08,     --(传送回城功能相关)传送东西伯利亚-雪落村
            },
        },
[25770]={
            {
                mapId = 7,x = -388.48,y = 297.6,z = -273.65,     --(传送回城功能相关)传送东西伯利亚-魔鬼群礁
            },
        },
[25771]={
            {
                mapId = 7,x = 68.33,y = 296.9,z = -303.1,     --(传送回城功能相关)传送东西伯利亚-大裂隙
            },
        },
[25772]={
            {
                mapId = 7,x = 371.1,y = 261.6,z = -378.1,     --(传送回城功能相关)传送东西伯利亚-世界之树
            },
        },
[25773]={
            {
                mapId = 7,x = 449.7,y = 324.4,z = -87.9,     --(传送回城功能相关)传送东西伯利亚-风息谷
            },
        },
[25774]={
            {
                mapId = 7,x = -11.4,y = 293.3,z = 6.57,     --(传送回城功能相关)传送东西伯利亚-极光雪原
            },
        },
[25775]={
            {
                mapId = 7,x = 88.77,y = 296.9,z = 186.46,     --(传送回城功能相关)传送东西伯利亚-蓝冰堡
            },
        },
[25776]={
            {
                mapId = 8,x = -310.6,y = 362.9,z = -323.4,     --(传送回城功能相关)传送亚特兰蒂斯-遇难者沉船
            },
        },
[25777]={
            {
                mapId = 8,x = -242.6,y = 366.7,z = -101.4,     --(传送回城功能相关)传送亚特兰蒂斯-涅柔斯之村
            },
        },
[25778]={
            {
                mapId = 8,x = -54.1,y = 329,z = -146.9,     --(传送回城功能相关)传送亚特兰蒂斯-珊瑚林
            },
        },
[25779]={
            {
                mapId = 8,x = 97.3,y = 338.2,z = -366.6,     --(传送回城功能相关)传送亚特兰蒂斯-塞壬石林
            },
        },
[25780]={
            {
                mapId = 8,x = 201.7,y = 351.9,z = -237,     --(传送回城功能相关)传送亚特兰蒂斯-圣兽森林
            },
        },
[25781]={
            {
                mapId = 8,x = 369,y = 386.9,z = -375.9,     --(传送回城功能相关)传送亚特兰蒂斯-海之心
            },
        },
[25782]={
            {
                mapId = 8,x = 191.6,y = 399.7,z = 60.2,     --(传送回城功能相关)传送亚特兰蒂斯-波塞多尼亚
            },
        },
[25783]={
            {
                mapId = 7,x = -270.84,y = 292.4,z = 324.91,     --(传送回城功能相关)回城点东西伯利亚-科霍提克村
            },
        },
[25784]={
            {
                mapId = 7,x = -277.86,y = 309.8,z = -2.08,     --(传送回城功能相关)回城点东西伯利亚-雪落村
            },
        },
[25785]={
            {
                mapId = 7,x = 68.33,y = 296.9,z = -303.1,     --(传送回城功能相关)回城点东西伯利亚-大裂隙
            },
        },
[25786]={
            {
                mapId = 7,x = 449.7,y = 324.4,z = -87.9,     --(传送回城功能相关)回城点东西伯利亚-风息谷
            },
        },
[25787]={
            {
                mapId = 8,x = -310.6,y = 362.9,z = -323.4,     --(传送回城功能相关)回城点亚特兰蒂斯-遇难者沉船
            },
        },
[25788]={
            {
                mapId = 8,x = -242.6,y = 366.7,z = -101.4,     --(传送回城功能相关)回城点亚特兰蒂斯-涅柔斯之村
            },
        },
[25789]={
            {
                mapId = 8,x = 97.3,y = 338.2,z = -366.6,     --(传送回城功能相关)回城点亚特兰蒂斯-塞壬石林
            },
        },
[25790]={
            {
                mapId = 8,x = 201.7,y = 351.9,z = -237,     --(传送回城功能相关)回城点亚特兰蒂斯-圣兽森林
            },
        },
[20485]={
            {
                mapId = 3,x = -267,y = 327,z = -117,     --(庐山)主线昏迷的村民
            },
        },
[23083]={
            {
                mapId = 7,x = 223.86,y = 378.34,z = 438.07,     --(东西伯利亚)冰海神殿副本指引
            },
        },
[23680]={
            {
                mapId = 7,x = -270.84,y = 292.4,z = 324.91,     --(东西伯利亚)传送东西伯利亚-科霍提克村
            },
            {
                mapId = 7,x = -277.86,y = 309.8,z = -2.08,     --(东西伯利亚)传送东西伯利亚-雪落村
            },
            {
                mapId = 7,x = -388.48,y = 297.6,z = -273.65,     --(东西伯利亚)传送东西伯利亚-魔鬼群礁
            },
            {
                mapId = 7,x = 68.33,y = 296.9,z = -303.1,     --(东西伯利亚)传送东西伯利亚-大裂隙
            },
            {
                mapId = 7,x = 371.1,y = 261.6,z = -378.1,     --(东西伯利亚)传送东西伯利亚-世界之树
            },
            {
                mapId = 7,x = 449.7,y = 324.4,z = -87.9,     --(东西伯利亚)传送东西伯利亚-风息谷
            },
            {
                mapId = 7,x = -11.4,y = 293.3,z = 6.57,     --(东西伯利亚)传送东西伯利亚-极光雪原
            },
            {
                mapId = 7,x = 88.77,y = 296.9,z = 186.46,     --(东西伯利亚)传送东西伯利亚-蓝冰堡
            },
        },
[23681]={
            {
                mapId = 7,x = -270.84,y = 292.4,z = 324.91,     --(东西伯利亚)回城点东西伯利亚-科霍提克村
            },
            {
                mapId = 7,x = -277.86,y = 309.8,z = -2.08,     --(东西伯利亚)回城点东西伯利亚-雪落村
            },
            {
                mapId = 7,x = 68.33,y = 296.9,z = -303.1,     --(东西伯利亚)回城点东西伯利亚-大裂隙
            },
            {
                mapId = 7,x = 449.7,y = 324.4,z = -87.9,     --(东西伯利亚)回城点东西伯利亚-风息谷
            },
        },
[25220]={
            {
                mapId = 8,x = -310.6,y = 362.9,z = -323.4,     --(亚特兰蒂斯)传送亚特兰蒂斯-遇难者沉船
            },
            {
                mapId = 8,x = -242.6,y = 366.7,z = -101.4,     --(亚特兰蒂斯)传送亚特兰蒂斯-涅柔斯之村
            },
            {
                mapId = 8,x = -54.1,y = 329,z = -146.9,     --(亚特兰蒂斯)传送亚特兰蒂斯-珊瑚林
            },
            {
                mapId = 8,x = 97.3,y = 338.2,z = -366.6,     --(亚特兰蒂斯)传送亚特兰蒂斯-塞壬石林
            },
            {
                mapId = 8,x = 201.7,y = 351.9,z = -237,     --(亚特兰蒂斯)传送亚特兰蒂斯-圣兽森林
            },
            {
                mapId = 8,x = 369,y = 386.9,z = -375.9,     --(亚特兰蒂斯)传送亚特兰蒂斯-海之心
            },
            {
                mapId = 8,x = 191.6,y = 399.7,z = 60.2,     --(亚特兰蒂斯)传送亚特兰蒂斯-波塞多尼亚
            },
        },
[25221]={
            {
                mapId = 8,x = -310.6,y = 362.9,z = -323.4,     --(亚特兰蒂斯)回城点亚特兰蒂斯-遇难者沉船
            },
            {
                mapId = 8,x = -242.6,y = 366.7,z = -101.4,     --(亚特兰蒂斯)回城点亚特兰蒂斯-涅柔斯之村
            },
            {
                mapId = 8,x = 97.3,y = 338.2,z = -366.6,     --(亚特兰蒂斯)回城点亚特兰蒂斯-塞壬石林
            },
            {
                mapId = 8,x = 201.7,y = 351.9,z = -237,     --(亚特兰蒂斯)回城点亚特兰蒂斯-圣兽森林
            },
        },
[22078]={
            {
                mapId = 4,x = 221.97,y = 326.267,z = 366.633,     --(亚特兰蒂斯)辰巳得丸亚特兰蒂斯用
            },
        },
[25065]={
            {
                mapId = 8,x = -222,y = 377,z = -58,     --(亚特兰蒂斯)亚特兰蒂斯锻造师
            },
        },
[25904]={
            {
                mapId = 5,x = -159,y = 288,z = -421,     --(遗忘之路)遗忘之路接头人
            },
        },
[25901]={
            {
                mapId = 7,x = -327.123,y = 298.12,z = -249.536,     --(东西伯利亚)支线59魔鬼礁群_神秘人4
            },
        },
[16728]={
            {
                mapId = 5,x = -196,y = 307,z = 319,     --(遗忘之路)牢狱加隆
            },
        },
[25893]={
            {
                mapId = 2,x = -264,y = 356,z = 309,     --(圣域)传承商店
            },
        },
[25060]={
            {
                mapId = 8,x = -292.11,y = 356.71,z = -93.66,     --(亚特兰蒂斯)亚特兰蒂斯仓库管理员
            },
        },
[25061]={
            {
                mapId = 8,x = 356,y = 365,z = 2,     --(亚特兰蒂斯)亚特兰蒂斯仓库管理员
            },
        },
[25069]={
            {
                mapId = 8,x = 357,y = 365,z = 3,     --(亚特兰蒂斯)亚特兰蒂斯补给商人
            },
        },
[20923]={
            {
                mapId = 6,x = -115.74,y = 344.79,z = 62.21,     --(死亡皇后岛)支线艾里
            },
        },
[25062]={
            {
                mapId = 8,x = -236,y = 368.5,z = -107,     --(亚特兰蒂斯)亚特兰蒂斯面包商人
            },
        },
[20055]={
            {
                mapId = 6,x = -249.829,y = 343.04,z = 319.276,     --(死亡皇后岛)皇后岛回答问题石柱
            },
        },
[26018]={
            {
                mapId = 2,x = -4,y = 296,z = 397,     --(新版圣域)克劳德
            },
        },
[8519]={
            {
                mapId = 101,x = 6,y = 343,z = -278,     --(军团基地)基地主建筑管理员
            },
        },
[8545]={
            {
                mapId = 101,x = -75,y = 350,z = -209,     --(军团基地)基地商店管理员
            },
        },
[8533]={
            {
                mapId = 101,x = -114,y = 350,z = -248,     --(军团基地)基地仓库管理员
            },
        },
[8554]={
            {
                mapId = 101,x = -201,y = 353,z = -213,     --(军团基地)基地训练场管理员
            },
        },
[8579]={
            {
                mapId = 101,x = -32,y = 354,z = -219,     --(军团基地)基地奇迹管理员
            },
        },
[8568]={
            {
                mapId = 101,x = -188,y = 366,z = -47,     --(军团基地)基地祭坛管理员
            },
        },
[8563]={
            {
                mapId = 101,x = 95,y = 352,z = -205,     --(军团基地)基地车间管理员
            },
        },
[17857]={
            {
                mapId = 101,x = -200,y = 354,z = -217,     --(军团基地)军团修炼师
            },
        },
[20016]={
            {
                mapId = 101,x = 11,y = 343,z = -280,     --(军团基地)军团贡献牌兑换
            },
        },
[13534]={
            {
                mapId = LEAGUE_BASE,x = -105.32,y = 350.06,z = -262.89,     --(军团基地)加度
            },
        },
[20614]={
            {
                mapId = LEAGUE_BASE,x = -62.94,y = 350.01,z = -234.19,     --(军团基地)赫尔墨斯
            },
        },
[26072]={
            {
                mapId = 2,x = 280,y = 346,z = 245,     --(新版圣域)克劳德狂脊之巅
            },
        },
[26076]={
            {
                mapId = 2,x = 236,y = 329,z = 210,     --(新版圣域)激励士兵
            },
        },
[13534]={
            {
                mapId = LEAGUE_BASE,x = -105.32,y = 350.06,z = -262.89,     --(军团活动)加度
            },
        },
[10926]={
            {
                mapId = LEAGUE_BASE,x = -107.47,y = 350.06,z = -260.837,     --(军团活动)柏菲亚
            },
        },
[20615]={
            {
                mapId = LEAGUE_BASE,x = -59.82,y = 350.01,z = -234.51,     --(军团活动)赫尔墨斯的使者
            },
        },
[13508]={
            {
                mapId = LEAGUE_BASE,x = -98.4397,y = 349.985,z = -260.181,     --(军团活动)圣斗士英灵
            },
        },
[26107]={
            {
                mapId = 2,x = -16,y = 297,z = 304,     --(新版圣域)扎克斯
            },
        },
[26139]={
            {
                mapId = 4,x = -257,y = 285,z = -31,     --(银河竞技场)支线多洛迪亚1
            },
        },
[26140]={
            {
                mapId = 4,x = -238,y = 285,z = -29,     --(银河竞技场)支线多洛迪亚2
            },
        },
[26141]={
            {
                mapId = 4,x = -221,y = 285,z = -32,     --(银河竞技场)支线多洛迪亚3
            },
        },
[18434]={
            {
                mapId = 302,x = 356,y = 288.5,z = -368,     --(剧本：黄泉之井)完成任务奥路菲
            },
        },
[26190]={
            {
                mapId = 307,x = -868,y = 67,z = 313,     --(剧本：逃离比良坂)阿布
            },
        },
[26191]={
            {
                mapId = 307,x = -896,y = 57,z = 261,     --(剧本：逃离比良坂)小武空
            },
        },
[26189]={
            {
                mapId = 307,x = -886,y = 62,z = 286,     --(剧本：逃离比良坂)李云
            },
        },
[26471]={
            {
                mapId = 2,x = -173,y = 343,z = 279,     --(新版圣域)神父基加美修
            },
        },
[26818]={
            {
                mapId = 10,x = -359.801,y = 313.841,z = 411.939,     --(海因斯坦堡)主线02晨曦森林加隆
            },
        },
[26819]={
            {
                mapId = 10,x = -356.117,y = 318.419,z = 352.746,     --(海因斯坦堡)主线03晨曦森林地奇星战斗前
            },
        },
[26820]={
            {
                mapId = 10,x = -356.117,y = 318.419,z = 352.746,     --(海因斯坦堡)主线04晨曦森林地奇星战斗后
            },
        },
[26821]={
            {
                mapId = 10,x = -199.905,y = 309.994,z = 395.243,     --(海因斯坦堡)主线05守林人小屋守林人
            },
        },
[26822]={
            {
                mapId = 10,x = -109.758,y = 299.27,z = 317.873,     --(海因斯坦堡)主线06裂隙边撒加
            },
        },
[26823]={
            {
                mapId = 10,x = -107.158,y = 299.238,z = 318.938,     --(海因斯坦堡)主线07裂隙边卡妙
            },
        },
[26824]={
            {
                mapId = 10,x = -110.957,y = 299.465,z = 315.766,     --(海因斯坦堡)主线08裂隙边修罗
            },
        },
[26825]={
            {
                mapId = 10,x = -54.7081,y = 299.612,z = 376.421,     --(海因斯坦堡)主线09守林人桥边
            },
        },
[26827]={
            {
                mapId = 10,x = 127.755,y = 305.932,z = 279.186,     --(海因斯坦堡)主线11安德里斯村长
            },
        },
[26828]={
            {
                mapId = 10,x = 104.339,y = 305.579,z = 281.785,     --(海因斯坦堡)主线12安德里斯铁匠
            },
        },
[26829]={
            {
                mapId = 10,x = 165.359,y = 301.419,z = 283.989,     --(海因斯坦堡)主线13安德里斯厨师
            },
        },
[26830]={
            {
                mapId = 10,x = 176.615,y = 301.387,z = 292.432,     --(海因斯坦堡)主线14安德里斯农夫
            },
        },
[26831]={
            {
                mapId = 10,x = 165.359,y = 301.419,z = 283.989,     --(海因斯坦堡)主线15伯爵仆人
            },
        },
[26832]={
            {
                mapId = 10,x = 136.394,y = 298.878,z = 333.492,     --(海因斯坦堡)主线16伯爵仆人隐秘角落
            },
        },
[26833]={
            {
                mapId = 10,x = 216.365,y = 297.998,z = 201.16,     --(海因斯坦堡)主线17尤里安断桥处
            },
        },
[26835]={
            {
                mapId = 10,x = 177.627,y = 301.242,z = 274.225,     --(海因斯坦堡)主线19穆安德里斯农庄
            },
        },
[26838]={
            {
                mapId = 10,x = 282.868,y = 298.296,z = 229.579,     --(海因斯坦堡)主线22尤里安安德里斯农庄边
            },
        },
[26839]={
            {
                mapId = 10,x = 289.115,y = 298.047,z = 39.9761,     --(海因斯坦堡)主线23尤里安亡者之村
            },
        },
[26840]={
            {
                mapId = 10,x = 362.936,y = 309.896,z = -60.0626,     --(海因斯坦堡)主线24尤里安亡者之村村后
            },
        },
[26843]={
            {
                mapId = 10,x = 418.613,y = 313.505,z = -280.234,     --(海因斯坦堡)主线27尤里安神父身边
            },
        },
[26844]={
            {
                mapId = 10,x = 421.298,y = 313.651,z = -285.965,     --(海因斯坦堡)主线28治疗好的神父
            },
        },
[26846]={
            {
                mapId = 10,x = 430.89,y = 311.062,z = -331.854,     --(海因斯坦堡)主线30尤里安教堂后面
            },
        },
[26847]={
            {
                mapId = 10,x = 250.375,y = 339.962,z = -311.701,     --(海因斯坦堡)主线31尤里安安息墓园之中
            },
        },
[26848]={
            {
                mapId = 10,x = 112.86,y = 369.527,z = -416.387,     --(海因斯坦堡)主线32尤里安安息墓园深处
            },
        },
[26849]={
            {
                mapId = 10,x = 120.926,y = 369.266,z = -424.282,     --(海因斯坦堡)主线33天哭星安息墓园深处
            },
        },
[26850]={
            {
                mapId = 10,x = 120.96,y = 369.013,z = -412.716,     --(海因斯坦堡)主线34星矢安息墓园深处
            },
        },
[26854]={
            {
                mapId = 10,x = -25.6957,y = 369.053,z = -135.734,     --(海因斯坦堡)主线38冰河菲森小镇外
            },
        },
[26859]={
            {
                mapId = 10,x = -30.5996,y = 370.565,z = -141.087,     --(海因斯坦堡)主线43被抓的游荡者
            },
        },
[26861]={
            {
                mapId = 10,x = -186.03,y = 364.181,z = 83.7768,     --(海因斯坦堡)主线45地奇星菲森小镇
            },
        },
[26862]={
            {
                mapId = 10,x = -194.269,y = 364.181,z = 77.6799,     --(海因斯坦堡)主线46拉达曼迪斯菲森小镇
            },
        },
[26863]={
            {
                mapId = 10,x = -194.98,y = 364.204,z = 90.6232,     --(海因斯坦堡)主线47瞬菲森小镇
            },
        },
[26864]={
            {
                mapId = 10,x = -182.441,y = 364.181,z = 89.4659,     --(海因斯坦堡)主线48星矢菲森小镇
            },
        },
[26867]={
            {
                mapId = 10,x = -166.655,y = 363.236,z = 82.2521,     --(海因斯坦堡)主线51尤里安菲森小镇
            },
        },
[26868]={
            {
                mapId = 10,x = -125.38,y = 360.283,z = 80.7287,     --(海因斯坦堡)主线52菲森小镇村民1
            },
        },
[26871]={
            {
                mapId = 10,x = -324.125,y = 376.335,z = 109.763,     --(海因斯坦堡)主线55尤里安彼岸花海之中
            },
        },
[26872]={
            {
                mapId = 10,x = -470.871,y = 403.885,z = 14.5419,     --(海因斯坦堡)主线56尤里安睡神核心
            },
        },
[26873]={
            {
                mapId = 10,x = -469.446,y = 404.379,z = -4.7497,     --(海因斯坦堡)主线57星矢睡神核心
            },
        },
[26879]={
            {
                mapId = 10,x = -314.572,y = 419.939,z = 2.53681,     --(海因斯坦堡)主线63星矢哈迪斯城门前
            },
        },
[27757]={
            {
                mapId = 5,x = -191,y = 306,z = 304,     --(遗忘之路)主线遗忘之路金色幻象2
            },
        },
[27760]={
            {
                mapId = 4,x = 299.973,y = 321.106,z = 290.72,     --(银河竞技场)纱织
            },
        },
[27761]={
            {
                mapId = 4,x = 301.162,y = 321.106,z = 289.789,     --(银河竞技场)辰巳德丸
            },
        },
[27762]={
            {
                mapId = 4,x = 301.782,y = 321.106,z = 287.236,     --(银河竞技场)星矢
            },
        },
[27763]={
            {
                mapId = 4,x = 298.745,y = 321.106,z = 292.997,     --(银河竞技场)紫龙
            },
        },
[27764]={
            {
                mapId = 4,x = 297.863,y = 321.106,z = 295.084,     --(银河竞技场)冰河
            },
        },
[27765]={
            {
                mapId = 4,x = 293.483,y = 321.106,z = 287.88,     --(银河竞技场)穆
            },
        },
[27766]={
            {
                mapId = 4,x = 293.86,y = 321.106,z = 286.184,     --(银河竞技场)贵鬼
            },
        },
[1012]={
            {
                mapId = 305,x = -79,y = 366,z = 216,     --(十风穴的最后决战)瞬
            },
        },
[1748]={
            {
                mapId = 307,x = -784,y = 69,z = 362,     --(逃离比良坂)貌似紫龙
            },
        },
[15523]={
            {
                mapId = 309,x = -419,y = 315,z = -30,     --(欺瞒神的男人)海神卫灵
            },
        },
[14065]={
            {
                mapId = 310,x = 137,y = 421,z = 306,     --(重返观星楼)双子幻象
            },
        },
[19899]={
            {
                mapId = 318,x = -349,y = 340,z = 304,     --(一辉回忆)皇后岛学员
            },
        },
[22714]={
            {
                mapId = 321,x = -103,y = 307,z = 351,     --(冰河回忆)艾德罗，东西伯利亚学员
            },
        },
[10472]={
            {
                mapId = 306,x = 15.2182,y = 340.384,z = -18.371,     --(春丽)春丽
            },
        },
[26865]={
            {
                mapId = 10,x = -185.598,y = 364.181,z = 91.759,     --(海因斯坦堡)主线49紫龙菲森小镇
            },
        },
[26883]={
            {
                mapId = 10,x = -319.349,y = 434.309,z = -168.051,     --(海因斯坦堡)主线67拉达曼迪斯黄泉之井
            },
        },
[26887]={
            {
                mapId = 10,x = -323.054,y = 419.037,z = -142.029,     --(海因斯坦堡)主线71瞬黄泉之井
            },
        },
[26888]={
            {
                mapId = 10,x = -393.56,y = 421.228,z = -230.083,     --(海因斯坦堡)主线72瞬死睡神小屋
            },
        },
[26889]={
            {
                mapId = 10,x = -392.471,y = 421.228,z = -228.112,     --(海因斯坦堡)主线73潘多拉死睡神小屋
            },
        },
[26892]={
            {
                mapId = 10,x = -330.792,y = 434.309,z = -182.467,     --(海因斯坦堡)主线76冰河哈迪斯城中
            },
        },
[26893]={
            {
                mapId = 10,x = -327.436,y = 434.309,z = -182.353,     --(海因斯坦堡)主线77星矢哈迪斯城中
            },
        },
[26894]={
            {
                mapId = 10,x = -285.412,y = 459.369,z = -260.594,     --(海因斯坦堡)主线78星矢冥界入口
            },
        },
[26896]={
            {
                mapId = 10,x = -287.389,y = 459.369,z = -261.028,     --(海因斯坦堡)主线80冰河打赛洛斯前
            },
        },
[26899]={
            {
                mapId = 10,x = -285.69,y = 459.371,z = -258.984,     --(海因斯坦堡)主线83童虎冥界入口
            },
        },
[27688]={
            {
                mapId = 10,x = -109.758,y = 299.27,z = 317.873,     --(海因斯坦堡)主线撒加战斗后
            },
        },
[26874]={
            {
                mapId = 10,x = -470,y = 404,z = -2,     --(海因斯坦堡)主线彼岸花海瞬
            },
        },
[27823]={
            {
                mapId = 6,x = -81.2037,y = 355.944,z = -207.344,     --(环任务)165奴隶青年D杰克
            },
        },
[27824]={
            {
                mapId = 6,x = 33.6692,y = 357.665,z = -141.332,     --(环任务)166瞬2
            },
        },
[27825]={
            {
                mapId = 5,x = -21.3626,y = 305.455,z = -200.045,     --(环任务)167道格拉斯1
            },
        },
[27826]={
            {
                mapId = 5,x = -156.245,y = 324.009,z = -170.218,     --(环任务)168道格拉斯2
            },
        },
[27827]={
            {
                mapId = 5,x = -182.711,y = 320.076,z = -97.8703,     --(环任务)169道格拉斯3
            },
        },
[27828]={
            {
                mapId = 5,x = -39.7502,y = 305.057,z = -191.398,     --(环任务)170受伤的村民
            },
        },
[27831]={
            {
                mapId = 5,x = 80.5325,y = 327.914,z = -245.116,     --(环任务)173艾欧里亚2
            },
        },
[27832]={
            {
                mapId = 5,x = -160.287,y = 319.976,z = -42.2707,     --(环任务)174艾欧里亚3
            },
        },
[27833]={
            {
                mapId = 5,x = -132.228,y = 320.546,z = -25.2219,     --(环任务)175艾欧里亚4
            },
        },
[27834]={
            {
                mapId = 1,x = -147.535,y = 372.523,z = 416.167,     --(环任务)176勇敢的少年1
            },
        },
[27837]={
            {
                mapId = 1,x = -91.5336,y = 365.853,z = 299.022,     --(环任务)179迪斯马斯克2
            },
        },
[27838]={
            {
                mapId = 1,x = -91.4336,y = 365.853,z = 299.122,     --(环任务)180迪斯马斯克3
            },
        },
[27839]={
            {
                mapId = 7,x = 3.16717,y = 298.322,z = -263.807,     --(环任务)181冰之少女1
            },
        },
[27840]={
            {
                mapId = 7,x = -2.27065,y = 297.084,z = -319.074,     --(环任务)182冰之少女2
            },
        },
[27842]={
            {
                mapId = 7,x = -34.6393,y = 296.904,z = -415.174,     --(环任务)184冰河1
            },
        },
[27904]={
            {
                mapId = 6,x = 37.2514,y = 357.332,z = -144.61,     --(环任务)186一辉4
            },
        },
[27905]={
            {
                mapId = 5,x = -178.633,y = 320.026,z = -92.1006,     --(环任务)187射手座1
            },
        },
[27917]={
            {
                mapId = 6,x = -78.3872,y = 355.513,z = -213.846,     --(环任务)189黑暗搜捕者
            },
        },
[27918]={
            {
                mapId = 7,x = 121.628,y = 296.982,z = -293.911,     --(环任务)190雪莲守卫
            },
        },
[27919]={
            {
                mapId = 7,x = -32.393,y = 296.852,z = -408.541,     --(环任务)191冰斗士
            },
        },
[27920]={
            {
                mapId = 1,x = -137.754,y = 371.564,z = 415.706,     --(环任务)192丧尸
            },
        },
[27921]={
            {
                mapId = 5,x = -161.358,y = 323.692,z = -172.843,     --(环任务)193狂化野兽
            },
        },
[28178]={
            {
                mapId = 8,x = -114.416,y = 353.028,z = 134.227,     --(环任务)194科拉1
            },
        },
[28179]={
            {
                mapId = 8,x = -114.316,y = 353.028,z = 134.327,     --(环任务)195科拉2
            },
        },
[28181]={
            {
                mapId = 8,x = -127.178,y = 356.618,z = 144.396,     --(环任务)197克修拉1
            },
        },
[28182]={
            {
                mapId = 8,x = -127.078,y = 356.618,z = 144.396,     --(环任务)198克修拉2
            },
        },
[28183]={
            {
                mapId = 2,x = -202.122,y = 337.481,z = 17.6514,     --(环任务)199艾欧里亚5
            },
        },
[28184]={
            {
                mapId = 5,x = -25.7885,y = 319.985,z = 3.84426,     --(环任务)200圣域老守卫
            },
        },
[28185]={
            {
                mapId = 5,x = -148.521,y = 309.786,z = 242.282,     --(环任务)201加隆
            },
        },
[28207]={
            {
                mapId = 8,x = -109.573,y = 350.287,z = 120.423,     --(环任务)202塞壬海妖
            },
        },
[28208]={
            {
                mapId = 5,x = -106.746,y = 320.209,z = 12.2832,     --(环任务)203神器守卫
            },
        },
[28209]={
            {
                mapId = 5,x = -76.727,y = 307.977,z = 211.079,     --(环任务)204冥界杂兵
            },
        },
[11363]={
            {
                mapId = 5,x = -18.7795,y = 310.001,z = 118.938,     --(环任务)045穆2
            },
        },
[11364]={
            {
                mapId = 5,x = -88.3978,y = 310.015,z = 197.757,     --(环任务)046穆3
            },
        },
[26415]={
            {
                mapId = 1,x = -487.189,y = 369.211,z = 18.9536,     --(群星之地)主线公告牌旁候补生
            },
        },
[26414]={
            {
                mapId = 1,x = -488.862,y = 369.291,z = 20.8677,     --(群星之地)主线公告牌
            },
        },
[26416]={
            {
                mapId = 1,x = -490.39,y = 369.184,z = 18.9057,     --(群星之地)主线公告牌旁星矢
            },
        },
[27993]={
            {
                mapId = 2,x = -224,y = 350,z = 334,     --(服务器进程)89雅典娜
            },
        },
[27994]={
            {
                mapId = 2,x = -224,y = 350,z = 334,     --(服务器进程)99雅典娜
            },
        },
[26700]={
            {
                mapId = 9,x = -380,y = 302,z = 221,     --(仙女岛)支线1码头_纳琉索斯
            },
        },
[26701]={
            {
                mapId = 9,x = -392,y = 302,z = 75,     --(仙女岛)支线2灯塔_鲁托斯
            },
        },
[26702]={
            {
                mapId = 9,x = -313.265,y = 303.645,z = 189.422,     --(仙女岛)支线3灯塔_船锚
            },
        },
[26703]={
            {
                mapId = 9,x = -319.61,y = 304.719,z = 163.574,     --(仙女岛)支线4灯塔_模糊的身影
            },
        },
[26704]={
            {
                mapId = 9,x = -394.381,y = 302.519,z = 73.9148,     --(仙女岛)支线5灯塔_旧船的小宇宙
            },
        },
[26706]={
            {
                mapId = 9,x = -312.646,y = 317.634,z = -126.665,     --(仙女岛)支线7克甫斯村_比亚托斯
            },
        },
[26707]={
            {
                mapId = 9,x = -344.63,y = 315.81,z = -112.864,     --(仙女岛)支线8克甫斯村_帕拉妮1
            },
        },
[26708]={
            {
                mapId = 9,x = -248.546,y = 321.118,z = 48.5675,     --(仙女岛)支线9克甫斯村_帕拉妮2
            },
        },
[26709]={
            {
                mapId = 9,x = -317.421,y = 320.116,z = -97.6228,     --(仙女岛)支线10克甫斯村_拉顿
            },
        },
[26710]={
            {
                mapId = 9,x = -320.155,y = 320.189,z = -76.2254,     --(仙女岛)支线11克甫斯村_瑟布罗斯
            },
        },
[26711]={
            {
                mapId = 9,x = -341.969,y = 316.071,z = -96.0084,     --(仙女岛)支线12克甫斯村_摩尔涅
            },
        },
[26712]={
            {
                mapId = 9,x = -246.511,y = 321.163,z = 50.2264,     --(仙女岛)支线13沐泪湖_微弱的小宇宙
            },
        },
[26713]={
            {
                mapId = 9,x = -52.0925,y = 334.4,z = 100.884,     --(仙女岛)支线14沐泪湖_微弱的小宇宙2
            },
        },
[26714]={
            {
                mapId = 9,x = -48.0344,y = 334.449,z = 97.598,     --(仙女岛)支线15沐泪湖_帕拉妮3
            },
        },
[26715]={
            {
                mapId = 9,x = 13.3861,y = 331.53,z = 128.253,     --(仙女岛)支线16沐泪湖_奥鲁耳
            },
        },
[26716]={
            {
                mapId = 9,x = 124.168,y = 320.003,z = -305.894,     --(仙女岛)支线17训练场_特里休斯
            },
        },
[26717]={
            {
                mapId = 9,x = 141.045,y = 320.106,z = -278.302,     --(仙女岛)支线18训练场_雷古拉斯
            },
        },
[26718]={
            {
                mapId = 9,x = 127.166,y = 320.303,z = -297.746,     --(仙女岛)支线19修行者居所_科托勒
            },
        },
[26719]={
            {
                mapId = 9,x = -396.283,y = 300.724,z = -384.317,     --(仙女岛)支线20牺牲之石_帕罗托
            },
        },
[26720]={
            {
                mapId = 9,x = -375.541,y = 302.07,z = -363.028,     --(仙女岛)支线21牺牲之石_特里休斯2
            },
        },
[26721]={
            {
                mapId = 9,x = 248.102,y = 326.908,z = -90.15,     --(仙女岛)支线22牺牲之石_艾尼格斯
            },
        },
[26722]={
            {
                mapId = 9,x = 57.7659,y = 345.011,z = -252.175,     --(仙女岛)支线23塔尔塔罗斯火山_拜奥尼娅
            },
        },
[27394]={
            {
                mapId = 9,x = -391.86,y = 300.95,z = -379.483,     --(仙女岛)支线27牺牲之石_特里休斯3
            },
        },
[27405]={
            {
                mapId = 10,x = -217.646,y = 313.012,z = 378.67,     --(海因斯坦堡)支线1晨曦森林_马克西姆
            },
        },
[27406]={
            {
                mapId = 10,x = 170.571,y = 300,z = 306,     --(海因斯坦堡)支线2安德里斯农庄_古德里安
            },
        },
[27407]={
            {
                mapId = 10,x = 170.571,y = 170.571,z = 170.571,     --(海因斯坦堡)支线3安德里斯农庄_海因兹
            },
        },
[27408]={
            {
                mapId = 10,x = 170.571,y = 170.571,z = 170.571,     --(海因斯坦堡)支线4安德里斯农庄_桑德拉
            },
        },
[27409]={
            {
                mapId = 10,x = 170.571,y = 170.571,z = 170.571,     --(海因斯坦堡)支线5安德里斯农庄_懒惰
            },
        },
[27410]={
            {
                mapId = 10,x = 418.699,y = 313.505,z = -289.101,     --(海因斯坦堡)支线6教堂_帕特克
            },
        },
[27411]={
            {
                mapId = 10,x = 416.841,y = 313.505,z = -287.196,     --(海因斯坦堡)支线7安息墓园_维克托
            },
        },
[27412]={
            {
                mapId = 10,x = 396.755,y = 312.043,z = -334.299,     --(海因斯坦堡)支线8安息墓园_维克多利亚
            },
        },
[27413]={
            {
                mapId = 10,x = 430.987,y = 311.688,z = -310.074,     --(海因斯坦堡)支线9安息墓园_海因斯坦伯爵
            },
        },
[27414]={
            {
                mapId = 10,x = 482.763,y = 312.846,z = -344.372,     --(海因斯坦堡)支线10安息墓园_海因斯坦伯爵2
            },
        },
[27415]={
            {
                mapId = 10,x = 481.776,y = 313.113,z = -350.635,     --(海因斯坦堡)支线11安息墓园_伯爵夫人
            },
        },
[27416]={
            {
                mapId = 10,x = 479.011,y = 312.54,z = -351.942,     --(海因斯坦堡)支线12安息墓园_迪迪
            },
        },
[27417]={
            {
                mapId = 10,x = -75.8113,y = 351.085,z = 32.569,     --(海因斯坦堡)支线13长风小径_维吉尼亚
            },
        },
[27418]={
            {
                mapId = 10,x = -132.956,y = 367.135,z = -16.9631,     --(海因斯坦堡)支线14菲森小镇_睡神使者
            },
        },
[27419]={
            {
                mapId = 10,x = -167.251,y = 362.994,z = 56.9286,     --(海因斯坦堡)支线15菲森小镇_马提亚斯
            },
        },
[27420]={
            {
                mapId = 10,x = -123.317,y = 360.965,z = 101.245,     --(海因斯坦堡)支线16菲森小镇_瓦伦特
            },
        },
[27421]={
            {
                mapId = 10,x = -303.638,y = 419.037,z = -139.205,     --(海因斯坦堡)支线17海因斯坦堡_沃夫加
            },
        },
[27422]={
            {
                mapId = 10,x = -324.572,y = 419.037,z = -75.8206,     --(海因斯坦堡)支线18海因斯坦堡_艾瑞克
            },
        },
[27423]={
            {
                mapId = 10,x = -181.066,y = 363.235,z = 129.23,     --(海因斯坦堡)支线19菲森小镇_被噩梦浸染的人
            },
        },
[27424]={
            {
                mapId = 10,x = 13.4656,y = 357.104,z = -66.2478,     --(海因斯坦堡)支线20长风小径腿骨
            },
        },
[27812]={
            {
                mapId = 10,x = 416.693,y = 313.505,z = -285.249,     --(海因斯坦堡)支线21教堂_维克多利亚2
            },
        },
[28252]={
            {
                mapId = 2,x = -242.435,y = 337.489,z = 82.0737,     --(新圣域)黄金匠师乔纳森
            },
        },
[14162]={
            {
                mapId = 308,x = -73.45,y = 317.63,z = 251.84,     --(剧本：十三年前的真相)红石山崖石碑
            },
        },
[10472]={
            {
                mapId = 306,x = 15.2182,y = 340.384,z = -18.371,     --(剧本：紫龙与雷虎)春丽
            },
        },
[28346]={
            {
                mapId = 9,x = -330,y = 316,z = -148,     --(仙女岛)仙女岛装备售卖
            },
            {
                mapId = 9,x = 118,y = 320,z = -269,     --(仙女岛)仙女岛装备售卖
            },
        },
[28341]={
            {
                mapId = 9,x = -313,y = 318,z = -112,     --(仙女岛)聚能师
            },
        },
[28347]={
            {
                mapId = 9,x = 144,y = 320,z = -256,     --(仙女岛)仙女岛仓库
            },
            {
                mapId = 9,x = -340,y = 316,z = -136,     --(仙女岛)仙女岛仓库
            },
        },
[28348]={
            {
                mapId = 9,x = 109,y = 321,z = -293,     --(仙女岛)仙女岛补给商人
            },
            {
                mapId = 9,x = -308,y = 318,z = -116,     --(仙女岛)仙女岛补给商人
            },
        },
[28349]={
            {
                mapId = 9,x = 109,y = 321,z = -293,     --(仙女岛)仙女岛补给商人
            },
            {
                mapId = 9,x = -308,y = 318,z = -116,     --(仙女岛)仙女岛补给商人
            },
        },
[28350]={
            {
                mapId = 9,x = 109,y = 320,z = -281,     --(仙女岛)邮箱
            },
            {
                mapId = 9,x = -330,y = 320,z = -65,     --(仙女岛)邮箱
            },
        },
[15663]={
            {
                mapId = 6,x = -114,y = 350,z = -226,     --(环任务)137一辉2
            },
        },
[15664]={
            {
                mapId = 6,x = -67.4014,y = 358.81,z = -238.356,     --(环任务)138一辉3
            },
        },
[15680]={
            {
                mapId = 6,x = -22,y = 359,z = -225,     --(环任务)154瞬1
            },
        },
[15681]={
            {
                mapId = 6,x = 37,y = 356,z = -149,     --(环任务)155艾丝美拉达
            },
        },
[28382]={
            {
                mapId = 10,x = 163,y = 300,z = 315,     --(海因斯坦堡)聚能师
            },
        },
[28416]={
            {
                mapId = 10,x = 158,y = 301,z = 281,     --(海因斯坦堡)安德里斯农庄仓库
            },
            {
                mapId = 10,x = -244,y = 363,z = 122,     --(海因斯坦堡)菲森小镇仓库
            },
        },
[28392]={
            {
                mapId = 10,x = 182,y = 301,z = 289,     --(海因斯坦堡)安德里斯农庄面包商人
            },
            {
                mapId = 10,x = -243,y = 363,z = 122,     --(海因斯坦堡)菲森小镇面包商人
            },
            {
                mapId = 10,x = -196,y = 310,z = 393,     --(海因斯坦堡)哈迪斯城晨曦森林补给点
            },
            {
                mapId = 10,x = 406,y = 302,z = 51,     --(海因斯坦堡)哈迪斯城王者之村补给点
            },
            {
                mapId = 10,x = 380,y = 314,z = -341,     --(海因斯坦堡)哈迪斯城教堂补给点
            },
            {
                mapId = 10,x = 112,y = 367,z = -97,     --(海因斯坦堡)哈迪斯城安息墓园补给点
            },
            {
                mapId = 10,x = -308,y = 419,z = -137,     --(海因斯坦堡)哈迪斯城补给点
            },
        },
[28393]={
            {
                mapId = 10,x = 181,y = 301,z = 282,     --(海因斯坦堡)安德里斯农庄药水商人
            },
            {
                mapId = 10,x = -245,y = 363,z = 122,     --(海因斯坦堡)菲森小镇药水商人
            },
            {
                mapId = 10,x = -196,y = 310,z = 393,     --(海因斯坦堡)哈迪斯城晨曦森林补给点
            },
            {
                mapId = 10,x = 406,y = 302,z = 51,     --(海因斯坦堡)哈迪斯城王者之村补给点
            },
            {
                mapId = 10,x = 380,y = 314,z = -341,     --(海因斯坦堡)哈迪斯城教堂补给点
            },
            {
                mapId = 10,x = 112,y = 367,z = -97,     --(海因斯坦堡)哈迪斯城安息墓园补给点
            },
            {
                mapId = 10,x = -308,y = 419,z = -137,     --(海因斯坦堡)哈迪斯城补给点
            },
        },
[28394]={
            {
                mapId = 10,x = 171,y = 300,z = 310,     --(海因斯坦堡)安德里斯农庄锻造师
            },
            {
                mapId = 10,x = -241,y = 363,z = 122,     --(海因斯坦堡)菲森小镇锻造师
            },
        },
[28380]={
            {
                mapId = 10,x = 116,y = 299,z = 337,     --(海因斯坦堡)安德里斯农庄邮箱
            },
            {
                mapId = 10,x = -99,y = 355,z = 66,     --(海因斯坦堡)菲森小镇邮箱
            },
        },
[27899]={
            {
                mapId = 2,x = -399.64,y = 350.52,z = 290.66,     --(圣域)十二宫入口续
            },
        },
[27900]={
            {
                mapId = 2,x = -390.42,y = 350.5,z = 322.54,     --(圣域)十二宫入口终
            },
        },
[28410]={
            {
                mapId = 7,x = 343,y = 328,z = 33,     --(东西伯利亚)东西伯利亚蓝冰刀卫
            },
        },
[28411]={
            {
                mapId = 7,x = 346,y = 328,z = 24,     --(东西伯利亚)东西伯利亚暗冰士兵
            },
        },
[14615]={
            {
                mapId = 308,x = 231.36,y = 298.99,z = 76.9,     --(剧本：射手逃亡)艾欧罗斯
            },
        },
[28343]={
            {
                mapId = 9,x = -330,y = 316,z = -148,     --(仙女岛)仙女岛任务用功能NPC
            },
        },
[28341]={
            {
                mapId = 9,x = -313,y = 318,z = -112,     --(仙女岛)仙女岛任务用功能NPC
            },
        },
[28337]={
            {
                mapId = 9,x = -340,y = 316,z = -136,     --(仙女岛)仙女岛任务用功能NPC
            },
        },
[28344]={
            {
                mapId = 9,x = 109,y = 321,z = -293,     --(仙女岛)仙女岛任务用功能NPC
            },
        },
[28342]={
            {
                mapId = 9,x = 118,y = 320,z = -269,     --(仙女岛)仙女岛任务用功能NPC
            },
        },
[28336]={
            {
                mapId = 9,x = 144,y = 320,z = -256,     --(仙女岛)仙女岛任务用功能NPC
            },
        },
[28378]={
            {
                mapId = 10,x = 181,y = 301,z = 282,     --(海因斯坦堡)哈迪斯城任务用功能NPC
            },
        },
[28382]={
            {
                mapId = 10,x = 163,y = 300,z = 315,     --(海因斯坦堡)哈迪斯城任务用功能NPC
            },
        },
[28374]={
            {
                mapId = 10,x = 158,y = 301,z = 281,     --(海因斯坦堡)哈迪斯城任务用功能NPC
            },
        },
[28379]={
            {
                mapId = 10,x = -245,y = 363,z = 122,     --(海因斯坦堡)哈迪斯城任务用功能NPC
            },
        },
[28375]={
            {
                mapId = 10,x = -244,y = 363,z = 122,     --(海因斯坦堡)哈迪斯城任务用功能NPC
            },
        },
[28384]={
            {
                mapId = 10,x = -241,y = 363,z = 122,     --(海因斯坦堡)哈迪斯城任务用功能NPC
            },
        },
[26503]={
            {
                mapId = 9,x = -441,y = 307,z = 113,     --(主线01码头管理员)
            },
        },
[26504]={
            {
                mapId = 9,x = -437,y = 307,z = 75,     --(主线02码头苏兰特)
            },
        },
[26505]={
            {
                mapId = 9,x = -458,y = 307,z = 94,     --(主线03码头朱利安)
            },
        },
[26506]={
            {
                mapId = 9,x = -400,y = 318,z = 259,     --(主线04灯塔看守者)
            },
        },
[26507]={
            {
                mapId = 9,x = -361,y = 326,z = 267,     --(主线05孤儿)
            },
        },
[26508]={
            {
                mapId = 9,x = -420,y = 305,z = 90,     --(主线06鱼商人)
            },
        },
[26509]={
            {
                mapId = 9,x = -265,y = 312,z = 118,     --(主线07辍学学徒)
            },
        },
[26510]={
            {
                mapId = 9,x = -330,y = 316,z = -121,     --(主线08克甫斯村苏兰特)
            },
        },
[26511]={
            {
                mapId = 9,x = -318,y = 316,z = -142,     --(主线09克甫斯村朱利安)
            },
        },
[26512]={
            {
                mapId = 9,x = -321,y = 320,z = -51,     --(主线10村口守卫)
            },
        },
[26513]={
            {
                mapId = 9,x = -354,y = 320,z = -75,     --(主线11村长)
            },
        },
[26514]={
            {
                mapId = 9,x = -343,y = 321,z = -219,     --(主线12冥界士兵)
            },
        },
[26515]={
            {
                mapId = 9,x = -390,y = 303,z = -413,     --(主线12冥兵队长)
            },
        },
[26516]={
            {
                mapId = 9,x = -385,y = 303,z = -409,     --(主线13沙滩珍妮)
            },
        },
[26517]={
            {
                mapId = 9,x = -187,y = 315,z = 169,     --(主线14前学员)
            },
        },
[26518]={
            {
                mapId = 9,x = -171,y = 302,z = 282,     --(主线15碑1)
            },
        },
[26519]={
            {
                mapId = 9,x = -171,y = 302,z = 282,     --(主线16碑2)
            },
        },
[26520]={
            {
                mapId = 9,x = -100,y = 336,z = 113,     --(主线17湖边黎达)
            },
        },
[26521]={
            {
                mapId = 9,x = 1,y = 332,z = 136,     --(主线18仙女座)
            },
        },
[26522]={
            {
                mapId = 9,x = -217,y = 334,z = -195,     --(主线19火山受伤学员)
            },
        },
[26523]={
            {
                mapId = 9,x = 141,y = 320,z = -283,     --(主线20修行地亚路比奥尼)
            },
        },
[26524]={
            {
                mapId = 9,x = 113,y = 320,z = -268,     --(主线21修行地守卫)
            },
        },
[26525]={
            {
                mapId = 9,x = 124,y = 320,z = -280,     --(主线22修行地受伤学员)
            },
        },
[26526]={
            {
                mapId = 9,x = 127,y = 320,z = -306,     --(主线23修行地黎达)
            },
        },
[26527]={
            {
                mapId = 9,x = 352,y = 320,z = -391,     --(主线24石阵珍妮)
            },
        },
[26528]={
            {
                mapId = 9,x = 131,y = 320,z = -303,     --(主线25修行地珍妮)
            },
        },
[26529]={
            {
                mapId = 9,x = 134,y = 322,z = -298,     --(主线26修行地瞬)
            },
        },
[26530]={
            {
                mapId = 9,x = 350,y = 320,z = -250,     --(主线27本能行动瞬)
            },
        },
[26531]={
            {
                mapId = 9,x = 247,y = 327,z = -83,     --(主线28训练场珍妮)
            },
        },
[26532]={
            {
                mapId = 9,x = 145,y = 336,z = 77,     --(主线29黑暗仙女)
            },
        },
[26533]={
            {
                mapId = 9,x = 266,y = 357,z = 70,     --(主线30岬角戴达罗斯)
            },
        },
[26534]={
            {
                mapId = 9,x = 262,y = 356,z = 75,     --(主线31岬角亚路比奥尼)
            },
        },
[26535]={
            {
                mapId = 9,x = 308,y = 348,z = 179,     --(主线32岬角珍妮)
            },
        },
[26536]={
            {
                mapId = 9,x = 312,y = 348,z = 177,     --(主线33岬角亚鲁哥路)
            },
        },
[26537]={
            {
                mapId = 9,x = 323,y = 349,z = 180,     --(主线34岬角瞬)
            },
        },
[26538]={
            {
                mapId = 9,x = -5,y = 341,z = -287,     --(主线35火山亚路比奥尼)
            },
        },
[26539]={
            {
                mapId = 9,x = -5,y = 342,z = -285,     --(主线36火山戴达罗斯)
            },
        },
[26540]={
            {
                mapId = 9,x = 7,y = 341,z = -280,     --(主线37火山女王)
            },
        },
[26541]={
            {
                mapId = 9,x = -8,y = 361,z = -248,     --(主线38火山哥顿)
            },
        },
[26542]={
            {
                mapId = 9,x = -16,y = 377,z = -163,     --(主线39火山西路费都)
            },
        },
[26543]={
            {
                mapId = 9,x = -2,y = 340,z = -290,     --(主线40火山瞬)
            },
        },
[26544]={
            {
                mapId = 9,x = -358,y = 320,z = -76,     --(主线41克甫斯村珍妮)
            },
        },
[26545]={
            {
                mapId = 9,x = -356,y = 320,z = -79,     --(主线42克甫斯村瞬)
            },
        },
[27784]={
            {
                mapId = 9,x = 431,y = 321,z = -408,     --(主线44冥界影武者)
            },
        },
[27787]={
            {
                mapId = 9,x = 107,y = 322,z = -34,     --(主线45训练场黎达)
            },
        },
[27790]={
            {
                mapId = 9,x = 317,y = 349,z = 181,     --(主线46岬角黎达)
            },
        },
[27793]={
            {
                mapId = 9,x = 312,y = 348,z = 177,     --(主线47岬角亚鲁哥路2)
            },
        },
[27796]={
            {
                mapId = 9,x = 14,y = 361,z = -230,     --(主线48火山瞬2)
            },
        },
[27799]={
            {
                mapId = 9,x = -23,y = 377,z = -182,     --(主线49火山瞬3)
            },
        },
[27802]={
            {
                mapId = 9,x = -52,y = 390,z = -196,     --(主线50火山瞬4)
            },
        },
[27809]={
            {
                mapId = 9,x = -317,y = 307,z = 123,     --(主线51村长之子)
            },
        },
[28494]={
            {
                mapId = 2,x = -306,y = 359,z = 335,     --(主线圣域雅典娜)
            },
        },
[26897]={
            {
                mapId = 10,x = -287.389,y = 459.369,z = -261.028,     --(主线冰河打塞洛斯后)
            },
        },
[28470]={
            {
                mapId = 7,x = -313.672,y = 291.38,z = 316.775,     --(个人库)奥夫斯基
            },
        },
[28471]={
            {
                mapId = 7,x = -30.2033,y = 289.731,z = 102.623,     --(个人库)契诃夫斯基
            },
        },
[28472]={
            {
                mapId = 8,x = -271.854,y = 366.791,z = -81.653,     --(个人库)海利斯
            },
        },
[28473]={
            {
                mapId = 8,x = -57.3063,y = 330.043,z = -250.779,     --(个人库)古宾
            },
        },
[28474]={
            {
                mapId = 9,x = -371.513,y = 319.032,z = -190.04,     --(个人库)迪达
            },
        },
[28475]={
            {
                mapId = 9,x = 113.74,y = 320.315,z = -239.137,     --(个人库)克鲁斯
            },
        },
[28476]={
            {
                mapId = 10,x = 142.863,y = 301.718,z = 296.205,     --(个人库)葛雷奇
            },
        },
[28477]={
            {
                mapId = 10,x = 279.532,y = 304.086,z = 382.414,     --(个人库)萨波亚
            },
        },
[28438]={
            {
                mapId = 7,x = -130.538,y = 302.597,z = 142.878,     --(个人库)冰壁监视人
            },
        },
[28439]={
            {
                mapId = 7,x = 250.657,y = 258.872,z = -410.611,     --(个人库)世界之树监视人
            },
        },
[28440]={
            {
                mapId = 8,x = -47.8725,y = 330.026,z = -240.661,     --(个人库)珊瑚林监视人
            },
        },
[28441]={
            {
                mapId = 8,x = 407.271,y = 399.623,z = 139.828,     --(个人库)波塞多尼亚监视人
            },
        },
[28442]={
            {
                mapId = 9,x = -136.074,y = 323.017,z = -365.374,     --(个人库)火山监视人
            },
        },
[28443]={
            {
                mapId = 9,x = 134.089,y = 320.02,z = -119.427,     --(个人库)呷角监视人
            },
        },
[28444]={
            {
                mapId = 10,x = 226.688,y = 301.738,z = 38.653,     --(个人库)亡者之村监视人
            },
        },
[28445]={
            {
                mapId = 10,x = -290.299,y = 419.987,z = 12.2085,     --(个人库)哈迪斯城监视人
            },
        },
[26817]={
            {
                mapId = 2,x = -390.141,y = 350.586,z = 339.525,     --(主线雅典娜死后童虎)主线雅典娜死后童虎圣域
            },
        },
[28531]={
            {
                mapId = 9,x = -401.149,y = 301.988,z = 217.983,     --(传送回城功能相关)仙女岛-仙女岛码头
            },
        },
[28532]={
            {
                mapId = 9,x = -336.286,y = 315.811,z = -137.617,     --(传送回城功能相关)仙女岛-克甫斯村
            },
        },
[28533]={
            {
                mapId = 9,x = -16.0684,y = 336.331,z = 68.6711,     --(传送回城功能相关)仙女岛-沐泪湖
            },
        },
[28534]={
            {
                mapId = 9,x = -176.19,y = 326.203,z = -340.588,     --(传送回城功能相关)仙女岛-塔尔塔罗斯火山
            },
        },
[28535]={
            {
                mapId = 9,x = 111.715,y = 320.557,z = -309.706,     --(传送回城功能相关)仙女岛-学员营地
            },
        },
[28536]={
            {
                mapId = 9,x = 313.403,y = 320.26,z = -284.008,     --(传送回城功能相关)仙女岛-神谕石阵
            },
        },
[28537]={
            {
                mapId = 9,x = 180.973,y = 344.185,z = 20.1583,     --(传送回城功能相关)仙女岛-锁链岬角
            },
        },
[28538]={
            {
                mapId = 9,x = 337.068,y = 340.419,z = 258.203,     --(传送回城功能相关)仙女岛-海怪巨礁
            },
        },
[28539]={
            {
                mapId = 10,x = -205.457,y = 309.991,z = 387.867,     --(传送回城功能相关)哈迪斯城-守林人小屋
            },
        },
[28540]={
            {
                mapId = 10,x = 160.025,y = 299.986,z = 316.598,     --(传送回城功能相关)哈迪斯城-安德里斯农庄
            },
        },
[28541]={
            {
                mapId = 10,x = 218.921,y = 301.937,z = 46.8903,     --(传送回城功能相关)哈迪斯城-亡者之村
            },
        },
[28542]={
            {
                mapId = 10,x = 422.808,y = 313.654,z = -222.115,     --(传送回城功能相关)哈迪斯城-教堂
            },
        },
[28543]={
            {
                mapId = 10,x = 248.403,y = 339.973,z = -305.521,     --(传送回城功能相关)哈迪斯城-安息墓地
            },
        },
[28544]={
            {
                mapId = 10,x = 109.853,y = 366.59,z = -74.8687,     --(传送回城功能相关)哈迪斯城-葡萄园
            },
        },
[28545]={
            {
                mapId = 10,x = -176.328,y = 363.234,z = 130.902,     --(传送回城功能相关)哈迪斯城-菲森小镇
            },
        },
[28546]={
            {
                mapId = 10,x = -312.606,y = 419.037,z = -138.011,     --(传送回城功能相关)哈迪斯城-哈迪斯城
            },
        },
[28547]={
            {
                mapId = 9,x = -402.062,y = 301.861,z = 219.711,     --(传送回城功能相关)仙女岛-仙女岛码头回城点
            },
        },
[28548]={
            {
                mapId = 9,x = -335.392,y = 315.809,z = -140.193,     --(传送回城功能相关)仙女岛-克甫斯村回城点
            },
        },
[28549]={
            {
                mapId = 9,x = 111.975,y = 320.648,z = -307.298,     --(传送回城功能相关)仙女岛-学员营地回城点
            },
        },
[28550]={
            {
                mapId = 9,x = 179.987,y = 343.876,z = 18.2709,     --(传送回城功能相关)仙女岛-锁链岬角回城点
            },
        },
[28551]={
            {
                mapId = 10,x = -208.916,y = 309.983,z = 389.55,     --(传送回城功能相关)哈迪斯城-守林人小屋回城点
            },
        },
[28552]={
            {
                mapId = 10,x = 161.293,y = 300.052,z = 315.291,     --(传送回城功能相关)哈迪斯城-安德里斯农庄回城点
            },
        },
[28553]={
            {
                mapId = 10,x = 420.399,y = 313.674,z = -222.631,     --(传送回城功能相关)哈迪斯城-教堂回城点
            },
        },
[28554]={
            {
                mapId = 10,x = -179.042,y = 363.234,z = 130.864,     --(传送回城功能相关)哈迪斯城-菲森小镇回城点
            },
        },
[28351]={
            {
                mapId = 9,x = -401.149,y = 301.988,z = 217.983,     --(仙女岛)仙女岛-仙女岛码头
            },
            {
                mapId = 9,x = -336.286,y = 315.811,z = -137.617,     --(仙女岛)仙女岛-克甫斯村
            },
            {
                mapId = 9,x = -16.0684,y = 336.331,z = 68.6711,     --(仙女岛)仙女岛-沐泪湖
            },
            {
                mapId = 9,x = -176.19,y = 326.203,z = -340.588,     --(仙女岛)仙女岛-塔尔塔罗斯火山
            },
            {
                mapId = 9,x = 111.715,y = 320.557,z = -309.706,     --(仙女岛)仙女岛-学员营地
            },
            {
                mapId = 9,x = 313.403,y = 320.26,z = -284.008,     --(仙女岛)仙女岛-神谕石阵
            },
            {
                mapId = 9,x = 180.973,y = 344.185,z = 20.1583,     --(仙女岛)仙女岛-锁链岬角
            },
            {
                mapId = 9,x = 337.068,y = 340.419,z = 258.203,     --(仙女岛)仙女岛-海怪巨礁
            },
        },
[28352]={
            {
                mapId = 9,x = -402.062,y = 301.861,z = 219.711,     --(仙女岛)仙女岛-仙女岛码头回城点
            },
            {
                mapId = 9,x = -335.392,y = 315.809,z = -140.193,     --(仙女岛)仙女岛-克甫斯村回城点
            },
            {
                mapId = 9,x = 111.975,y = 320.648,z = -307.298,     --(仙女岛)仙女岛-学员营地回城点
            },
            {
                mapId = 9,x = 179.987,y = 343.876,z = 18.2709,     --(仙女岛)仙女岛-锁链岬角回城点
            },
        },
[28390]={
            {
                mapId = 10,x = -205.457,y = 309.991,z = 387.867,     --(海因斯坦堡)哈迪斯城-守林人小屋
            },
            {
                mapId = 10,x = 160.025,y = 299.986,z = 316.598,     --(海因斯坦堡)哈迪斯城-安德里斯农庄
            },
            {
                mapId = 10,x = 218.921,y = 301.937,z = 46.8903,     --(海因斯坦堡)哈迪斯城-亡者之村
            },
            {
                mapId = 10,x = 422.808,y = 313.654,z = -222.115,     --(海因斯坦堡)哈迪斯城-教堂
            },
            {
                mapId = 10,x = 248.403,y = 339.973,z = -305.521,     --(海因斯坦堡)哈迪斯城-安息墓地
            },
            {
                mapId = 10,x = 109.853,y = 366.59,z = -74.8687,     --(海因斯坦堡)哈迪斯城-葡萄园
            },
            {
                mapId = 10,x = -176.328,y = 363.234,z = 130.902,     --(海因斯坦堡)哈迪斯城-菲森小镇
            },
            {
                mapId = 10,x = -312.606,y = 419.037,z = -138.011,     --(海因斯坦堡)哈迪斯城-哈迪斯城
            },
        },
[28391]={
            {
                mapId = 10,x = -208.916,y = 309.983,z = 389.55,     --(海因斯坦堡)哈迪斯城-守林人小屋回城点
            },
            {
                mapId = 10,x = 161.293,y = 300.052,z = 315.291,     --(海因斯坦堡)哈迪斯城-安德里斯农庄回城点
            },
            {
                mapId = 10,x = 420.399,y = 313.674,z = -222.631,     --(海因斯坦堡)哈迪斯城-教堂回城点
            },
            {
                mapId = 10,x = -179.042,y = 363.234,z = 130.864,     --(海因斯坦堡)哈迪斯城-菲森小镇回城点
            },
        },
[16384]={
            {
                mapId = 2,x = -310.02,y = 344.11,z = 9.94,     --(圣域)圣域古董爱好者阿密伽
            },
        },
[16386]={
            {
                mapId = 2,x = -308.82,y = 343.87,z = 50.66,     --(圣域)圣域学者
            },
        },
[28490]={
            {
                mapId = 2,x = -294,y = 359,z = 335,     --(仙女岛)圣域雅典娜
            },
        },
[26479]={
            {
                mapId = 3,x = 149,y = 462,z = 273,     --(庐山)庐山副本迪斯马斯克
            },
        },
[26723]={
            {
                mapId = 9,x = -221,y = 329,z = 40,     --(仙女岛)仙女岛支线裂隙
            },
        },
[14637]={
            {
                mapId = 10,x = 144.277,y = 298.725,z = 329.139,     --(海因斯坦堡)海因斯坦堡军需官
            },
        },
[14636]={
            {
                mapId = 9,x = -319.477,y = 315.748,z = -143.983,     --(仙女岛)仙女岛军需官
            },
        },
[28614]={
            {
                mapId = 2,x = -183,y = 339,z = 400,     --(圣域)竞技场兑换
            },
        },
[28650]={
            {
                mapId = 2,x = 21,y = 316,z = -354,r = 2,     --(月度日常)月度日常梦神的诡计
            },
        },
[26065]={
            {
                mapId = 4,x = 324.759,y = 334.605,z = 350.476,     --(银河竞技场)银河竞技场_纱织
            },
        },
[20070]={
            {
                mapId = 32,x = 259,y = 200,z = 154,     --(迷幻雪山)滚雪球NPC
            },
            {
                mapId = 32,x = 149,y = 194,z = 124,     --(迷幻雪山)滚雪球NPC
            },
            {
                mapId = 32,x = 227,y = 261,z = 295,     --(迷幻雪山)滚雪球NPC
            },
        },
[27901]={
            {
                mapId = 2,x = -383.3,y = 350.6,z = 357.6,     --(圣域)十二宫入口余
            },
        },
[28805]={
            {
                mapId = 9,x = 245,y = 327,z = -70,     --(仙女岛)仙女岛奇遇任务安德莉亚
            },
        },
[29149]={
            {
                mapId = 4,x = -397,y = 364,z = 75,     --(银河竞技场)银河竞技场十风穴进入副本星矢
            },
        },
[29150]={
            {
                mapId = 7,x = -333,y = 296,z = -288,     --(东西伯利亚)东西伯利亚冰河回忆进入副本冰河
            },
        },
[29151]={
            {
                mapId = 7,x = -333,y = 296,z = -288,     --(东西伯利亚)东西伯利亚冰河回忆出副本冰河
            },
        },
[29156]={
            {
                mapId = 2,x = 354,y = 289,z = -368,     --(新版圣域)剧本进入NPC奥路菲
            },
        },
[29157]={
            {
                mapId = 2,x = -43,y = 297,z = 335,     --(新版圣域)剧本进入NPC村长
            },
        },
[29159]={
            {
                mapId = 2,x = -393,y = 351,z = 348,     --(新版圣域)剧本进入NPC十二宫守卫
            },
        },
[29154]={
            {
                mapId = 6,x = -343.714,y = 363.201,z = -160.244,     --(死亡皇后岛)熔金营地瞬
            },
        },
[29155]={
            {
                mapId = 6,x = -90,y = 351,z = 26,     --(死亡皇后岛)凤凰之尾枫
            },
        },
[29163]={
            {
                mapId = 8,x = 220,y = 455,z = 465,     --(亚特兰蒂斯)贵鬼副本前
            },
        },
[29164]={
            {
                mapId = 8,x = 220,y = 455,z = 465,     --(亚特兰蒂斯)贵鬼副本后
            },
        },
[29169]={
            {
                mapId = 5,x = -186,y = 326,z = -179,     --(遗忘之路)剧本进入NPC命运女神的幻象
            },
        },
[29170]={
            {
                mapId = 5,x = -191,y = 306,z = 304,     --(遗忘之路)剧本进入NPC金色幻象
            },
        },
[29171]={
            {
                mapId = 5,x = -282,y = 355,z = 128,     --(遗忘之路)剧本进入NPC希尔汗
            },
        },
[28830]={
            {
                mapId = 6,x = -368,y = 360,z = -140,     --(死亡皇后岛)支线49奇遇任务透明怪03洛里尼
            },
        },
[29190]={
            {
                mapId = 2,x = -237,y = 350,z = 301,     --(圣域)星魂兑换黄金测试NPC
            },
        },
[29191]={
            {
                mapId = 2,x = -237,y = 350,z = 301,     --(圣域)星魂兑换正式测试NPC
            },
        },
[20668]={
            {
                mapId = 6,x = -334,y = 368,z = 165,     --(死亡皇后岛)主线滚石
            },
        },
[29306]={
            {
                mapId = 2,x = -194,y = 337,z = 70,     --(圣域)主城密保卡
            },
        },
[16376]={
            {
                mapId = 2,x = -224,y = 339,z = 9,     --(圣域)大地图生活npc_流浪者乐团歌姬 叶赛尼娅
            },
        },
[12670]={
            {
                mapId = 3,x = -183,y = 319,z = -298,     --(庐山)芳芳
            },
        },
[29412]={
            {
                mapId = LEAGUE_BASE,x = -107.47,y = 350.06,z = -260.837,     --(军团基地)柏菲雅2
            },
        },
[29444]={
            {
                mapId = 4,x = 236,y = 326,z = 386,     --(银河竞技场)银河竞技场修行者
            },
            {
                mapId = 4,x = 38,y = 293,z = -293,     --(银河竞技场)银河竞技场修行者
            },
            {
                mapId = 4,x = -258,y = 285,z = -42,     --(银河竞技场)银河竞技场修行者
            },
        },
[29451]={
            {
                mapId = 3,x = -235,y = 319,z = -137,     --(庐山)庐山修行者
            },
            {
                mapId = 3,x = -186,y = 484,z = 275,     --(庐山)庐山修行者
            },
        },
[29445]={
            {
                mapId = 5,x = -86,y = 288,z = -403,     --(遗忘之路)遗忘之路修行者
            },
            {
                mapId = 5,x = 36,y = 308,z = -150,     --(遗忘之路)遗忘之路修行者
            },
            {
                mapId = 5,x = -24,y = 315,z = 134,     --(遗忘之路)遗忘之路修行者
            },
        },
[29446]={
            {
                mapId = 6,x = -152,y = 365,z = -143,     --(死亡皇后岛)死亡皇后岛修行者
            },
            {
                mapId = 6,x = -313,y = 363,z = -161,     --(死亡皇后岛)死亡皇后岛修行者
            },
            {
                mapId = 6,x = -390,y = 382,z = 62,     --(死亡皇后岛)死亡皇后岛修行者
            },
        },
[29447]={
            {
                mapId = 7,x = -256,y = 292,z = 327,     --(东西伯利亚)东西伯利亚修行者
            },
            {
                mapId = 7,x = -281,y = 310,z = -14,     --(东西伯利亚)东西伯利亚修行者
            },
            {
                mapId = 7,x = 440,y = 319,z = -66,     --(东西伯利亚)东西伯利亚修行者
            },
        },
[29448]={
            {
                mapId = 8,x = 348,y = 365,z = -5,     --(亚特兰蒂斯)亚特兰蒂斯修行者
            },
            {
                mapId = 8,x = -271,y = 359,z = -105,     --(亚特兰蒂斯)亚特兰蒂斯修行者
            },
        },
[29449]={
            {
                mapId = 9,x = -342,y = 316,z = -106,     --(仙女岛)仙女岛修行者
            },
            {
                mapId = 9,x = 143,y = 320,z = -275,     --(仙女岛)仙女岛修行者
            },
        },
[29450]={
            {
                mapId = 10,x = 163,y = 301,z = 282,     --(哈迪斯城)哈迪斯城修行者
            },
            {
                mapId = 10,x = -224,y = 363,z = 82,     --(哈迪斯城)哈迪斯城修行者
            },
        },
[20784]={
            {
                mapId = 2,x = -250,y = 337,z = 81,     --(圣域)圣衣发放_杰森
            },
        },
[20785]={
            {
                mapId = 2,x = -254,y = 338,z = 89,     --(圣域)圣衣发放_洛基
            },
        },
[23122]={
            {
                mapId = 2,x = -250,y = 337,z = 103,     --(圣域)圣衣发放_凯罗
            },
        },
[23123]={
            {
                mapId = 2,x = -239,y = 337,z = 112,     --(圣域)圣衣发放_米开朗
            },
        },
[12685]={
            {
                mapId = 2,x = 303,y = 298,z = -173,     --(环任务)鹰
            },
        },
[29490]={
            {
                mapId = 2,x = 107.33,y = 305.08,z = -385.58,     --(传送回城功能相关)圣域-黄泉之井
            },
        },
[13584]={
            {
                mapId = 2,x = -38.66,y = 297.08,z = 346.59,     --(传送回城功能相关)圣域回城点-罗德里奥村
            },
        },
[29491]={
            {
                mapId = 2,x = -253.28,y = 337.48,z = 32.68,     --(传送回城功能相关)圣域回城点-贸易区
            },
        },
[28326]={
            {
                mapId = 2,x = -410.48,y = 356.19,z = 318.22,     --(圣域)女神的挽歌前入口
            },
        },
[29700]={
            {
                mapId = 3,x = -245.449,y = 318.988,z = -71.1457,     --(端午节活动)端午节钱阿婆
            },
        },
[29619]={
            {
                mapId = 3,x = -262,y = 319,z = -58,     --(端午节活动)端午节猴子
            },
        },
[29618]={
            {
                mapId = 2,x = -222,y = 337,z = 91,     --(端午节活动)端午节贵鬼
            },
        },
[29960]={
            {
                mapId = 2,x = -203.79,y = 337.47,z = 16.25,     --(圣域)神战点商店
            },
            {
                mapId = 2,x = -195.6,y = 339.2,z = 385.68,     --(圣域)神战点商店
            },
        },
[30118]={
            {
                mapId = 2,x = -221.233,y = 337.481,z = 93.8753,     --(圣域)仲夏_01莎尔娜
            },
        },
[30119]={
            {
                mapId = 2,x = -317.592,y = 342.236,z = 74.6236,     --(圣域)仲夏_02教皇
            },
        },
[30120]={
            {
                mapId = 2,x = -321.473,y = 343.856,z = 58.3544,     --(圣域)仲夏_03金牛座
            },
        },
[30121]={
            {
                mapId = 2,x = -315.912,y = 343.864,z = 88.6618,     --(圣域)仲夏_04水瓶座
            },
        },
[30122]={
            {
                mapId = 2,x = -324.464,y = 343.866,z = 71.8886,     --(圣域)仲夏_05狮子座
            },
        },
[30123]={
            {
                mapId = 2,x = -323.178,y = 343.856,z = 76.2863,     --(圣域)仲夏_06处女座
            },
        },
[30124]={
            {
                mapId = 2,x = -319.641,y = 343.865,z = 85.3793,     --(圣域)仲夏_07摩羯座
            },
        },
[30125]={
            {
                mapId = 2,x = -322.015,y = 343.866,z = 80.9345,     --(圣域)仲夏_08天蝎座
            },
        },
[30126]={
            {
                mapId = 2,x = -323.822,y = 343.866,z = 62.4262,     --(圣域)仲夏_09双子座
            },
        },
[30127]={
            {
                mapId = 2,x = -310.467,y = 343.862,z = 90.6837,     --(圣域)仲夏_10双鱼座
            },
        },
[30128]={
            {
                mapId = 2,x = -324.767,y = 343.866,z = 66.6915,     --(圣域)仲夏_11巨蟹座
            },
        },
[30129]={
            {
                mapId = 2,x = -218.517,y = 350.307,z = 332.41,     --(圣域)仲夏_12魔铃
            },
        },
[30661]={
            {
                mapId = 6,x = -115.208,y = 355.522,z = -204.906,     --(死亡皇后岛)奇遇_老奴隶
            },
        },
[29963]={
            {
                mapId = 7,x = -346.391,y = 291.32,z = 341.07,     --(东西伯利亚)奇遇_瓦西里
            },
        },
[30032]={
            {
                mapId = 8,x = -157.341,y = 366.025,z = 106.014,     --(亚特兰蒂斯)奇遇_穆
            },
        },
[30079]={
            {
                mapId = 2,x = -196.6,y = 339.2,z = 387.8,     --(圣域)扫荡使者
            },
        },
[30707]={
            {
                mapId = 2,x = -236.96,y = 350.307,z = 366.827,     --(圣域)通用_节日兑换NPC
            },
        },
[30781]={
            {
                mapId = 2,x = -219,y = 350,z = 338,     --(圣域)天降宝箱大使
            },
        },
[29839]={
            {
                mapId = 1,x = -336.26,y = 326.61,z = 326.55,     --(月度护送)月度护送-任务发放
            },
        },
[30081]={
            {
                mapId = 1,x = -336.26,y = 326.61,z = 326.55,     --(月度护送)月度护送-任务发放2
            },
        },
[30082]={
            {
                mapId = 1,x = -336.26,y = 326.61,z = 326.55,     --(月度护送)月度护送-任务发放3
            },
        },
[30026]={
            {
                mapId = 1,x = 38.28,y = 331.24,z = 113.31,     --(月度护送)月度护送-任务完成
            },
        },
[30861]={
            {
                mapId = 2,x = -218,y = 350,z = 335,     --(圣域)仲夏_丰产之灵1
            },
        },
[30862]={
            {
                mapId = 2,x = -218,y = 350,z = 335,     --(圣域)仲夏_丰产之灵2
            },
        },
[30863]={
            {
                mapId = 2,x = -218,y = 350,z = 335,     --(圣域)仲夏_丰产之灵3
            },
        },
[28771]={
            {
                mapId = 8,x = 244,y = 399,z = 61,     --(亚特兰蒂斯)亚特兰蒂斯圣域斥候1
            },
        },
[28910]={
            {
                mapId = 8,x = 244,y = 399,z = 61,     --(亚特兰蒂斯)亚特兰蒂斯圣域斥候2
            },
        },
[29973]={
            {
                mapId = 10,x = -313,y = 443,z = -267,     --(哈迪斯城)哈迪斯城忠心的仆人
            },
        },
[31029]={
            {
                mapId = 1,x = 37.73,y = 330,z = 108,     --(月度护送)月度护送-任务完成2
            },
        },
[31190]={
            {
                mapId = 1,x = -48,y = 345,z = 134,     --(月度护送)月度护送-对话事件完成
            },
        },
[31194]={
            {
                mapId = 1,x = 39,y = 330,z = 110,     --(月度护送)月度护送-对话事件完成2
            },
        },
[31606]={
            {
                mapId = 4,x = 473,y = 312,z = 407,     --(普通世界boss)普通世界boss
            },
        },
[31607]={
            {
                mapId = 3,x = -145,y = 311,z = -9,     --(普通世界boss)普通世界boss
            },
        },
[31608]={
            {
                mapId = 5,x = -171,y = 321,z = -7,     --(普通世界boss)普通世界boss
            },
        },
[31609]={
            {
                mapId = 6,x = 40,y = 362,z = -284,     --(普通世界boss)普通世界boss
            },
        },
[31610]={
            {
                mapId = 7,x = 3,y = 296,z = -368,     --(普通世界boss)普通世界boss
            },
        },
[31611]={
            {
                mapId = 8,x = -269,y = 363,z = -396,     --(普通世界boss)普通世界boss
            },
        },
[31612]={
            {
                mapId = 9,x = -202,y = 300,z = 313,     --(普通世界boss)普通世界boss
            },
        },
[31613]={
            {
                mapId = 10,x = -126,y = 299,z = 299,     --(普通世界boss)普通世界boss
            },
        },
[31614]={
            {
                mapId = 6,x = -254,y = 336,z = 436,     --(超级世界boss)超级世界boss
            },
        },
[31615]={
            {
                mapId = 8,x = 220,y = 446,z = 315,     --(超级世界boss)超级世界boss
            },
        },
[31616]={
            {
                mapId = 10,x = 146,y = 301,z = 91,     --(超级世界boss)超级世界boss
            },
        },
[31003]={
            {
                mapId = 2,x = -246,y = 338,z = 85,     --(圣域)黑暗匠师萨菲罗斯
            },
        },
[31619]={
            {
                mapId = 2,x = -227,y = 337,z = 66,     --(圣域)女神的恩赐使者
            },
        },
[31593]={
            {
                mapId = 2,x = -116,y = 324,z = 57,     --(圣域)奇遇_贫困的圣域住民
            },
        },
[31630]={
            {
                mapId = 322,x = 863,y = 4,z = -1768,     --(剧情十二宫)黑衣人
            },
        },
[26411]={
            {
                mapId = 322,x = 546,y = 75,z = -1852,     --(剧情十二宫)穆
            },
        },
[32159]={
            {
                mapId = 2,x = -199,y = 337,z = 43,     --(圣域)推广大使
            },
        },
[32331]={
            {
                mapId = 2,x = -108,y = 324,z = 74,     --(圣域)下城区寻宝网NPC
            },
        },
[32332]={
            {
                mapId = 2,x = -156,y = 339,z = 279,     --(圣域)上城区寻宝网NPC
            },
        },
[20495]={
            {
                mapId = 4,x = -230,y = 380,z = 214,     --(银河竞技场)城户纱织
            },
        },
[31663]={
            {
                mapId = 3,x = 28,y = 450,z = 305,     --(天魔降伏_沙加任务)奇遇任务
            },
        },
[31665]={
            {
                mapId = 3,x = 28,y = 450,z = 305,     --(天魔降伏_沙加副本服务1)奇遇任务
            },
        },
[32174]={
            {
                mapId = 3,x = 28,y = 450,z = 305,     --(天魔降伏_沙加副本服务1)奇遇任务
            },
        },
[32175]={
            {
                mapId = 3,x = 28,y = 450,z = 305,     --(天魔降伏_沙加副本服务1)奇遇任务
            },
        },
[32176]={
            {
                mapId = 3,x = 28,y = 450,z = 305,     --(天魔降伏_沙加任务后)奇遇任务
            },
        },
[32484]={
            {
                mapId = 2,x = -218,y = 350,z = 337,     --(圣域)斗士归来罗娜
            },
        },
[32487]={
            {
                mapId = 4,x = 199,y = 315,z = 165,     --(银河竞技场)奇遇任务神咲丰多
            },
        },
[32348]={
            {
                mapId = 2,x = -19.8,y = 300,z = 455.46,     --(月度日常狮子的獠牙)女神祭祀（艾欧里亚）
            },
        },
[32349]={
            {
                mapId = 37,x = 18,y = 305,z = -185,     --(月度日常狮子的獠牙)艾欧里亚
            },
            {
                mapId = 2,x = -19.8,y = 300,z = 455.46,     --(月度日常狮子的獠牙)艾欧里亚
            },
        },
[32685]={
            {
                mapId = 2,x = -17.9,y = 300,z = 454.62,     --(月度日常狮子的獠牙)艾欧里亚的侍从
            },
        },
[31005]={
            {
                mapId = 1,x = -142,y = 372,z = 352,     --(群星之地)奇遇艾娅
            },
        },
[29829]={
            {
                mapId = 2,x = -239,y = 289,z = -123,     --(圣域)奇遇贵鬼
            },
        },
[29658]={
            {
                mapId = 6,x = -332,y = 340,z = 302,     --(死亡皇后岛)奇遇小悟空
            },
        },
[32919]={
            {
                mapId = 3,x = -53,y = 327,z = 25,     --(庐山)奇遇圣斗士候补生
            },
        },
[32964]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32965]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32966]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32967]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32968]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32969]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32970]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32971]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32972]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32973]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32974]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32975]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32976]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32977]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[32978]={
            {
                mapId = 2,x = -194.53,y = 338,z = 38.15,     --(圣域)PK赛发票员
            },
        },
[33193]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33194]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33195]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33196]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33197]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33198]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33199]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33200]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33201]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33202]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33203]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33204]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33205]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33206]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[33207]={
            {
                mapId = 2,x = -195.45,y = 338,z = 35.23,     --(圣域)PK赛入场大使
            },
        },
[17340]={
            {
                mapId = 2,x = -268,y = 333,z = 232,     --(圣域)爱宠物的阿乐弥
            },
        },
[31592]={
            {
                mapId = 2,x = -239,y = 337,z = 74,     --(圣域)奇遇任务总指挥官
            },
        },
[32534]={
            {
                mapId = 3,x = -108,y = 326,z = 21,     --(职业任务)艾欧里亚
            },
        },
[32537]={
            {
                mapId = 3,x = -206,y = 321,z = -155,     --(职业任务)沙加
            },
        },
[32540]={
            {
                mapId = 3,x = -266,y = 321,z = -83,     --(职业任务)卡妙
            },
        },
[32543]={
            {
                mapId = 3,x = -217,y = 319,z = -108,     --(职业任务)魔铃
            },
        },
[32546]={
            {
                mapId = 3,x = -227,y = 319,z = -157,     --(职业任务)珍妮
            },
        },
[33262]={
            {
                mapId = 2,x = -225.55,y = 337,z = 67,     --(圣域)莫尔
            },
        },
[33494]={
            {
                mapId = 2,x = -229.844,y = 338.777,z = 2.06087,     --(圣域)七夕活动兑换NPC
            },
        },
[32801]={
            {
                mapId = 8,x = -43.5651,y = 336.513,z = 31.4191,     --(亚特兰蒂斯)亚特兰蒂斯支线补01爱丽
            },
        },
[32802]={
            {
                mapId = 8,x = 5.4094,y = 330.608,z = -250.601,     --(亚特兰蒂斯)亚特兰迪斯支线补02先知
            },
        },
[32803]={
            {
                mapId = 8,x = 62.1409,y = 338.055,z = -338.322,     --(亚特兰蒂斯)亚特兰迪斯支线补03曼尼1
            },
        },
[32804]={
            {
                mapId = 8,x = 73.5058,y = 338.934,z = -338.139,     --(亚特兰蒂斯)亚特兰蒂斯支线补04曼尼2
            },
        },
[32805]={
            {
                mapId = 8,x = 81.138,y = 338.303,z = -383.422,     --(亚特兰蒂斯)亚特兰蒂斯支线补05塞壬女王
            },
        },
[32806]={
            {
                mapId = 8,x = 224.225,y = 358.668,z = -352.589,     --(亚特兰蒂斯)亚特兰蒂斯支线补06泰格
            },
        },
[32807]={
            {
                mapId = 8,x = 396.799,y = 390.582,z = -356.708,     --(亚特兰蒂斯)亚特兰蒂斯支线补07巴克
            },
        },
[32808]={
            {
                mapId = 8,x = 394.759,y = 347.37,z = -195.509,     --(亚特兰蒂斯)亚特兰蒂斯支线补08希德1
            },
        },
[32809]={
            {
                mapId = 8,x = 385,y = 353.189,z = -97.8851,     --(亚特兰蒂斯)亚特兰蒂斯支线补09希德2
            },
        },
[32810]={
            {
                mapId = 8,x = 398.546,y = 359.778,z = -17.9777,     --(亚特兰蒂斯)亚特兰蒂斯支线补10麦克劳1
            },
        },
[32811]={
            {
                mapId = 8,x = 421.396,y = 360.129,z = 31.2964,     --(亚特兰蒂斯)亚特兰蒂斯支线补11麦克劳2
            },
        },
[32812]={
            {
                mapId = 8,x = 241.21,y = 346.998,z = -199.07,     --(亚特兰蒂斯)亚特兰蒂斯支线补12罗根1
            },
        },
[32813]={
            {
                mapId = 8,x = 154.931,y = 372.67,z = -129.59,     --(亚特兰蒂斯)亚特兰蒂斯支线补13罗根2
            },
        },
[32814]={
            {
                mapId = 8,x = 51.9081,y = 388.191,z = -82.7188,     --(亚特兰蒂斯)亚特兰蒂斯支线补14罗根3
            },
        },
[32815]={
            {
                mapId = 8,x = 225.145,y = 399.727,z = 11.8845,     --(亚特兰蒂斯)亚特兰蒂斯支线补15凯瑞1
            },
        },
[32816]={
            {
                mapId = 8,x = 225.145,y = 399.727,z = 11.8845,     --(亚特兰蒂斯)亚特兰蒂斯支线补16凯瑞2
            },
        },
[32817]={
            {
                mapId = 8,x = 237.424,y = 447.323,z = 274.077,     --(亚特兰蒂斯)亚特兰蒂斯支线补17祭师
            },
        },
[32818]={
            {
                mapId = 8,x = 260.987,y = 447.323,z = 327.645,     --(亚特兰蒂斯)亚特兰蒂斯支线补18本内特
            },
        },
[32819]={
            {
                mapId = 8,x = 182.208,y = 447.323,z = 339.953,     --(亚特兰蒂斯)亚特兰蒂斯支线补19艾妮
            },
        },
[32821]={
            {
                mapId = 8,x = 181.52,y = 447.43,z = 298.84,     --(亚特兰蒂斯)亚特兰蒂斯支线补20里奥
            },
        },
[32823]={
            {
                mapId = 8,x = 221.081,y = 455.459,z = 477.394,     --(亚特兰蒂斯)亚特兰蒂斯支线补21柯里
            },
        },
[32827]={
            {
                mapId = 8,x = 221.081,y = 455.459,z = 477.394,     --(亚特兰蒂斯)亚特兰蒂斯支线补22柯里
            },
        },
[32914]={
            {
                mapId = 8,x = -305.838,y = 383.599,z = 94.7716,     --(亚特兰蒂斯)亚特兰蒂斯支线补27大长老2
            },
        },
[33264]={
            {
                mapId = 7,x = -139.79,y = 318.7,z = -133,     --(环任务)206艾米莉1
            },
        },
[33265]={
            {
                mapId = 7,x = -150.41,y = 318.48,z = -146.89,     --(环任务)207艾米莉2
            },
        },
[33266]={
            {
                mapId = 7,x = -150.41,y = 318.48,z = -146.89,     --(环任务)208艾米莉3
            },
        },
[33267]={
            {
                mapId = 7,x = -151.35,y = 318.49,z = -142.94,     --(环任务)209克雷托
            },
        },
[33268]={
            {
                mapId = 7,x = -230.36,y = 297.08,z = -217.06,     --(环任务)210卡妙1
            },
        },
[33269]={
            {
                mapId = 7,x = -183.39,y = 296.76,z = -299.17,     --(环任务)211卡妙2
            },
        },
[33270]={
            {
                mapId = 7,x = -169.58,y = 317.21,z = -150.14,     --(环任务)212卡妙3
            },
        },
[33468]={
            {
                mapId = 7,x = -173.2,y = 296.76,z = -286.61,     --(环任务)213被浸染的白熊
            },
        },
[33561]={
            {
                mapId = 3,x = -109,y = 326,z = 21,     --(职业任务)狮子2
            },
        },
[33573]={
            {
                mapId = 3,x = -72,y = 314,z = 72,     --(职业任务)神秘人
            },
        },
[33915]={
            {
                mapId = 3,x = -226.958,y = 319.121,z = -121.996,     --(中秋活动)中秋_01醉千杯
            },
        },
[33916]={
            {
                mapId = 3,x = -271.82,y = 319.689,z = -69.229,     --(中秋活动)中秋_02少女阿秀
            },
        },
[33920]={
            {
                mapId = 3,x = -136.764,y = 483.069,z = 228.814,     --(中秋活动)中秋_03醉酒的老猴
            },
        },
[33921]={
            {
                mapId = 3,x = -160.283,y = 337.328,z = 20.4196,     --(中秋活动)中秋_04射手座圣衣
            },
        },
[33917]={
            {
                mapId = 2,x = -225.139,y = 339,z = 2.94717,     --(中秋活动-地宫)中秋活动-进地宫NPC
            },
        },
[34218]={
            {
                mapId = 36,x = 122.978,y = 298.072,z = 337.668,     --(中秋活动-地宫)中秋活动-地宫完成任务npc1
            },
        },
[34219]={
            {
                mapId = 36,x = 283.909,y = 304.491,z = 385.001,     --(中秋活动-地宫)中秋活动-地宫完成任务npc2
            },
        },
[34220]={
            {
                mapId = 36,x = 320.707,y = 298.618,z = -14.2656,     --(中秋活动-地宫)中秋活动-地宫完成任务npc3
            },
        },
[34221]={
            {
                mapId = 36,x = 421.327,y = 312.197,z = -256.096,     --(中秋活动-地宫)中秋活动-地宫完成任务npc4
            },
        },
[34222]={
            {
                mapId = 36,x = 442.907,y = 311.996,z = -298.211,     --(中秋活动-地宫)中秋活动-地宫完成任务npc5
            },
        },
[33799]={
            {
                mapId = 2,x = -156.63,y = 339.06,z = 422.76,     --(试炼地宫传送)试炼地宫传送npc
            },
        },
[34016]={
            {
                mapId = 10,x = 26.53,y = 299.15,z = 368.35,     --(猎人)海因斯坦堡猎人
            },
        },
[34240]={
            {
                mapId = 10,x = -233.18,y = 309.84,z = 384.55,     --(未点燃的火堆)未点燃的篝火
            },
        },
[34248]={
            {
                mapId = 2,x = -218,y = 350,z = 338,     --(狂欢大使)银河激斗篇M图NPC
            },
        },
[34249]={
            {
                mapId = 2,x = -217,y = 350,z = 336,     --(疯狂钱币收集员)银河激斗篇M图NPC
            },
        },
[34016]={
            {
                mapId = 10,x = 39,y = 299,z = 366,     --(海因斯坦堡)支线海因斯坦堡猎人克里斯
            },
        },
[33773]={
            {
                mapId = 26,x = 78.94,y = 296.07,z = 2.86,     --(26地宫中间传送)26地宫中间传送
            },
        },
[33778]={
            {
                mapId = 26,x = 219.08,y = 298.03,z = -143.19,     --(26地宫东南使者)26地宫东南使者
            },
        },
[33779]={
            {
                mapId = 26,x = -77.1,y = 299.67,z = -66.75,     --(26地宫西南使者)26地宫西南使者
            },
        },
[33780]={
            {
                mapId = 26,x = 259.88,y = 295.75,z = 25.61,     --(26地宫东北使者)26地宫东北使者
            },
        },
[33781]={
            {
                mapId = 26,x = -38.11,y = 296.02,z = 96.6,     --(26地宫西北使者)26地宫西北使者
            },
        },
[33774]={
            {
                mapId = 27,x = 78.94,y = 296.07,z = 2.86,     --(27地宫中间传送)27地宫中间传送
            },
        },
[33782]={
            {
                mapId = 27,x = 219.08,y = 298.03,z = -143.19,     --(27地宫东南使者)27地宫东南使者
            },
        },
[33783]={
            {
                mapId = 27,x = -77.1,y = 299.67,z = -66.75,     --(27地宫西南使者)27地宫西南使者
            },
        },
[33784]={
            {
                mapId = 27,x = 259.88,y = 295.75,z = 25.61,     --(27地宫东北使者)27地宫东北使者
            },
        },
[33785]={
            {
                mapId = 27,x = -38.11,y = 296.02,z = 96.6,     --(27地宫西北使者)27地宫西北使者
            },
        },
[33775]={
            {
                mapId = 28,x = 78.94,y = 296.07,z = 2.86,     --(28地宫中间传送)28地宫中间传送
            },
        },
[33786]={
            {
                mapId = 28,x = 219.08,y = 298.03,z = -143.19,     --(28地宫东南使者)28地宫东南使者
            },
        },
[33787]={
            {
                mapId = 28,x = -77.1,y = 299.67,z = -66.75,     --(28地宫西南使者)28地宫西南使者
            },
        },
[33788]={
            {
                mapId = 28,x = 259.88,y = 295.75,z = 25.61,     --(28地宫东北使者)28地宫东北使者
            },
        },
[33789]={
            {
                mapId = 28,x = -38.11,y = 296.02,z = 96.6,     --(28地宫西北使者)28地宫西北使者
            },
        },
[33776]={
            {
                mapId = 29,x = 78.94,y = 296.07,z = 2.86,     --(29地宫中间传送)29地宫中间传送
            },
        },
[33790]={
            {
                mapId = 29,x = 219.08,y = 298.03,z = -143.19,     --(29地宫东南使者)29地宫东南使者
            },
        },
[33791]={
            {
                mapId = 29,x = -77.1,y = 299.67,z = -66.75,     --(29地宫西南使者)29地宫西南使者
            },
        },
[33792]={
            {
                mapId = 29,x = 259.88,y = 295.75,z = 25.61,     --(29地宫东北使者)29地宫东北使者
            },
        },
[33793]={
            {
                mapId = 29,x = -38.11,y = 296.02,z = 96.6,     --(29地宫西北使者)29地宫西北使者
            },
        },
[33777]={
            {
                mapId = 30,x = 78.94,y = 296.07,z = 2.86,     --(30地宫中间传送)30地宫中间传送
            },
        },
[33794]={
            {
                mapId = 30,x = 219.08,y = 298.03,z = -143.19,     --(30地宫东南使者)30地宫东南使者
            },
        },
[33795]={
            {
                mapId = 30,x = -77.1,y = 299.67,z = -66.75,     --(30地宫西南使者)30地宫西南使者
            },
        },
[33796]={
            {
                mapId = 30,x = 259.88,y = 295.75,z = 25.61,     --(30地宫东北使者)30地宫东北使者
            },
        },
[33797]={
            {
                mapId = 30,x = -38.11,y = 296.02,z = 96.6,     --(30地宫西北使者)30地宫西北使者
            },
        },
[34033]={
            {
                mapId = 31,x = 78.94,y = 296.07,z = 2.86,     --(31地宫中间传送)31地宫中间传送
            },
        },
[34034]={
            {
                mapId = 31,x = 219.08,y = 298.03,z = -143.19,     --(31地宫东南使者)31地宫东南使者
            },
        },
[34035]={
            {
                mapId = 31,x = -77.1,y = 299.67,z = -66.75,     --(31地宫西南使者)31地宫西南使者
            },
        },
[34036]={
            {
                mapId = 31,x = 259.88,y = 295.75,z = 25.61,     --(31地宫东北使者)31地宫东北使者
            },
        },
[34037]={
            {
                mapId = 31,x = -38.11,y = 296.02,z = 96.6,     --(31地宫西北使者)31地宫西北使者
            },
        },
[33976]={
            {
                mapId = 2,x = 161.59,y = 333.7,z = 392.86,     --(觉醒！沙加的六道)觉醒！沙加的六道-沙加
            },
        },
[34575]={
            {
                mapId = 2,x = -249.52,y = 337.51,z = 5.55,     --(圣域)圣域师徒说明
            },
        },
[34576]={
            {
                mapId = 2,x = -250.62,y = 337.51,z = 5.97,     --(圣域)圣域师徒奖励兑换
            },
        },
[34595]={
            {
                mapId = 2,x = 160.14,y = 334.04,z = 395.86,     --(觉醒！沙加的六道)沙加的侍从
            },
        },
[34688]={
            {
                mapId = 2,x = -194.02,y = 337.48,z = 67.11,     --(觉醒！沙加的六道)沙罗树叶兑换大使
            },
        },
[34694]={
            {
                mapId = 2,x = -218.14,y = 350.42,z = 340.714,     --(圣域)资料片领奖NPC
            },
        },
[34702]={
            {
                mapId = 2,x = -182,y = 339,z = 397,     --(圣域)披风兑换
            },
        },
[33799]={
            {
                mapId = 2,x = -156.93,y = 339.07,z = 420.35,     --(圣域)圣域_试炼幻境传送使者
            },
        },
[14841]={
            {
                mapId = 2,x = -236.02,y = 338.79,z = 3.29,     --(圣域)圣域潘多拉
            },
        },
[34223]={
            {
                mapId = 2,x = -203.79,y = 337.47,z = 16.25,     --(圣域)神战点商店
            },
            {
                mapId = 2,x = -195.6,y = 339.2,z = 385.68,     --(圣域)神战点商店
            },
        },
[34890]={
            {
                mapId = 2,x = -217,y = 350,z = 340,     --(圣域)国庆狂欢使者
            },
        },
[34898]={
            {
                mapId = 2,x = -248.89,y = 337.48,z = 89.23,     --(圣域)黄金圣衣兑换
            },
        },
[34802]={
            {
                mapId = 9,x = -369.27,y = 302.582,z = 227.909,     --(仙女岛)仙女岛支线补01莉儿1
            },
        },
[34803]={
            {
                mapId = 9,x = -399.114,y = 315.989,z = 256.703,     --(仙女岛)仙女岛支线补02莉儿2
            },
        },
[34804]={
            {
                mapId = 9,x = -72.7301,y = 332.686,z = 128.507,     --(仙女岛)仙女岛支线补03瑞希1
            },
        },
[34805]={
            {
                mapId = 9,x = -49.0862,y = 332.827,z = 208.399,     --(仙女岛)仙女岛支线补04瑞希2
            },
        },
[34806]={
            {
                mapId = 9,x = -52.1602,y = 335.521,z = 216.135,     --(仙女岛)仙女岛支线补05安德洛美达
            },
        },
[34807]={
            {
                mapId = 9,x = 46.344,y = 333.278,z = 52.3157,     --(仙女岛)仙女岛支线补06柏图1
            },
        },
[34808]={
            {
                mapId = 9,x = 149.791,y = 330.978,z = -12.773,     --(仙女岛)仙女岛支线补07柏图2
            },
        },
[34809]={
            {
                mapId = 9,x = 293.839,y = 340.959,z = 219.847,     --(仙女岛)仙女岛支线补08柏图3
            },
        },
[34810]={
            {
                mapId = 9,x = 251.7,y = 356.599,z = 115.182,     --(仙女岛)仙女岛支线补09普修1
            },
        },
[34811]={
            {
                mapId = 9,x = 296.43,y = 340.928,z = 217.378,     --(仙女岛)仙女岛支线补10普修2
            },
        },
[34812]={
            {
                mapId = 9,x = 291.251,y = 340.949,z = 216.342,     --(仙女岛)仙女岛支线补11妮娜
            },
        },
[34813]={
            {
                mapId = 9,x = 174.794,y = 327.786,z = -81.1215,     --(仙女岛)仙女岛支线补12亚当斯
            },
        },
[34814]={
            {
                mapId = 9,x = 351.505,y = 320.504,z = -229.599,     --(仙女岛)仙女岛支线补13杰弗逊
            },
        },
[35400]={
            {
                mapId = 2,x = 61.4678,y = 294.07,z = 21.0701,     --(圣战夜！童虎的记忆)童虎的侍从
            },
        },
[35392]={
            {
                mapId = 2,x = -194.306,y = 337.481,z = 64.4877,     --(圣战夜！童虎的记忆)庐山学徒
            },
        },
[34970]={
            {
                mapId = 2,x = 61.59,y = 295,z = 18.51,     --(圣战夜！童虎的记忆)童虎
            },
        },
[27365]={
            {
                mapId = 2,x = -236.58,y = 350.31,z = 303.42,     --(圣域)阿甘
            },
        },
[35465]={
            {
                mapId = 2,x = -214.887,y = 337.481,z = 53.7695,     --(圣域)万圣节贵鬼
            },
        },
[35466]={
            {
                mapId = 2,x = -143.853,y = 322.335,z = 109.908,     --(圣域)万圣节小女孩
            },
        },
[35467]={
            {
                mapId = 2,x = -136.927,y = 325.94,z = 19.747,     --(圣域)万圣节小男孩
            },
        },
[34994]={
            {
                mapId = 11,x = 228,y = 426,z = 16,     --(冥界下篇)冥界下篇01血池入口冰河
            },
        },
[34995]={
            {
                mapId = 11,x = 228,y = 426,z = 18,     --(冥界下篇)冥界下篇02血池入口紫龙
            },
        },
[34996]={
            {
                mapId = 11,x = 347,y = 435,z = 183,     --(冥界下篇)冥界下篇03血池入口天捷星选择前
            },
        },
[34997]={
            {
                mapId = 11,x = 347,y = 435,z = 183,     --(冥界下篇)冥界下篇04血池入口天捷星选择后
            },
        },
[34998]={
            {
                mapId = 11,x = 408,y = 422,z = 111,     --(冥界下篇)冥界下篇05血池奇怪的石块
            },
        },
[34999]={
            {
                mapId = 11,x = 408,y = 422,z = 111,     --(冥界下篇)冥界下篇06血池小蝙蝠
            },
        },
[35000]={
            {
                mapId = 11,x = 408,y = 422,z = 111,     --(冥界下篇)冥界下篇07血池小蝙蝠使用物品
            },
        },
[35001]={
            {
                mapId = 11,x = 408,y = 422,z = 111,     --(冥界下篇)冥界下篇08血池雷虎比试前
            },
        },
[35002]={
            {
                mapId = 11,x = 408,y = 422,z = 111,     --(冥界下篇)冥界下篇09血池雷虎比试后
            },
        },
[35003]={
            {
                mapId = 11,x = 399,y = 426,z = 35,     --(冥界下篇)冥界下篇10血池出口天捷星
            },
        },
[35004]={
            {
                mapId = 11,x = 406,y = 425,z = 41,     --(冥界下篇)冥界下篇11血池出口雷虎
            },
        },
[35005]={
            {
                mapId = 11,x = 453,y = 422,z = 73,     --(冥界下篇)冥界下篇12血池出口潘多拉
            },
        },
[35006]={
            {
                mapId = 11,x = 517,y = 426,z = 80,     --(冥界下篇)冥界下篇13热砂入口冰河
            },
        },
[35007]={
            {
                mapId = 11,x = 495,y = 426,z = 108,     --(冥界下篇)冥界下篇14热砂入口石碑
            },
        },
[35008]={
            {
                mapId = 11,x = 495,y = 426,z = 108,     --(冥界下篇)冥界下篇15热砂入口贪婪
            },
        },
[35009]={
            {
                mapId = 11,x = 539,y = 426,z = 129,     --(冥界下篇)冥界下篇16热砂中部路人
            },
        },
[35010]={
            {
                mapId = 11,x = 592,y = 426,z = 141,     --(冥界下篇)冥界下篇17热砂中部假冰河
            },
        },
[35011]={
            {
                mapId = 11,x = 539,y = 426,z = 129,     --(冥界下篇)冥界下篇18热砂中部贪婪
            },
        },
[35012]={
            {
                mapId = 11,x = 599,y = 426,z = 139,     --(冥界下篇)冥界下篇19热砂中部冥王神衣
            },
        },
[35013]={
            {
                mapId = 11,x = 597,y = 426,z = 142,     --(冥界下篇)冥界下篇20热砂中部贪婪再现
            },
        },
[35014]={
            {
                mapId = 11,x = 457,y = 422,z = 265,     --(冥界下篇)冥界下篇21森林初紫龙
            },
        },
[35015]={
            {
                mapId = 11,x = 457,y = 422,z = 267,     --(冥界下篇)冥界下篇22森林饥饿的灵魂
            },
        },
[35016]={
            {
                mapId = 11,x = 533,y = 438,z = 289,     --(冥界下篇)冥界下篇23森林地恶星
            },
        },
[35017]={
            {
                mapId = 11,x = 530,y = 438,z = 285,     --(冥界下篇)冥界下篇24森林末紫龙
            },
        },
[35018]={
            {
                mapId = 11,x = 592,y = 430,z = 197,     --(冥界下篇)冥界下篇25热砂末端冰河1
            },
        },
[35019]={
            {
                mapId = 11,x = 623,y = 452,z = 261,     --(冥界下篇)冥界下篇26热砂末端冰河2
            },
        },
[35020]={
            {
                mapId = 11,x = 725,y = 432,z = 280,     --(冥界下篇)冥界下篇27群蛇昏迷的灵魂
            },
        },
[35021]={
            {
                mapId = 11,x = 725,y = 432,z = 280,     --(冥界下篇)冥界下篇28群蛇入口鲁邦昏迷
            },
        },
[35022]={
            {
                mapId = 11,x = 800,y = 418,z = 207,     --(冥界下篇)冥界下篇29群蛇中部鲁邦战斗前
            },
        },
[35023]={
            {
                mapId = 11,x = 802,y = 417,z = 206,     --(冥界下篇)冥界下篇30群蛇中部鲁琪昏迷
            },
        },
[35024]={
            {
                mapId = 11,x = 800,y = 418,z = 207,     --(冥界下篇)冥界下篇31群蛇中部鲁邦战斗后
            },
        },
[35025]={
            {
                mapId = 11,x = 802,y = 417,z = 206,     --(冥界下篇)冥界下篇32群蛇中部鲁琪苏醒
            },
        },
[35026]={
            {
                mapId = 11,x = 825,y = 416,z = 229,     --(冥界下篇)冥界下篇33群蛇中心鲁邦
            },
        },
[35027]={
            {
                mapId = 11,x = 933,y = 442,z = 410,     --(冥界下篇)冥界下篇34群蛇中心天牢星
            },
        },
[35028]={
            {
                mapId = 11,x = 894,y = 430,z = 411,     --(冥界下篇)冥界下篇35群蛇中心鲁邦狂风边
            },
        },
[35029]={
            {
                mapId = 11,x = 802,y = 413,z = 417,     --(冥界下篇)冥界下篇36深渊入口赫尔墨斯灵魂
            },
        },
[35030]={
            {
                mapId = 11,x = 727,y = 385,z = 481,     --(冥界下篇)冥界下篇37深渊中罗德里奥
            },
        },
[35031]={
            {
                mapId = 11,x = 815,y = 399,z = 773,     --(冥界下篇)冥界下篇38寒冰星矢昏迷使用前
            },
        },
[35032]={
            {
                mapId = 11,x = 819,y = 399,z = 776,     --(冥界下篇)冥界下篇39寒冰穆昏迷
            },
        },
[35033]={
            {
                mapId = 11,x = 816,y = 399,z = 777,     --(冥界下篇)冥界下篇40寒冰米罗昏迷
            },
        },
[35034]={
            {
                mapId = 11,x = 814,y = 399,z = 777,     --(冥界下篇)冥界下篇41寒冰艾欧里亚昏迷
            },
        },
[35035]={
            {
                mapId = 11,x = 809,y = 400,z = 772,     --(冥界下篇)冥界下篇42寒冰天哭星
            },
        },
[35036]={
            {
                mapId = 11,x = 815,y = 399,z = 773,     --(冥界下篇)冥界下篇43寒冰星矢昏迷使用时
            },
        },
[35037]={
            {
                mapId = 11,x = 815,y = 399,z = 773,     --(冥界下篇)冥界下篇44寒冰星矢苏醒
            },
        },
[35038]={
            {
                mapId = 11,x = 815,y = 399,z = 773,     --(冥界下篇)冥界下篇45寒冰星矢战斗后
            },
        },
[35039]={
            {
                mapId = 11,x = 720,y = 401,z = 824,     --(冥界下篇)冥界下篇46寒冰星矢传送阵旁
            },
        },
[35040]={
            {
                mapId = 11,x = -548,y = 823,z = 157,     --(冥界下篇)冥界下篇47该隐厅星矢
            },
        },
[35041]={
            {
                mapId = 11,x = -681,y = 913,z = 832,     --(冥界下篇)冥界下篇48犹大厅瞬昏迷
            },
        },
[35042]={
            {
                mapId = 11,x = -681,y = 913,z = 832,     --(冥界下篇)冥界下篇49犹大厅瞬苏醒
            },
        },
[35043]={
            {
                mapId = 11,x = -716,y = 914,z = 803,     --(冥界下篇)冥界下篇50犹大厅星矢
            },
        },
[35044]={
            {
                mapId = 11,x = -591,y = 931,z = 903,     --(冥界下篇)冥界下篇51叹息墙沙加
            },
        },
[35045]={
            {
                mapId = 11,x = -591,y = 931,z = 896,     --(冥界下篇)冥界下篇52叹息墙瞬
            },
        },
[35046]={
            {
                mapId = 11,x = -593,y = 931,z = 898,     --(冥界下篇)冥界下篇53叹息墙星矢
            },
        },
[35047]={
            {
                mapId = 11,x = -596,y = 931,z = 899,     --(冥界下篇)冥界下篇54叹息墙童虎
            },
        },
[35048]={
            {
                mapId = 11,x = -707,y = 914,z = 804,     --(冥界下篇)冥界下篇55犹大厅外星矢
            },
        },
[35049]={
            {
                mapId = 11,x = -707,y = 914,z = 804,     --(冥界下篇)冥界下篇56犹大厅外瞬
            },
        },
[35050]={
            {
                mapId = 11,x = -597,y = 931,z = 903,     --(冥界下篇)冥界下篇57叹息墙紫龙赶到
            },
        },
[35051]={
            {
                mapId = 11,x = -593,y = 931,z = 898,     --(冥界下篇)冥界下篇58叹息墙星矢墙碎后
            },
        },
[35052]={
            {
                mapId = 11,x = -600,y = 931,z = 905,     --(冥界下篇)冥界下篇59叹息墙冰河赶到
            },
        },
[35053]={
            {
                mapId = 11,x = -591,y = 931,z = 896,     --(冥界下篇)冥界下篇60叹息墙瞬墙碎后
            },
        },
[35054]={
            {
                mapId = 11,x = -597,y = 931,z = 903,     --(冥界下篇)冥界下篇61叹息墙紫龙战斗后
            },
        },
[35055]={
            {
                mapId = 11,x = -583,y = 931,z = 906,     --(冥界下篇)冥界下篇62叹息墙一辉墙碎后
            },
        },
[35056]={
            {
                mapId = 11,x = -586,y = 931,z = 906,     --(冥界下篇)冥界下篇63叹息墙潘多拉站立
            },
        },
[35057]={
            {
                mapId = 11,x = -586,y = 931,z = 906,     --(冥界下篇)冥界下篇64叹息墙潘多拉死亡
            },
        },
[35058]={
            {
                mapId = 11,x = -583,y = 931,z = 906,     --(冥界下篇)冥界下篇65叹息墙一辉战斗后
            },
        },
[35988]={
            {
                mapId = 11,x = 815,y = 399,z = 773,     --(冥界下篇)冥界下篇72寒冰星矢昏迷使用后
            },
        },
[35963]={
            {
                mapId = 11,x = 522,y = 426,z = 85,     --(冥界下篇)冥界下篇迷茫的灵魂
            },
        },
[34065]={
            {
                mapId = 11,x = 978,y = 299,z = -731,     --(冥界)冥界_主线01_童虎
            },
        },
[34066]={
            {
                mapId = 11,x = 928,y = 298,z = -882,     --(冥界)冥界_主线02_徘徊的灵魂
            },
        },
[34067]={
            {
                mapId = 11,x = 847,y = 305,z = -888,     --(冥界)冥界_主线03_绝望守卫
            },
        },
[34068]={
            {
                mapId = 11,x = 723,y = 299,z = -844,     --(冥界)冥界_主线04_绝望的灵魂
            },
        },
[34069]={
            {
                mapId = 11,x = 687,y = 304,z = -797,     --(冥界)冥界_主线05_卡戎1
            },
        },
[34070]={
            {
                mapId = 11,x = 687,y = 304,z = -797,     --(冥界)冥界_主线06_卡戎2
            },
        },
[34071]={
            {
                mapId = 11,x = 568,y = 302,z = -751,     --(冥界)冥界_主线07_卡戎3
            },
        },
[34072]={
            {
                mapId = 11,x = 502,y = 299,z = -804,     --(冥界)冥界_主线08_库托斯
            },
        },
[34073]={
            {
                mapId = 11,x = 498,y = 299,z = -797,     --(冥界)冥界_主线09_琉刻
            },
        },
[34074]={
            {
                mapId = 11,x = 499,y = 299,z = -801,     --(冥界)冥界_主线10_明塔
            },
        },
[34075]={
            {
                mapId = 11,x = 499,y = 299,z = -801,     --(冥界)冥界_主线11_明塔2
            },
        },
[34076]={
            {
                mapId = 11,x = 509,y = 299,z = -780,     --(冥界)冥界_主线12_沙加
            },
        },
[34077]={
            {
                mapId = 11,x = 510,y = 299,z = -793,     --(冥界)冥界_主线13_城户纱织
            },
        },
[34078]={
            {
                mapId = 11,x = 488,y = 304,z = -815,     --(冥界)冥界_主线14_卡妙的灵魂
            },
        },
[34079]={
            {
                mapId = 11,x = 487,y = 304,z = -808,     --(冥界)冥界_主线15_修罗的灵魂
            },
        },
[34080]={
            {
                mapId = 11,x = 606,y = 299,z = -569,     --(冥界)冥界_主线16_被缚的灵魂
            },
        },
[34081]={
            {
                mapId = 11,x = 567,y = 311,z = -423,     --(冥界)冥界_主线17_审判厅守卫
            },
        },
[34082]={
            {
                mapId = 11,x = 562,y = 324,z = -369,     --(冥界)冥界_主线18_星矢
            },
        },
[34083]={
            {
                mapId = 11,x = 556,y = 324,z = -371,     --(冥界)冥界_主线19_瞬
            },
        },
[34084]={
            {
                mapId = 11,x = 556,y = 324,z = -359,     --(冥界)冥界_主线20_路尼
            },
        },
[34085]={
            {
                mapId = 11,x = 313,y = 305,z = -458,     --(冥界)冥界_主线21_星矢2
            },
        },
[34086]={
            {
                mapId = 11,x = 320,y = 305,z = -459,     --(冥界)冥界_主线22_瞬2
            },
        },
[34087]={
            {
                mapId = 11,x = 310,y = 304,z = -471,     --(冥界)冥界_主线23_加隆
            },
        },
[34088]={
            {
                mapId = 11,x = -101,y = 273,z = -759,     --(冥界)冥界_主线24_尤利缇斯
            },
        },
[34089]={
            {
                mapId = 11,x = -102,y = 273,z = -760,     --(冥界)冥界_主线25_奥路菲
            },
        },
[34090]={
            {
                mapId = 11,x = 270,y = 306,z = -548,     --(冥界)冥界_主线26_星矢3
            },
        },
[34091]={
            {
                mapId = 11,x = 274,y = 306,z = -550,     --(冥界)冥界_主线27_瞬3
            },
        },
[34092]={
            {
                mapId = 11,x = -94,y = 273,z = -764,     --(冥界)冥界_主线28_法拉奥2
            },
        },
[34093]={
            {
                mapId = 11,x = 169,y = 274,z = -846,     --(冥界)冥界_主线29_推石罪囚
            },
        },
[34094]={
            {
                mapId = 11,x = 318,y = 305,z = -772,     --(冥界)冥界_主线30_推石罪囚2
            },
        },
[34095]={
            {
                mapId = 11,x = 323,y = 306,z = -677,     --(冥界)冥界_主线31_紫龙
            },
        },
[34096]={
            {
                mapId = 11,x = 320,y = 306,z = -679,     --(冥界)冥界_主线32_冰河
            },
        },
[34097]={
            {
                mapId = 11,x = 323,y = 306,z = -677,     --(冥界)冥界_主线33_紫龙2
            },
        },
[34098]={
            {
                mapId = 11,x = 320,y = 306,z = -679,     --(冥界)冥界_主线34_冰河2
            },
        },
[34099]={
            {
                mapId = 11,x = -139,y = 276,z = -555,     --(冥界)冥界_主线35_紫龙3
            },
        },
[34100]={
            {
                mapId = 11,x = -133,y = 276,z = -551,     --(冥界)冥界_主线36_冰河3
            },
        },
[34101]={
            {
                mapId = 11,x = -141,y = 276,z = -541,     --(冥界)冥界_主线37_天罪星
            },
        },
[34102]={
            {
                mapId = 11,x = -139,y = 276,z = -546,     --(冥界)冥界_主线38_加隆2
            },
        },
[34103]={
            {
                mapId = 11,x = -173,y = 279,z = -247,     --(冥界)冥界_主线39_加隆3
            },
        },
[34104]={
            {
                mapId = 11,x = -155,y = 298,z = -196,     --(冥界)冥界_主线40_史昂的灵魂
            },
        },
[34105]={
            {
                mapId = 11,x = -60,y = 291,z = -63,     --(冥界)冥界_主线41_大地之子
            },
        },
[34106]={
            {
                mapId = 11,x = 303,y = 307,z = -485,     --(冥界)冥界_主线42_拉达曼提斯1
            },
        },
[34107]={
            {
                mapId = 11,x = -172,y = 279,z = -243,     --(冥界)冥界_主线43_拉达曼提斯2
            },
        },
[34647]={
            {
                mapId = 11,x = 897,y = 299,z = -957,     --(冥界)冥界_主线44_迷途的亡魂
            },
        },
[34658]={
            {
                mapId = 11,x = 872,y = 303,z = -888,     --(冥界)冥界_主线45_迷途的亡魂2
            },
        },
[35433]={
            {
                mapId = 11,x = 278,y = 310,z = -536,     --(冥界)冥界_主线46_法拉奥
            },
        },
[35436]={
            {
                mapId = 11,x = -97,y = 273,z = -756,     --(冥界)冥界_主线47_星矢4
            },
        },
[35439]={
            {
                mapId = 11,x = -95,y = 273,z = -756,     --(冥界)冥界_主线48_瞬4
            },
        },
[35500]={
            {
                mapId = 11,x = -141,y = 297,z = -135,     --(冥界)冥界_主线49_前代天马
            },
        },
[35923]={
            {
                mapId = 11,x = -176,y = 279,z = -248,     --(冥界)冥界_主线50_紫龙4
            },
        },
[35926]={
            {
                mapId = 11,x = -171,y = 278,z = -249,     --(冥界)冥界_主线51_冰河4
            },
        },
[36018]={
            {
                mapId = 11,x = -179,y = 310,z = 117,     --(冥界)冥界表现_六天星1
            },
        },
[36019]={
            {
                mapId = 11,x = -176,y = 310,z = 116,     --(冥界)冥界表现_六天星2
            },
        },
[36020]={
            {
                mapId = 11,x = -173,y = 310,z = 118,     --(冥界)冥界表现_六天星3
            },
        },
[36021]={
            {
                mapId = 11,x = -173,y = 310,z = 121,     --(冥界)冥界表现_六天星4
            },
        },
[36022]={
            {
                mapId = 11,x = -176,y = 310,z = 122,     --(冥界)冥界表现_六天星5
            },
        },
[36023]={
            {
                mapId = 11,x = -179,y = 310,z = 121,     --(冥界)冥界表现_六天星6
            },
        },
[28327]={
            {
                mapId = 2,x = -421.8,y = 357.3,z = 284.8,     --(圣域)女神的挽歌后入口
            },
        },
[36329]={
            {
                mapId = 2,x = -193,y = 337,z = 86,     --(圣域)神器相关Npc
            },
        },
[37258]={
            {
                mapId = 2,x = -256,y = 357,z = 334,     --(圣域)感恩节_雅典娜
            },
        },
[37256]={
            {
                mapId = 2,x = -182,y = 339,z = 275,     --(圣域)感恩节_穷苦百姓2
            },
        },
[37255]={
            {
                mapId = 2,x = -107,y = 323,z = 70,     --(圣域)感恩节_穷苦百姓1
            },
        },
[37257]={
            {
                mapId = 2,x = -227,y = 337,z = 50,     --(圣域)感恩节_穷苦百姓3
            },
        },
[37276]={
            {
                mapId = 10,x = -280,y = 459,z = -262,     --(冥界)冥界_主线_开始
            },
        },
[37216]={
            {
                mapId = 2,x = -217,y = 350,z = 339,     --(圣域)感恩小厨娘
            },
        },
[36454]={
            {
                mapId = 2,x = 97.47,y = 291.61,z = 197.23,     --(月度日常天蝎)月度日常天蝎-米罗
            },
        },
[37275]={
            {
                mapId = 2,x = -194.68,y = 337.51,z = 63.84,     --(月度日常天蝎)月度日常天蝎-兑换使者
            },
        },
[36528]={
            {
                mapId = 2,x = -196.5,y = 337.5,z = 31.7,     --(圣域)第一届跨服竞技赛报名大使
            },
        },
[37315]={
            {
                mapId = 2,x = -246.146,y = 350.307,z = 279.196,     --(圣域)传记任务圣域内米罗
            },
        },
[37316]={
            {
                mapId = 2,x = -31.4311,y = 297.088,z = 303.34,     --(圣域)传记任务圣域外养蝎人
            },
        },
[37317]={
            {
                mapId = 2,x = -32.6459,y = 296.947,z = 305.936,     --(圣域)传记任务圣域外米罗战斗前
            },
        },
[37318]={
            {
                mapId = 2,x = -32.6459,y = 296.947,z = 305.936,     --(圣域)传记任务圣域外米罗战斗后
            },
        },
[37378]={
            {
                mapId = 7,x = -261.459,y = 305.573,z = 20.9685,     --(东西伯利亚)传记任务雪落村双鱼守卫
            },
        },
[37394]={
            {
                mapId = 7,x = -389.158,y = 376.132,z = -87.3041,     --(东西伯利亚)传记任务冰壁双鱼守卫
            },
        },
[37379]={
            {
                mapId = 7,x = -390.369,y = 376.492,z = -85.8836,     --(东西伯利亚)传记任务双鱼座圣衣
            },
        },
[37381]={
            {
                mapId = 7,x = -391.997,y = 376.132,z = -86.8771,     --(东西伯利亚)传记任务阿布罗狄战斗后
            },
        },
[37380]={
            {
                mapId = 7,x = -391.997,y = 376.132,z = -86.8771,     --(东西伯利亚)传记任务阿布罗狄战斗前
            },
        },
[41995]={
            {
                mapId = 11,x = 930.04,y = 298.86,z = -887.52,     --(冥界地狱传送师)传送师-地狱大门
            },
            {
                mapId = 11,x = 704.52,y = 299.6,z = -807.51,     --(冥界地狱传送师)传送师-船夫渡口
            },
            {
                mapId = 11,x = 552.03,y = 298.6,z = -746.56,     --(冥界地狱传送师)传送师-裁判之厅·前
            },
            {
                mapId = 11,x = 563.19,y = 324.55,z = -395.89,     --(冥界地狱传送师)传送师-裁判之厅
            },
            {
                mapId = 11,x = 215.96,y = 299.03,z = -293.06,     --(冥界地狱传送师)传送师-黑风地狱
            },
            {
                mapId = 11,x = 174.58,y = 299.34,z = -547.69,     --(冥界地狱传送师)传送师-岩石地狱
            },
            {
                mapId = 11,x = -86.1,y = 271.83,z = -788.13,     --(冥界地狱传送师)传送师-特赦花园
            },
            {
                mapId = 11,x = -153.98,y = 276.32,z = -489.36,     --(冥界地狱传送师)传送师-泥沼地狱
            },
            {
                mapId = 11,x = -171.01,y = 283.47,z = -223.1,     --(冥界地狱传送师)传送师-火海地狱
            },
            {
                mapId = 11,x = 260.3,y = 426.59,z = 33.74,     --(冥界地狱传送师)传送师-血池地狱
            },
            {
                mapId = 11,x = 512.02,y = 426.22,z = 78.6,     --(冥界地狱传送师)传送师-热砂地狱
            },
            {
                mapId = 11,x = 898.88,y = 409.35,z = 286.89,     --(冥界地狱传送师)传送师-群蛇地狱
            },
            {
                mapId = 11,x = 723.9,y = 396.83,z = 537.13,     --(冥界地狱传送师)传送师-背神者深渊
            },
            {
                mapId = 11,x = 874.42,y = 400.15,z = 757.4,     --(冥界地狱传送师)传送师-寒冰地狱
            },
            {
                mapId = 11,x = -557.11,y = 823.77,z = 164.29,     --(冥界地狱传送师)传送师-该隐之厅·前
            },
            {
                mapId = 11,x = -730.76,y = 824.41,z = 297.5,     --(冥界地狱传送师)传送师-该隐之厅
            },
            {
                mapId = 11,x = -845.38,y = 850.06,z = 600.45,     --(冥界地狱传送师)传送师-安第诺拉之厅
            },
            {
                mapId = 11,x = -553.21,y = 866.87,z = 681.73,     --(冥界地狱传送师)传送师-多罗梅之厅
            },
            {
                mapId = 11,x = -578.28,y = 930.98,z = 949.91,     --(冥界地狱传送师)传送师-叹息之墙
            },
        },
[36040]={
            {
                mapId = 11,x = 930.04,y = 298.86,z = -887.52,     --(冥界地狱)传送师-地狱大门
            },
        },
[36041]={
            {
                mapId = 11,x = 704.52,y = 299.6,z = -807.51,     --(冥界地狱)传送师-船夫渡口
            },
        },
[36042]={
            {
                mapId = 11,x = 552.03,y = 298.6,z = -746.56,     --(冥界地狱)传送师-裁判之厅·前
            },
        },
[36043]={
            {
                mapId = 11,x = 563.19,y = 324.55,z = -395.89,     --(冥界地狱)传送师-裁判之厅
            },
        },
[36044]={
            {
                mapId = 11,x = 215.96,y = 299.03,z = -293.06,     --(冥界地狱)传送师-黑风地狱
            },
        },
[36045]={
            {
                mapId = 11,x = 174.58,y = 299.34,z = -547.69,     --(冥界地狱)传送师-岩石地狱
            },
        },
[36046]={
            {
                mapId = 11,x = -86.1,y = 271.83,z = -788.13,     --(冥界地狱)传送师-特赦花园
            },
        },
[36047]={
            {
                mapId = 11,x = -153.98,y = 276.32,z = -489.36,     --(冥界地狱)传送师-泥沼地狱
            },
        },
[36048]={
            {
                mapId = 11,x = -171.01,y = 283.47,z = -223.1,     --(冥界地狱)传送师-火海地狱
            },
        },
[36049]={
            {
                mapId = 11,x = 260.3,y = 426.59,z = 33.74,     --(冥界地狱)传送师-血池地狱
            },
        },
[36050]={
            {
                mapId = 11,x = 512.02,y = 426.22,z = 78.6,     --(冥界地狱)传送师-热砂地狱
            },
        },
[36051]={
            {
                mapId = 11,x = 898.88,y = 409.35,z = 286.89,     --(冥界地狱)传送师-群蛇地狱
            },
        },
[36052]={
            {
                mapId = 11,x = 723.9,y = 396.83,z = 537.13,     --(冥界地狱)传送师-背神者深渊
            },
        },
[36053]={
            {
                mapId = 11,x = 874.42,y = 400.15,z = 757.4,     --(冥界地狱)传送师-寒冰地狱
            },
        },
[36054]={
            {
                mapId = 11,x = -557.11,y = 823.77,z = 164.29,     --(冥界地狱)传送师-该隐之厅·前
            },
        },
[36055]={
            {
                mapId = 11,x = -730.76,y = 824.41,z = 297.5,     --(冥界地狱)传送师-该隐之厅
            },
        },
[36056]={
            {
                mapId = 11,x = -845.38,y = 850.06,z = 600.45,     --(冥界地狱)传送师-安第诺拉之厅
            },
        },
[36057]={
            {
                mapId = 11,x = -553.21,y = 866.87,z = 681.73,     --(冥界地狱)传送师-多罗梅之厅
            },
        },
[36058]={
            {
                mapId = 11,x = -578.28,y = 930.98,z = 949.91,     --(冥界地狱)传送师-叹息之墙
            },
        },
[36182]={
            {
                mapId = 11,x = 725,y = 432,z = 280,     --(冥界下篇)冥界下篇昏迷灵魂使用物品
            },
        },
[37643]={
            {
                mapId = 4,x = 230.466,y = 317.172,z = 241.531,     --(银河竞技场)贵鬼传记_贵鬼
            },
        },
[37644]={
            {
                mapId = 4,x = 384.657,y = 301.165,z = -115.566,     --(银河竞技场)贵鬼传记_梦神
            },
        },
[38021]={
            {
                mapId = 1,x = -419.06,y = 330,z = 188.74,     --(月度日常射手)月度日常天蝎-射手圣衣
            },
        },
[38236]={
            {
                mapId = 2,x = -116.476,y = 323.602,z = 59.2678,     --(圣域)圣诞_01白羊座
            },
        },
[38237]={
            {
                mapId = 2,x = -157.662,y = 332.896,z = 80.3448,     --(圣域)圣诞_02金牛座
            },
        },
[38238]={
            {
                mapId = 2,x = -198.998,y = 337.481,z = 56.8643,     --(圣域)圣诞_03双子座
            },
        },
[38239]={
            {
                mapId = 2,x = -229.464,y = 338.787,z = .7546,     --(圣域)圣诞_04巨蟹座
            },
        },
[38240]={
            {
                mapId = 2,x = -181.748,y = 339.26,z = 334.932,     --(圣域)圣诞_05狮子座
            },
        },
[38241]={
            {
                mapId = 2,x = -138.151,y = 339.048,z = 296.363,     --(圣域)圣诞_06处女座
            },
        },
[38242]={
            {
                mapId = 2,x = -230.461,y = 350.307,z = 322.159,     --(圣域)圣诞_07天秤座
            },
        },
[38243]={
            {
                mapId = 2,x = -267.382,y = 361.09,z = 332.623,     --(圣域)圣诞_08天蝎座
            },
        },
[38244]={
            {
                mapId = 2,x = -184.13,y = 339.138,z = 394.821,     --(圣域)圣诞_09射手座
            },
        },
[38245]={
            {
                mapId = 2,x = -221.375,y = 337.481,z = 93.4788,     --(圣域)圣诞_10摩羯座
            },
        },
[38246]={
            {
                mapId = 2,x = -126.645,y = 325.94,z = 52.3773,     --(圣域)圣诞_11水瓶座
            },
        },
[38247]={
            {
                mapId = 2,x = -106.576,y = 323.602,z = 85.9068,     --(圣域)圣诞_12双鱼座
            },
        },
[38030]={
            {
                mapId = 2,x = -393,y = 351,z = 357,     --(圣域)剧本十二宫进入NPC
            },
        },
[38324]={
            {
                mapId = 2,x = -230,y = 339,z = 4,     --(圣域)圣诞节副本进入NPC
            },
        },
[38000]={
            {
                mapId = 25,x = -195,y = 287,z = -429,     --(爱琴湾)爱琴湾总传送师
            },
        },
[38006]={
            {
                mapId = 25,x = -162,y = 283,z = -292,     --(爱琴湾)签到人
            },
        },
[38001]={
            {
                mapId = 25,x = -186,y = 284,z = -297,     --(爱琴湾)结婚丘比特
            },
        },
[38005]={
            {
                mapId = 25,x = -235,y = 283,z = -301,     --(爱琴湾)婚礼筹备阶段开启人
            },
        },
[38007]={
            {
                mapId = 25,x = -233,y = 283,z = -301,     --(爱琴湾)婚礼正式阶段开启人
            },
        },
[38333]={
            {
                mapId = 2,x = -228,y = 337,z = 16,     --(圣域)情缘点兑换
            },
        },
[38428]={
            {
                mapId = 2,x = -223,y = 337,z = 16,     --(圣域)结为密友
            },
        },
[38334]={
            {
                mapId = 2,x = -212,y = 337,z = 10,     --(圣域)离婚登记处
            },
        },
[38439]={
            {
                mapId = 2,x = -216,y = 350,z = 342,     --(圣域)双旦_冰雪嘉年华庆典大使
            },
        },
[38440]={
            {
                mapId = 2,x = -217,y = 350,z = 340,     --(圣域)双旦_冰雪节嘉年华兑换大使
            },
        },
[36404]={
            {
                mapId = 2,x = -225.2,y = 350.4,z = 422.7,     --(圣域)大天使
            },
        },
[38502]={
            {
                mapId = 2,x = -410,y = 356,z = 350,     --(圣域)剧本十二宫进入NPC中级
            },
        },
[38503]={
            {
                mapId = 2,x = -426,y = 361,z = 351,     --(圣域)剧本十二宫进入NPC高级
            },
        },
[38504]={
            {
                mapId = 2,x = -393,y = 351,z = 357,     --(圣域)剧本十二宫后篇进入NPC
            },
        },
[38505]={
            {
                mapId = 2,x = -410,y = 356,z = 350,     --(圣域)剧本十二宫后篇进入NPC中级
            },
        },
[38506]={
            {
                mapId = 2,x = -426,y = 361,z = 351,     --(圣域)剧本十二宫后篇进入NPC高级
            },
        },
[38489]={
            {
                mapId = 2,x = -236,y = 337,z = 114,     --(圣域)yy任务发放NPC
            },
        },
[38684]={
            {
                mapId = 2,x = -208.4,y = 350.4,z = 413.8,     --(圣域)孵化！冥蝶巢穴
            },
        },
[39393]={
            {
                mapId = 2,x = -240.41,y = 338.79,z = 7.41,     --(圣域)朱利安—鳞衣
            },
        },
[37411]={
            {
                mapId = 11,x = 391,y = 422,z = 89,     --(冥界支线下)支线01血池_卡西欧士1
            },
        },
[37412]={
            {
                mapId = 11,x = 391,y = 422.09,z = 89.962,     --(冥界支线下)支线02血池_卡西欧士2
            },
        },
[37413]={
            {
                mapId = 11,x = 391,y = 422.09,z = 89.962,     --(冥界支线下)支线03血池_卡西欧士3
            },
        },
[37414]={
            {
                mapId = 11,x = 410.627,y = 422.133,z = 70.929,     --(冥界支线下)支线04血池_充满悔恨的灵魂
            },
        },
[37415]={
            {
                mapId = 11,x = 396.651,y = 422.096,z = 87.672,     --(冥界支线下)支线05血池_血池引诱者
            },
        },
[37416]={
            {
                mapId = 11,x = 379.846,y = 422.095,z = 90.572,     --(冥界支线下)支线06血池_莎尔娜
            },
        },
[37417]={
            {
                mapId = 11,x = 391.925,y = 422.089,z = 89.99,     --(冥界支线下)支线07血池_金色花朵
            },
        },
[37418]={
            {
                mapId = 11,x = 508.52481,y = 425.77,z = 101.67,     --(冥界支线下)支线08血池_金色花朵2
            },
        },
[37419]={
            {
                mapId = 11,x = 306.399,y = 422.132,z = 119.091,     --(冥界支线下)支线09血池_怨恨的灵魂
            },
        },
[37420]={
            {
                mapId = 11,x = 510.79241,y = 425.923,z = 107.569,     --(冥界支线下)支线10热砂_里根
            },
        },
[37421]={
            {
                mapId = 11,x = 513.50166,y = 425.882,z = 109.468,     --(冥界支线下)支线11热砂_高娜瑞尔
            },
        },
[37422]={
            {
                mapId = 11,x = 509.9347,y = 425.922,z = 111.32,     --(冥界支线下)支线12热砂_陶罐
            },
        },
[37423]={
            {
                mapId = 11,x = 551.4907,y = 425.922,z = 104.679,     --(冥界支线下)支线13热砂_寇德莉亚
            },
        },
[37424]={
            {
                mapId = 11,x = 520.08163,y = 425.832,z = 111.841,     --(冥界支线下)支线14热砂_贪婪
            },
        },
[37425]={
            {
                mapId = 11,x = 898.328,y = 408.622,z = 291.487,     --(冥界支线下)支线15群蛇_石化的灵魂
            },
        },
[37426]={
            {
                mapId = 11,x = 871.689,y = 405.584,z = 272.667,     --(冥界支线下)支线16群蛇_被石化的灵魂1
            },
        },
[37427]={
            {
                mapId = 11,x = 871.689,y = 405.584,z = 272.667,     --(冥界支线下)支线17群蛇_被石化的灵魂2
            },
        },
[37428]={
            {
                mapId = 11,x = 898.328,y = 408.622,z = 291.487,     --(冥界支线下)支线18群蛇_被拯救的灵魂
            },
        },
[37429]={
            {
                mapId = 11,x = 896.363,y = 408.761,z = 297.216,     --(冥界支线下)支线19群蛇_亚鲁歌路的灵魂
            },
        },
[37430]={
            {
                mapId = 11,x = 889.15,y = 408.67,z = 273.98,     --(冥界支线下)支线20群蛇_盗贼头目
            },
        },
[37431]={
            {
                mapId = 11,x = 830.51,y = 399.934,z = 748.772,     --(冥界支线下)支线21寒冰_阿鲁迪巴
            },
        },
[37432]={
            {
                mapId = 11,x = 830.51,y = 399.934,z = 748.772,     --(冥界支线下)支线22寒冰_阿鲁迪巴2
            },
        },
[37433]={
            {
                mapId = 11,x = 830.51,y = 399.934,z = 748.772,     --(冥界支线下)支线23寒冰_金牛座圣衣
            },
        },
[37434]={
            {
                mapId = 11,x = 788.099,y = 399.225,z = 787.469,     --(冥界支线下)支线24寒冰_迪斯马斯克
            },
        },
[37435]={
            {
                mapId = 11,x = 788.099,y = 399.225,z = 787.469,     --(冥界支线下)支线25寒冰_迪斯马斯克2
            },
        },
[37436]={
            {
                mapId = 11,x = 788.099,y = 399.225,z = 787.469,     --(冥界支线下)支线26寒冰_巨蟹座圣衣
            },
        },
[37437]={
            {
                mapId = 11,x = 736.316,y = 400.469,z = 813.225,     --(冥界支线下)支线27寒冰_米罗
            },
        },
[37438]={
            {
                mapId = 11,x = 736.316,y = 400.469,z = 813.225,     --(冥界支线下)支线28寒冰_米罗2
            },
        },
[37439]={
            {
                mapId = 11,x = 736.316,y = 400.469,z = 813.225,     --(冥界支线下)支线29寒冰_天蝎座圣衣
            },
        },
[37440]={
            {
                mapId = 11,x = -592.4857,y = 830.101,z = 301.36,     --(冥界支线下)支线30该隐之厅_该隐守宫冥斗士
            },
        },
[37441]={
            {
                mapId = 11,x = -630.162,y = 833.961,z = 305.586,     --(冥界支线下)支线31该隐之厅_加隆的灵魂
            },
        },
[37442]={
            {
                mapId = 11,x = -817.974,y = 853.957,z = 457.7686,     --(冥界支线下)支线32安第诺拉之厅_安第诺拉守宫冥斗士
            },
        },
[37443]={
            {
                mapId = 11,x = -823.042,y = 854.198,z = 486.1853,     --(冥界支线下)支线33安第诺拉之厅_艾欧里亚的灵魂1
            },
        },
[37444]={
            {
                mapId = 11,x = -810.119,y = 848.661,z = 433.8453,     --(冥界支线下)支线34安第诺拉之厅_遗忘之村村民1
            },
        },
[37445]={
            {
                mapId = 11,x = -810.119,y = 848.661,z = 433.8453,     --(冥界支线下)支线35安第诺拉之厅_遗忘之村村民2
            },
        },
[37446]={
            {
                mapId = 11,x = -810.119,y = 848.661,z = 433.8453,     --(冥界支线下)支线36安第诺拉之厅_遗忘之村村民3
            },
        },
[37447]={
            {
                mapId = 11,x = -823.042,y = 854.198,z = 486.1853,     --(冥界支线下)支线37安第诺拉之厅_艾欧里亚的灵魂2
            },
        },
[37448]={
            {
                mapId = 11,x = -629.57,y = 866.127,z = 569.953,     --(冥界支线下)支线38安第诺拉之厅_多罗梅守宫冥斗士
            },
        },
[37449]={
            {
                mapId = 11,x = -599.2064,y = 867.046,z = 612.982,     --(冥界支线下)支线39安第诺拉之厅_阿布罗狄的灵魂1
            },
        },
[37450]={
            {
                mapId = 11,x = -599.2064,y = 867.046,z = 612.982,     --(冥界支线下)支线40安第诺拉之厅_阿布罗狄的灵魂2
            },
        },
[37451]={
            {
                mapId = 11,x = -714.744,y = 913.991,z = 809.003,     --(冥界支线下)支线41安第诺拉之厅_犹大守宫冥斗士
            },
        },
[37452]={
            {
                mapId = 11,x = -706.654,y = 913.965,z = 850.193,     --(冥界支线下)支线42安第诺拉之厅_撒加1
            },
        },
[37453]={
            {
                mapId = 11,x = -708.695,y = 913.092,z = 839.827,     --(冥界支线下)支线43安第诺拉之厅_雅各布
            },
        },
[37454]={
            {
                mapId = 11,x = -708.695,y = 913.092,z = 839.827,     --(冥界支线下)支线44安第诺拉之厅_约翰
            },
        },
[37455]={
            {
                mapId = 11,x = -708.695,y = 913.092,z = 839.827,     --(冥界支线下)支线45安第诺拉之厅_西门彼得
            },
        },
[37456]={
            {
                mapId = 11,x = -708.695,y = 913.092,z = 839.827,     --(冥界支线下)支线46安第诺拉之厅_安德烈
            },
        },
[37457]={
            {
                mapId = 11,x = -708.695,y = 913.092,z = 839.827,     --(冥界支线下)支线47安第诺拉之厅_腓力
            },
        },
[37458]={
            {
                mapId = 11,x = -708.695,y = 913.092,z = 839.827,     --(冥界支线下)支线48安第诺拉之厅_巴多罗买
            },
        },
[37459]={
            {
                mapId = 11,x = -694.638,y = 913.092,z = 858.512,     --(冥界支线下)支线49安第诺拉之厅_多马
            },
        },
[37460]={
            {
                mapId = 11,x = -694.638,y = 913.092,z = 858.512,     --(冥界支线下)支线50安第诺拉之厅_马太
            },
        },
[37461]={
            {
                mapId = 11,x = -694.638,y = 913.092,z = 858.512,     --(冥界支线下)支线51安第诺拉之厅_小雅各布
            },
        },
[37462]={
            {
                mapId = 11,x = -694.638,y = 913.092,z = 858.512,     --(冥界支线下)支线52安第诺拉之厅_达太
            },
        },
[37463]={
            {
                mapId = 11,x = -694.638,y = 913.092,z = 858.512,     --(冥界支线下)支线53安第诺拉之厅_西门
            },
        },
[37464]={
            {
                mapId = 11,x = -694.638,y = 913.092,z = 858.512,     --(冥界支线下)支线54安第诺拉之厅_犹大
            },
        },
[37465]={
            {
                mapId = 11,x = -706.654,y = 913.965,z = 850.193,     --(冥界支线下)支线55安第诺拉之厅_撒加2
            },
        },
[37954]={
            {
                mapId = 11,x = 410.627,y = 422.133,z = 70.929,     --(冥界支线下)支线56血池_充满怨恨的灵魂
            },
        },
[39594]={
            {
                mapId = 3,x = -85,y = 326,z = -259,     --(传记任务)传记任务春丽01
            },
        },
[39595]={
            {
                mapId = 3,x = -199,y = 313,z = -222,     --(传记任务)传记任务香烛商人
            },
        },
[39596]={
            {
                mapId = 3,x = -85,y = 326,z = -259,     --(传记任务)传记任务春丽02
            },
        },
[39441]={
            {
                mapId = 4,x = 325.77,y = 317.5,z = 447.08,     --(月度日常摩羯)月度日常摩羯-摩羯圣衣
            },
        },
[38143]={
            {
                mapId = 11,x = 196,y = 299,z = -299,     --(冥界支线上)冥界_支线01_黑风地狱卫兵
            },
        },
[38144]={
            {
                mapId = 11,x = 193,y = 299,z = -561,     --(冥界支线上)冥界_支线02_滚石地狱卫兵
            },
        },
[38145]={
            {
                mapId = 11,x = -180,y = 278,z = -393,     --(冥界支线上)冥界_支线03_泥沼地狱卫兵
            },
        },
[38146]={
            {
                mapId = 11,x = -131,y = 288,z = -102,     --(冥界支线上)冥界_支线04_火海地狱卫兵
            },
        },
[38147]={
            {
                mapId = 11,x = -166,y = 276,z = -764,     --(冥界支线上)冥界_支线05_阿伽门农的灵魂
            },
        },
[38148]={
            {
                mapId = 11,x = -170,y = 276,z = -754,     --(冥界支线上)冥界_支线06_赫克托尔的灵魂
            },
        },
[38149]={
            {
                mapId = 11,x = -122,y = 270,z = -793,     --(冥界支线上)冥界_支线07_伊阿宋的灵魂
            },
        },
[38150]={
            {
                mapId = 11,x = -101,y = 270,z = -808,     --(冥界支线上)冥界_支线08_美狄亚的灵魂
            },
        },
[38151]={
            {
                mapId = 11,x = -84,y = 271,z = -708,     --(冥界支线上)冥界_支线09_忒修斯的灵魂
            },
        },
[38152]={
            {
                mapId = 11,x = -59,y = 274,z = -727,     --(冥界支线上)冥界_支线10_珀尔修斯的灵魂
            },
        },
[38153]={
            {
                mapId = 11,x = 748,y = 304,z = -747,     --(冥界支线上)冥界_支线11_溺毙的灵魂
            },
        },
[38155]={
            {
                mapId = 11,x = -150,y = 298,z = -196,     --(冥界支线上)冥界_支线13_奥路菲
            },
        },
[38156]={
            {
                mapId = 11,x = -109,y = 273,z = -765,     --(冥界支线上)冥界_支线14_希尔汗的灵魂
            },
        },
[38157]={
            {
                mapId = 11,x = 238,y = 291,z = -742,     --(冥界支线上)冥界_支线15_堕落的前辈
            },
        },
[38158]={
            {
                mapId = 11,x = 173,y = 290,z = -591,     --(冥界支线上)冥界_支线16_圣斗士的灵魂
            },
        },
[38159]={
            {
                mapId = 11,x = 592,y = 311,z = -400,     --(冥界支线上)冥界_支线17_梦游的灵魂1
            },
        },
[38160]={
            {
                mapId = 11,x = 594.13,y = 309.87,z = -467.28,     --(冥界支线上)冥界_支线18_梦游的灵魂2
            },
        },
[38161]={
            {
                mapId = 11,x = 614.97,y = 298.33,z = -569.61,     --(冥界支线上)冥界_支线19_梦游的灵魂3
            },
        },
[38162]={
            {
                mapId = 11,x = 551,y = 298,z = -743,     --(冥界支线上)冥界_支线20_梦游的灵魂4
            },
        },
[38166]={
            {
                mapId = 11,x = -198.1,y = 276.7,z = -300.42,     --(冥界支线上)冥界_支线24_卡斯托尔1
            },
        },
[38167]={
            {
                mapId = 11,x = -209,y = 276,z = -323,     --(冥界支线上)冥界_支线25_卡斯托尔2
            },
        },
[38168]={
            {
                mapId = 11,x = -104.38,y = 276.84,z = -429.37,     --(冥界支线上)冥界_支线26_卡斯托尔3
            },
        },
[38169]={
            {
                mapId = 11,x = -149,y = 275,z = -501,     --(冥界支线上)冥界_支线27_卡斯托尔4
            },
        },
[38170]={
            {
                mapId = 11,x = 88,y = 269,z = -806,     --(冥界支线上)冥界_支线28_沙加2
            },
        },
[38171]={
            {
                mapId = 11,x = -178.7,y = 275.87,z = -287.78,     --(冥界支线上)冥界_支线29_童虎2
            },
        },
[38172]={
            {
                mapId = 11,x = -206,y = 276,z = -322,     --(冥界支线上)冥界_支线30_童虎3
            },
        },
[38537]={
            {
                mapId = 11,x = 557,y = 324,z = -363,     --(冥界支线上)冥界_支线31_酗酒者的灵魂
            },
        },
[38540]={
            {
                mapId = 11,x = 557,y = 324,z = -363,     --(冥界支线上)冥界_支线32_不贞者的灵魂
            },
        },
[38543]={
            {
                mapId = 11,x = 557,y = 324,z = -363,     --(冥界支线上)冥界_支线33_叛国者的灵魂
            },
        },
[39423]={
            {
                mapId = 11,x = -99,y = 273,z = -759,     --(冥界支线上)冥界_支线13_奥路菲2
            },
        },
[39657]={
            {
                mapId = 11,x = -149,y = 275,z = -501,     --(冥界支线上)冥界_支线34_卡斯托尔5
            },
        },
[39802]={
            {
                mapId = 2,x = -217.15,y = 350.31,z = 341.42,     --(圣域)马年新年大使_紫龙
            },
        },
[39720]={
            {
                mapId = 5,x = 12.784,y = 305.07,z = -192.062,     --(环任务)苏兰特传记苏兰特01
            },
        },
[39721]={
            {
                mapId = 5,x = -19.4951,y = 305.237,z = -202.359,     --(环任务)苏兰特传记苏兰特02
            },
        },
[39722]={
            {
                mapId = 5,x = -18.3657,y = 305.001,z = -192.513,     --(环任务)苏兰特传记流浪者
            },
        },
[40037]={
            {
                mapId = 11,x = -580,y = 930,z = 951,     --(冥界支线下)冥界死去的圣斗士
            },
        },
[39768]={
            {
                mapId = 2,x = -226.46,y = 337,z = 16,     --(圣域)马年新年大使_瞬
            },
        },
[39769]={
            {
                mapId = 2,x = -197,y = 339,z = 389,     --(圣域)马年新年大使_星矢
            },
        },
[39770]={
            {
                mapId = 2,x = -182,y = 339,z = 413,     --(圣域)马年新年大使_一辉
            },
        },
[39771]={
            {
                mapId = 2,x = -216.48,y = 350.31,z = 342.7,     --(圣域)马年新年大使_冰河
            },
        },
[39772]={
            {
                mapId = 2,x = -226,y = 337,z = 15,     --(圣域)新年活动_铭刻板1
            },
        },
[39773]={
            {
                mapId = 2,x = -199,y = 339,z = 389,     --(圣域)新年活动_铭刻板2
            },
        },
[39774]={
            {
                mapId = 2,x = -182,y = 339,z = 416,     --(圣域)新年活动_铭刻板3
            },
        },
[39775]={
            {
                mapId = 2,x = -216.15,y = 350.31,z = 340.42,     --(圣域)新年活动_铭刻板4
            },
        },
[39671]={
            {
                mapId = 2,x = -267.1,y = 350.4,z = 395.8,     --(圣域)辰巳德丸
            },
        },
[39895]={
            {
                mapId = 2,x = -296,y = 350.3,z = 290.8,     --(圣域)yy任务第2期紫龙
            },
        },
[39896]={
            {
                mapId = 2,x = -295.6,y = 343.5,z = 227,     --(圣域)yy任务第2期春丽
            },
        },
[39897]={
            {
                mapId = 2,x = -295.6,y = 340.4,z = 67.6,     --(圣域)yy任务第2期雅典娜
            },
        },
[38533]={
            {
                mapId = 2,x = -263,y = 344,z = 106,     --(圣域)领土战技能卡兑换
            },
        },
[38534]={
            {
                mapId = 2,x = -262,y = 344,z = 109,     --(圣域)领土战技能卡兑换
            },
        },
[38535]={
            {
                mapId = 2,x = -261,y = 344,z = 113,     --(圣域)领土战技能卡兑换
            },
        },
[39930]={
            {
                mapId = LEAGUE_BASE,x = -46,y = 350,z = -213,     --(春节活动)活动NPC雅典娜神圣衣
            },
        },
[40060]={
            {
                mapId = 2,x = -227.62,y = 337.48,z = 37.06,     --(冥界入侵高级)冥界入侵高级周六开启
            },
        },
[40061]={
            {
                mapId = 2,x = -227.62,y = 337.48,z = 37.06,     --(冥界入侵高级)冥界入侵高级周日开启
            },
        },
[40157]={
            {
                mapId = 2,x = -179.227,y = 339.233,z = 334,     --(春节活动)春节_地图任务06处女
            },
        },
[40154]={
            {
                mapId = 2,x = -179.227,y = 339.233,z = 334,     --(春节活动)春节_地图任务03双子
            },
        },
[40156]={
            {
                mapId = 2,x = -179.227,y = 339.233,z = 334,     --(春节活动)春节_地图任务05狮子
            },
        },
[40159]={
            {
                mapId = 2,x = -179.227,y = 339.233,z = 334,     --(春节活动)春节_地图任务08天蝎
            },
        },
[40483]={
            {
                mapId = 4,x = -48.423,y = 282.812,z = -155.676,     --(月度日常水瓶)月度日常水瓶-水瓶圣衣
            },
        },
[40555]={
            {
                mapId = 4,x = 64.606,y = 287.333,z = 320.993,     --(月度日常双鱼)月度日常双鱼-双鱼圣衣
            },
        },
[40463]={
            {
                mapId = 2,x = -210.58,y = 350.34,z = 421.77,     --(圣域)复生！死去的斗士
            },
        },
[41521]={
            {
                mapId = 2,x = -218,y = 350,z = 330,     --(圣域)白色情人节_紫龙
            },
        },
[41527]={
            {
                mapId = 2,x = -218,y = 350,z = 334,     --(圣域)白色情人节_一辉
            },
        },
[41604]={
            {
                mapId = 2,x = -218,y = 350,z = 337,     --(圣域)白色情人节_爱洛斯
            },
        },
[41524]={
            {
                mapId = 2,x = -254,y = 357,z = 334,     --(圣域)白色情人节_春丽
            },
        },
[41595]={
            {
                mapId = 2,x = -180,y = 339,z = 368,     --(圣域)白色情人节_美穗
            },
        },
[41526]={
            {
                mapId = 2,x = -205,y = 337,z = 59,     --(圣域)白色情人节_玛丽苏
            },
        },
[41525]={
            {
                mapId = 2,x = -98,y = 322,z = 74,     --(圣域)白色情人节_茱莉叶
            },
        },
[41938]={
            {
                mapId = 2,x = -180,y = 339,z = 423,     --(圣域)金装牌子兑换
            },
        },
[32791]={
            {
                mapId = 7,x = 85,y = 404.5,z = 250,     --(东西伯利亚)英雄蓝冰堡入口
            },
        },
[41957]={
            {
                mapId = 2,x = -194.92,y = 339.15,z = 391.39,     --(圣域)组队竞技奖励兑换
            },
        },
[41996]={
            {
                mapId = 11,x = 930.04,y = 298.86,z = -887.52,     --(冥界地狱回城师)回城师-地狱大门
            },
            {
                mapId = 11,x = 563.19,y = 324.55,z = -395.89,     --(冥界地狱回城师)回城师-裁判之厅
            },
            {
                mapId = 11,x = 174.58,y = 299.34,z = -547.69,     --(冥界地狱回城师)回城师-岩石地狱
            },
            {
                mapId = 11,x = -86.1,y = 271.83,z = -788.13,     --(冥界地狱回城师)回城师-特赦花园
            },
            {
                mapId = 11,x = -171.01,y = 283.47,z = -223.1,     --(冥界地狱回城师)回城师-火海地狱
            },
            {
                mapId = 11,x = 260.3,y = 426.59,z = 33.74,     --(冥界地狱回城师)回城师-血池地狱
            },
            {
                mapId = 11,x = 723.9,y = 396.83,z = 537.13,     --(冥界地狱回城师)回城师-背神者深渊
            },
            {
                mapId = 11,x = -557.11,y = 823.77,z = 164.29,     --(冥界地狱回城师)回城师-该隐之厅·前
            },
            {
                mapId = 11,x = -845.38,y = 850.06,z = 600.45,     --(冥界地狱回城师)回城师-安第诺拉之厅
            },
        },
[41998]={
            {
                mapId = 11,x = -88,y = 271,z = -786,     --(冥界地狱补给商人)冥界地狱补给商人
            },
            {
                mapId = 11,x = 566,y = 324,z = -396,     --(冥界地狱补给商人)冥界地狱补给商人
            },
            {
                mapId = 11,x = 257,y = 426,z = 29,     --(冥界地狱补给商人)冥界地狱补给商人
            },
            {
                mapId = 11,x = 730,y = 396,z = 540,     --(冥界地狱补给商人)冥界地狱补给商人
            },
            {
                mapId = 11,x = -839,y = 849,z = 601,     --(冥界地狱补给商人)冥界地狱补给商人
            },
        },
[41624]={
            {
                mapId = 4,x = -199,y = 284,z = -361,     --(月度日常白羊)月度日常白羊-白羊圣衣
            },
        },
[41928]={
            {
                mapId = 11,x = 632.39,y = 299,z = -585.49,     --(个人库)亚萨
            },
        },
[41929]={
            {
                mapId = 11,x = -161.25,y = 275,z = -470.41,     --(个人库)林克
            },
        },
[41930]={
            {
                mapId = 11,x = -122.04,y = 271,z = -660.65,     --(个人库)逝去的圣斗士1
            },
        },
[41931]={
            {
                mapId = 11,x = 228.59,y = 426,z = 48.1,     --(个人库)逝去的圣斗士2
            },
        },
[42032]={
            {
                mapId = 1,x = -110,y = 372,z = 408,     --(清明节日任务链)清明_卡酉殴土
            },
        },
[42033]={
            {
                mapId = 1,x = -123,y = 371,z = 389,     --(清明节日任务链)清明_莎尔娜
            },
        },
[42034]={
            {
                mapId = 1,x = -160,y = 373,z = 428,     --(清明节日任务链)清明_艾德之魂
            },
        },
[42035]={
            {
                mapId = 1,x = -143,y = 374,z = 437,     --(清明节日任务链)清明_卡西欧士之魂
            },
        },
[42036]={
            {
                mapId = 1,x = -70,y = 378,z = 449,     --(清明节日任务链)清明_艾欧罗斯之魂
            },
        },
[42037]={
            {
                mapId = 1,x = -99,y = 377,z = 436,     --(清明节日任务链)清明_史昂之魂
            },
        },
[42169]={
            {
                mapId = 2,x = -258.187,y = 357.768,z = 334.468,     --(劳动节任务链)劳动节_雅典娜
            },
        },
[42170]={
            {
                mapId = 2,x = -342.407,y = 350.307,z = 377.072,     --(劳动节任务链)劳动节_德墨特耳
            },
            {
                mapId = 2,x = -211.977,y = 338.787,z = -11.1173,     --(劳动节任务链)劳动节_德墨特耳
            },
            {
                mapId = 2,x = -136.338,y = 325.94,z = 18.4874,     --(劳动节任务链)劳动节_德墨特耳
            },
        },
[42215]={
            {
                mapId = 2,x = -338.99,y = 350.307,z = 373.255,     --(劳动节任务链)劳动节_普通的树
            },
        },
[42216]={
            {
                mapId = 2,x = -338.99,y = 350.307,z = 373.255,     --(劳动节任务链)劳动节_结果的树
            },
            {
                mapId = 2,x = -214.031,y = 339.128,z = -14.7988,     --(劳动节任务链)劳动节_结果的树
            },
            {
                mapId = 2,x = -131.852,y = 326.138,z = 21.5887,     --(劳动节任务链)劳动节_结果的树
            },
        },
[42283]={
            {
                mapId = 2,x = -214.031,y = 339.128,z = -14.7988,     --(劳动节任务链)劳动节_普通的树2
            },
        },
[42284]={
            {
                mapId = 2,x = -131.852,y = 326.138,z = 21.5887,     --(劳动节任务链)劳动节_普通的树3
            },
        },
[42073]={
            {
                mapId = 10,x = 190.21,y = 344.844,z = -288.729,     --(环任务)拉达曼迪斯_斯宾塞1
            },
        },
[42074]={
            {
                mapId = 10,x = 28.7189,y = 369.542,z = -232.424,     --(环任务)拉达曼迪斯_拉达曼迪斯1
            },
        },
[42075]={
            {
                mapId = 10,x = 28.7189,y = 369.542,z = -232.424,     --(环任务)拉达曼迪斯_拉达曼迪斯2
            },
        },
[42076]={
            {
                mapId = 10,x = 258.622,y = 339.509,z = -317.993,     --(环任务)拉达曼迪斯_斯宾塞2
            },
        },
[42091]={
            {
                mapId = 10,x = 441.334,y = 316.089,z = -190.972,     --(环任务)米诺斯_兵斗1
            },
        },
[42092]={
            {
                mapId = 10,x = 269.835,y = 309.999,z = -107.501,     --(环任务)米诺斯_兵斗2
            },
        },
[42093]={
            {
                mapId = 10,x = 269.835,y = 309.999,z = -107.501,     --(环任务)米诺斯_兵斗3
            },
        },
[42094]={
            {
                mapId = 10,x = 269.835,y = 309.999,z = -107.501,     --(环任务)米诺斯_兵斗4
            },
        },
[42095]={
            {
                mapId = 10,x = 325.213,y = 319.951,z = -186.029,     --(环任务)米诺斯_米诺斯
            },
        },
[42229]={
            {
                mapId = 2,x = -176,y = 339.111,z = 411,     --(儿童节活动战场)温柔的大丑
            },
        },
[42141]={
            {
                mapId = 1,x = -11,y = 307,z = -20,     --(海龙主线)海龙主线01摩娅
            },
        },
[42144]={
            {
                mapId = 1,x = -50,y = 308,z = -20,     --(海龙主线)海龙主线02宁芙
            },
        },
[42147]={
            {
                mapId = 1,x = 159,y = 421,z = 311,     --(海龙主线)海龙主线03宁芙
            },
        },
[42153]={
            {
                mapId = 1,x = -354,y = 322,z = 194,     --(海龙主线)受惊吓的学员
            },
        },
[42162]={
            {
                mapId = 1,x = 0,y = 365,z = 298,     --(海龙主线)海龙主线08昏倒的卫兵
            },
        },
[42339]={
            {
                mapId = 50,x = -310,y = 399,z = 165,     --(海龙主线)系统07职业选择_海龙
            },
        },
[42330]={
            {
                mapId = 1,x = 125,y = 446,z = 309,     --(海龙主线)异空黄金幻象
            },
        },
[42618]={
            {
                mapId = 2,x = -218.317,y = 350.317,z = 335.3,     --(劳动节欢庆大使)劳动节欢庆大使
            },
        },
[42443]={
            {
                mapId = 2,x = -197.48,y = 337.51,z = 29.17,     --(服务器大战)李贝留斯
            },
        },
[42451]={
            {
                mapId = 2,x = -196.53,y = 337.48,z = 31.76,     --(服务器大战)卡莲
            },
        },
[42571]={
            {
                mapId = 2,x = -225.02,y = 350.33,z = 420.84,     --(逆流！亚特兰蒂斯)普朗克
            },
        },
[42572]={
            {
                mapId = 2,x = -210.1,y = 350.33,z = 413.74,     --(逆流！十二宫危机)护卫队长西瑞
            },
        },
[42573]={
            {
                mapId = 2,x = -186.39,y = 339.13,z = 393.27,     --(逆流！黄金试炼)奥丽娜
            },
        },
[42851]={
            {
                mapId = 2,x = -196.5,y = 339,z = 389,     --(飞行战场)安琳娜
            },
        },
[42861]={
            {
                mapId = 63,x = -546,y = 823,z = 160,     --(奥路菲)奥路菲
            },
        },
[42864]={
            {
                mapId = 63,x = -561,y = 930,z = 931,     --(奥路菲)奥路菲
            },
        },
[42876]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_1阶段史昂兑换
            },
        },
[42877]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_1阶段史昂杀怪
            },
        },
[42855]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_2阶段史昂兑换
            },
        },
[42858]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_2阶段史昂杀怪
            },
        },
[42846]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_3阶段史昂兑换
            },
        },
[42727]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_3阶段史昂杀怪
            },
        },
[42878]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_4阶段史昂兑换
            },
        },
[42879]={
            {
                mapId = 2,x = -217,y = 337.521,z = 43,     --(服务器事件-冥王之怒)冥怒_4阶段史昂杀怪
            },
        },
[42728]={
            {
                mapId = 64,x = 45.401,y = 298.489,z = -360.987,     --(服务器事件-冥王之怒)冥怒_3阶段_一辉
            },
        },
[42729]={
            {
                mapId = 64,x = -40.469,y = 306.619,z = 117.103,     --(服务器事件-冥王之怒)冥怒_3阶段_瞬
            },
        },
[42730]={
            {
                mapId = 64,x = -176.329,y = 304.619,z = -235.827,     --(服务器事件-冥王之怒)冥怒_3阶段_紫龙
            },
        },
[42731]={
            {
                mapId = 64,x = -279.519,y = 333.819,z = 218.293,     --(服务器事件-冥王之怒)冥怒_3阶段_冰河
            },
        },
[42732]={
            {
                mapId = 64,x = -275.386,y = 335.789,z = -28.8801,     --(服务器事件-冥王之怒)冥怒_3阶段_星矢
            },
        },
[42458]={
            {
                mapId = 62,x = -214.031,y = 350.307,z = 335.025,     --(星座升华_雅典娜终焉之地)
            },
        },
[42459]={
            {
                mapId = 62,x = 80.9577,y = 289.628,z = -133.157,     --(星座升华_黄金圣斗士射手座1)
            },
        },
[42460]={
            {
                mapId = 62,x = 331.018,y = 371.896,z = 345.41,     --(星座升华_黄金圣斗士射手座2)
            },
        },
[42461]={
            {
                mapId = 62,x = 80.9577,y = 289.628,z = -133.157,     --(星座升华_黄金圣斗士水瓶座1)
            },
        },
[42462]={
            {
                mapId = 62,x = 331.018,y = 371.896,z = 345.41,     --(星座升华_黄金圣斗士水瓶座2)
            },
        },
[42463]={
            {
                mapId = 62,x = 80.9577,y = 289.628,z = -133.157,     --(星座升华_黄金圣斗士天秤座1)
            },
        },
[42464]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士天秤座2)
            },
        },
[42465]={
            {
                mapId = 62,x = 80.9577,y = 289.628,z = -133.157,     --(星座升华_黄金圣斗士处女座1)
            },
        },
[42466]={
            {
                mapId = 62,x = 331.018,y = 371.896,z = 345.41,     --(星座升华_黄金圣斗士处女座2)
            },
        },
[42467]={
            {
                mapId = 62,x = 80.9577,y = 289.628,z = -133.157,     --(星座升华_黄金圣斗士狮子座1)
            },
        },
[42468]={
            {
                mapId = 62,x = 331.018,y = 371.896,z = 345.41,     --(星座升华_黄金圣斗士狮子座2)
            },
        },
[42469]={
            {
                mapId = 62,x = 80.9577,y = 289.628,z = -133.157,     --(星座升华_黄金圣斗士双子座1)
            },
        },
[42470]={
            {
                mapId = 62,x = 331.018,y = 371.896,z = 345.41,     --(星座升华_黄金圣斗士双子座2)
            },
        },
[42483]={
            {
                mapId = 62,x = -2.18206,y = 288.914,z = -106.798,     --(星座升华_试炼石柱)
            },
        },
[42546]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士射手座3)
            },
        },
[42547]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士水瓶座3)
            },
        },
[42548]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士双子座3)
            },
        },
[42867]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士处女座3)
            },
        },
[42868]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士狮子座3)
            },
        },
[42869]={
            {
                mapId = 62,x = 331.028,y = 371.896,z = 345.369,     --(星座升华_黄金圣斗士天秤座3)
            },
        },
[42150]={
            {
                mapId = 2,x = 32,y = 288,z = 185,     --(海龙主线宁芙)海龙主线圣域宁芙
            },
        },
[42224]={
            {
                mapId = 2,x = -224.45,y = 350.31,z = 334.53,     --(服务器大战_引导)
            },
        },
[43035]={
            {
                mapId = 2,x = -195,y = 337.5,z = 63,     --(系统指引_灵魂之甲NPC)罗杰斯
            },
        },
[44134]={
            {
                mapId = 2,x = -219.81,y = 350.31,z = 421.83,     --(周年庆典_辰己德丸)
            },
        },
[44135]={
            {
                mapId = 2,x = -215.59,y = 350.31,z = 423.24,     --(周年庆典_奖励大使)
            },
        },
[44244]={
            {
                mapId = 4,x = 349,y = 325.5,z = 481,     --(双子月度_进副本NPC)双子座黄金圣衣
            },
        },
[44334]={
            {
                mapId = 3,x = -226,y = 319,z = -118,     --(巨蟹月度_进地宫NPC)巨蟹座黄金圣衣
            },
        },
[44451]={
            {
                mapId = 2,x = -268,y = 327,z = 247,     --(保卫沙织低级_进入NPC)
            },
        },
[44453]={
            {
                mapId = 2,x = -294,y = 343,z = 229,     --(保卫沙织高级_进入NPC)
            },
        },
}
--通用地图的传送师，格式为 npcId = 大地图传送配置表ID
CommonTeleporterCfg = {
        [10049] = 11211,
        [13553] = 15064,
        [13554] = 15065,
        [13555] = 15066,
        [13556] = 15067,
        [13558] = 15068,
        [13559] = 15069,
        [13564] = 15070,
        [13565] = 15071,
        [13566] = 15072,
        [13567] = 15073,
        [13569] = 15074,
        [13571] = 15075,
        [13573] = 15076,
        [13574] = 15077,
        [13575] = 15078,
        [13576] = 15079,
        [13577] = 15080,
        [15800] = 16769,
        [15801] = 16768,
        [20593] = 20985,
        [20594] = 20986,
        [20595] = 20987,
        [20596] = 20988,
        [20597] = 20989,
        [20598] = 20990,
        [20599] = 20991,
        [20600] = 20992,
        [20601] = 20993,
        [20602] = 20994,
        [20603] = 20995,
        [20604] = 20996,
        [20605] = 20997,
        [22694] = 23786,
        [25768] = 24716,
        [25769] = 24717,
        [25770] = 24718,
        [25771] = 24719,
        [25772] = 24720,
        [25773] = 24721,
        [25774] = 24722,
        [25775] = 24723,
        [25776] = 24724,
        [25777] = 24725,
        [25778] = 24726,
        [25779] = 24727,
        [25780] = 24728,
        [25781] = 24729,
        [25782] = 24730,
        [28531] = 26226,
        [28532] = 26227,
        [28533] = 26228,
        [28534] = 26229,
        [28535] = 26230,
        [28536] = 26231,
        [28537] = 26232,
        [28538] = 26233,
        [28539] = 26234,
        [28540] = 26235,
        [28541] = 26236,
        [28542] = 26237,
        [28543] = 26238,
        [28544] = 26239,
        [28545] = 26240,
        [28546] = 26241,
        [29490] = 26751,
        [36040] = 32025,
        [36041] = 32026,
        [36042] = 32027,
        [36043] = 32028,
        [36044] = 32029,
        [36045] = 32030,
        [36046] = 32031,
        [36047] = 32032,
        [36048] = 32033,
        [36049] = 32034,
        [36050] = 32035,
        [36051] = 32036,
        [36052] = 32037,
        [36053] = 32038,
        [36054] = 32039,
        [36055] = 32040,
        [36056] = 32041,
        [36057] = 32042,
        [36058] = 32043,
        [38000] = 34321,
}
--限制地图的传送师。
LimitedTeleporterCfg = {
[25699]={
            {
                mapId = 40,x = -290.674,y = 358.59,z = 334.511,r = 1,
            },
        },
[25700]={
            {
                mapId = 2,x = -288.763,y = 358.59,z = 334.518,r = 1,
            },
        },
}