-----------------------------
--显示圣衣配置

saint_show_cfg = 
{
10737	,
10739	,
10738	,
10740	,
10741	,
10705	,
15218	,
10711	,
15217	,
18236	,
18233	,
10712	,
10710	,
10715	,
18230	,
27658   ,
27659   ,
27660   ,
27661   ,
27662   ,
10719	,
10756	,
18222	,
18227	,
18224	,
10745	,
10754	,
10723	,
10747	,
10757	,
10725	,
10726	,
10727	,
10728	,
10729	,
10730	,
10731	,
10732	,
10733	,
10734	,
10735	,
10736	,
10742   ,
10718   ,
10750   ,
10749   ,
10755   ,
10720   ,
10722   ,
10752   ,
10713   ,
10753   ,
31147   ,
34324	,
34325	,
34326	,
35680	,
35681	,
35682	,
35683	,
35684	,

10706	,
18232	,
18229	,
10748	,
10707   ,
18234   ,
18223	,
18228	,
10724   ,
43232   ,
10751   ,
10744   ,
38921	,
38922	,
38923	,
43234   ,
43235   ,
43233   ,



}

--圣衣组合套装模型
SaintClothSuiteModels = 
{
	[10737] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	    },
	},
	[10739] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白鸟座1级圣衣组合版\\白鸟座1级圣衣组合版.ecm",
	    },
	},
	[10738] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天龙座1级圣衣组合版\\天龙座1级圣衣组合版.ecm",
	    },
	},
	[10740] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\仙女座1级圣衣组合版\\仙女座1级圣衣组合版.ecm",
	    },
	},
	[10741] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\凤凰座1级圣衣组合版\\凤凰座1级圣衣组合版.ecm",
	    },
	},
	[10705] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\盾座圣衣组合\\盾座圣衣组合.ecm",
	    },
	},
	[15218] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\六分仪座圣衣组合\\六分仪座圣衣组合.ecm",
	    },
	},
	[10711] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\飞鱼座圣衣组合\\飞鱼座圣衣组合.ecm",
	    },
	},
	[15217] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\九头龙圣衣组合\\九头龙圣衣组合.ecm",
	    },
	},
	[18236] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\铜剑座圣衣组合\\铜剑座圣衣组合.ecm",
	    },
	},
	[18233] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\巨鲨座圣衣组合\\巨鲨座圣衣组合.ecm",
	    },
	},
	[10712] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\变色龙座圣衣组合\\变色龙座圣衣组合.ecm",
	    },
	},
	[10710] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\海蛇座圣衣组合\\海蛇座圣衣组合.ecm",
	    },
	},
	[10715] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\北冕座圣衣组合\\北冕座圣衣组合.ecm",
	    },
	},
	[18230] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	    },
	},
	[10707] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	    },
	},
	[18234] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\曼陀铃座圣衣组合\\曼陀铃座圣衣组合.ecm",
	    },
	},
	--黑暗小强
	[27658] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天马座2级圣衣组合版\\黑暗天马座2级圣衣组合版.ecm",
	    },
	},
	[27659] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天龙座2级圣衣组合版\\黑暗天龙座2级圣衣组合版.ecm",
	    },
	},
	[27660] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白鸟座2级圣衣组合版\\黑暗白鸟座2级圣衣组合版.ecm",
	    },
	},
	[27661] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\仙女座2级圣衣组合版\\黑暗仙女座2级圣衣组合版.ecm",
	    },
	},
	[27662] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\凤凰座2级圣衣组合版\\黑暗凤凰座2级圣衣组合版.ecm",
	    },
	},
	---------

	[10719] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银御夫座圣衣组合\\白银御夫座圣衣组合.ecm",
	    },
	},
	[10756] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银仙王座圣衣组合\\白银仙王座圣衣组合.ecm",
	    },
	},
	[18222] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银幼蛛座圣衣组合\\白银幼蛛座圣衣组合.ecm",
	    },
	},
	[18227] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银天鹰座圣衣组合\\白银天鹰座圣衣组合.ecm",
	    },
	},
	[18224] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银夜灯座圣衣组合\\白银夜灯座圣衣组合.ecm",
	    },
	},
	[10745] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银三角座圣衣组合\\白银三角座圣衣组合.ecm",
	    },
	},
	[10754] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银武仙座圣衣组合\\白银武仙座圣衣组合.ecm",
	    },
	},
	[10723] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\乌鸦座圣衣组合\\乌鸦座圣衣组合.ecm",
	    },
	},
	[10747] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银半人马座圣衣组合\\白银半人马座圣衣组合.ecm",
	    },
	},
	[10757] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白银天琴座圣衣组合\\白银天琴座圣衣组合.ecm",
	    },
	},
	--祭坛座等新白银圣衣
	[10742] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10755] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10718] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10752] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10749] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10753] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10720] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10750] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10722] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10713] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	
	-------------------------------------------------------------------------------------
	[10706] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10748] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[18229] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},

	[18223] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[18228] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	
	[18232] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10724] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[43232] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10751] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	[10744] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\通用白银圣衣箱\\通用白银圣衣箱.ecm",
	    },
	},
	
	-------------------------------------------------------------------------------------
	
	[10725] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\白羊座圣衣组合版\\黄金圣斗士白羊座圣衣组合版.ecm",
	    },
	},
	[10726] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\金牛座圣衣组合版\\黄金圣斗士金牛座圣衣组合版.ecm",
	    },
	},
	[10727] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\双子座圣衣组合版\\黄金圣斗士双子座圣衣组合版.ecm",
	    },
	},
	[10728] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\巨蟹座圣衣组合版\\黄金圣斗士巨蟹座圣衣组合版.ecm",
	    },
	},
	[10729] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\狮子座圣衣组合版\\黄金圣斗士狮子座圣衣组合版.ecm",
	    },
	},
	[10730] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\处女座圣衣组合版\\黄金圣斗士处女座圣衣组合版.ecm",
	    },
	},
	[10731] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天秤座圣衣组合版\\黄金圣斗士天秤座圣衣组合版.ecm",
	    },
	},
	[10732] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天蝎座圣衣组合版\\黄金圣斗士天蝎座圣衣组合版.ecm",
	    },
	},
	[10733] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\射手座圣衣组合版\\黄金圣斗士射手座圣衣组合版.ecm",
	    },
	},
	[10734] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\摩羯座圣衣组合版\\黄金圣斗士摩羯座圣衣组合版.ecm",
	    },
	},
	[10735] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\水瓶座圣衣组合版\\黄金圣斗士水瓶座圣衣组合版.ecm",
	    },
	},
	[10736] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\双鱼座圣衣组合版\\黄金圣斗士双鱼座圣衣组合版.ecm",
	    },
	},

	[10737] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\天马座1级圣衣组合版\\天马座1级圣衣组合版.ecm",
	    },
	},

	[31147] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},

	[34325] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},

	[34326] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	------------------------
	[35680] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	
	[35681] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	
	[35682] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	
	[35683] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	
	[35684] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	
	[38923] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	[43233] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},
	------------------------
	
	[34324] = 
	{
	    normal = {
	              [1] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣箱\\海皇箱子\\海皇箱子.ecm",
	    },
	},
	
	[38921] = 
	{
	    normal = {
	              [1] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [2] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [3] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [4] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [5] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	    },
	    surplice = {
	              [1] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [2] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [3] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [4] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [5] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	    },
	},

	[38922] = 
	{
	     normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},	
	[43234] = 
	{
	    normal = {
	              [1] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [2] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [3] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [4] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [5] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	    },
	    surplice = {
	              [1] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [2] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [3] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [4] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	              [5] = "models\\矿物\\海龙座鳞衣组合版\\海龙座鳞衣组合版2.ecm",
	    },
	},
	[43235] = 
	{
	     normal = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	    surplice = {
	              [1] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [2] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [3] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [4] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	              [5] = "models\\Players\\道具\\圣衣组合版\\冥衣箱子\\冥衣箱子.ecm",
	    },
	},	
}

SaintClothCameraCfg = 
{
	--相机每帧旋转角度
	rot_angle_per_tick = 1,
	--相机位置x, y, z, fov
	default = {0.0, 0.53, -3.0, 23},
	[10726] = {0.0, 0.53, -3.0, 30},
}

function SaintClothSuiteModels:GetModel(saintId,isSurplice,formLev)
	if not self[saintId] then
		return nil
	end
	local models = nil
	if isSurplice then
		models = self[saintId].surplice
	else
		models = self[saintId].normal
	end
	if not models then
		return nil
	end
	return models[formLev+1]
end

function SaintClothCameraCfg:GetCameraSetting(saintId)
	local cameraCfg = SaintClothCameraCfg[saintId]
	if not cameraCfg then
		cameraCfg = SaintClothCameraCfg.default
	end
	return cameraCfg,SaintClothCameraCfg.rot_angle_per_tick
end
