--[[ @i18n social ]]
local _t = require("i18n").context("social")
lbase_collection = {
    [0]=
        {
        scene_arg1 = 400,
        req1 = 30,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 30,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 30,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 0,
        desc = _t"",
        desc2 = _t"基座状态基地的奖励：\r双倍时间：每周2小时\r修炼抗性药店开放\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r商店售卖：融合之源等道具",
},
    [1]=
        {
        scene_arg1 = 400,
        req1 = 90,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 90,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 90,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 135,
        desc = _t"军团奇迹被毁将扣除军团资源各40点。",
        desc2 = _t"1级基地的奖励：\r商店售卖：融合之源等道具\r修炼抗性药店开放\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r商店售卖：增加星砂之源、储存经验药水等道具",
},
    [2]=
        {
        scene_arg1 = 400,
        req1 = 180,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 180,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 180,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 337,
        desc = _t"军团奇迹被毁将扣除军团资源各101点。",
        desc2 = _t"2级基地的奖励：\r商店售卖：增加星砂之源、储存经验药水等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r军团仓库开放\r双倍时间：每周3小时\r商店售卖：增加领域之源、生产精力药水等",
},
    [3]=
        {
        scene_arg1 = 400,
        req1 = 315,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 315,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 315,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 900,
        desc = _t"军团奇迹被毁将扣除军团资源各270点。",
        desc2 = _t"3级基地的奖励：\r军团仓库开放\r双倍时间：每周3小时\r商店售卖：增加领域之源、生产精力药水等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级级基地福利额外增加：\r商店售卖：增加魔盒能量补充剂等道具",
},
    [4]=
        {
        scene_arg1 = 400,
        req1 = 450,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 450,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 450,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 1800,
        desc = _t"军团奇迹被毁将扣除军团资源各540点。",
        desc2 = _t"4级基地的奖励：\r商店售卖：增加魔盒能量补充剂等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r商店售卖：增加军团特供回复药等道具",
},
    [5]=
        {
        scene_arg1 = 400,
        req1 = 675,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 675,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 675,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 2250,
        desc = _t"军团奇迹被毁将扣除军团资源各675点。",
        desc2 = _t"5级基地的奖励：\r商店售卖：增加军团特供回复药等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r双倍时间：每周4小时\r商店售卖：增加星玉礼包等道具",
},
    [6]=
        {
        scene_arg1 = 400,
        req1 = 900,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 900,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 900,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 2700,
        desc = _t"军团奇迹被毁将扣除军团资源各810点。",
        desc2 = _t"6级基地的奖励：\r双倍时间：每周4小时\r商店售卖：增加星玉礼包等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r商店售卖：增加白银之血等道具",
},
    [7]=
        {
        scene_arg1 = 400,
        req1 = 1350,
        note1 = _t"青铜熔炼石",
        scene_arg2 = 401,
        req2 = 1350,
        note2 = _t"象牙雕刻刀",
        scene_arg3 = 402,
        req3 = 1350,
        note3 = _t"酿酒发酵剂",
        matainance_fee = 2925,
        desc = _t"军团奇迹被毁将扣除军团资源各1755点。",
        desc2 = _t"7级基地的奖励：\r商店售卖：增加白银之血等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"下一级基地福利额外增加：\r商店售卖：增加神魔之血等道具",
},
    [8]=
        {
        scene_arg1 = 0,
        req1 = 0,
        note1 = _t"",
        scene_arg2 = 0,
        req2 = 0,
        note2 = _t"",
        scene_arg3 = 0,
        req3 = 0,
        note3 = _t"",
        matainance_fee = 3375,
        desc = _t"军团奇迹被毁将扣除军团资源各2025点。",
        desc2 = _t"8级基地的奖励：\r商店售卖：增加神魔之血等道具\r时光宝盒的数量与排位赛等级和军团基地等级相关",
        desc3 = _t"您的军团基地已经达到顶级。",
},
}