--[[ @i18n social ]]
local _t = require("i18n").context("social")
------------------------------
-- 军团建设配置
-- Created by fengbo
--[[
在下面的配置中的建筑描述和科技描述字符串中目前可以使用以下特殊通配符：
${npc(id)}            显示一个npc链接

--]]

-- 军团维护等级所使用的声望ID
maintenance_level_repu_id = 0

-- 记录军团目前是升级后第几周所使用的声望ID
cost_index_repu_id = 14

-- 资源的声望ID、名称、说明配置


resources = 
{
	{
		repu_id = 7,
		has_weekly_cost = true,
		name = _t"神之乡石料",
		icon = "soci\\石头5.dds",
		desc = _t"产于奥林匹克山的石料，是神之乡的建筑材料。",
	},
	{
		repu_id = 8,
		has_weekly_cost = true,
		name = _t"神之乡木材",
		icon = "soci\\木材堆.dds",
		desc = _t"产于奥林匹克山的树木，是神之乡的建筑材料。",
	},
	{
		repu_id = 9,
		has_weekly_cost = true,
		name = _t"神之乡矿石",
		icon = "soci\\黑铁矿.dds",
		desc = _t"产于奥林匹克山的矿藏，是神之乡的建筑材料。",
	},
	{
		repu_id = 10,
		name = _t"青铜之魂",
		icon = "soci\\海洋结晶.dds",
		desc = _t"曾经的青铜圣斗士的灵魂！",
	},
	{
		repu_id = 11,
		name = _t"白银之魂",
		icon = "soci\\光明元素.dds",
		desc = _t"曾经的白银圣斗士的灵魂！",
	},
	{
		repu_id = 12,
		name = _t"黄金之魂",
		icon = "soci\\火之微粒.dds",
		desc = _t"曾经的黄金圣斗士的灵魂！",
	},
}

-- 配置资源上限
resource_max_cfg =
{
	{200,400,600,800,1000}, -- 资源1在军团维护等级1-5时的上限
	{200,400,600,800,1000},
	{200,400,600,800,1000},
	{100,100,100,100,100},
	{100,100,100,100,100},
	{100,100,100,100,100},
}

-- 资源每周消耗配置

-- 配置了has_weekly_cost=true的资源会在此查找每周消耗

resource_weekly_cost_cfg =
{
	{0,120}, -- 资源在升级到维护等级1后第x周时的每周消耗

	{0,120}, -- 资源在升级到维护等级2后第x周时的每周消耗

	{0,240},
	{0,360},
	{0,480},
}

--[[
在下面的配置中，每个军团建筑下可配置多个科技，其中需要说明的是科技配置的level和level_condition两个字段：


level 为一个table，假设目前该建筑等级为building_level，则科技等级则为：

	level[building_level]，找不到则为0
level_condition 也是一个table，假设目前科技等级为tech_level，则界面上显示的科技下一级升级条件为：

	level_condition[tech_level + 1]，找不到则不显示
--]]

-- 军团建筑配置
buildings =
{
	{
		repu_id = 1,
		name = _t"爱神殿",
		icon = "soci\\蓝色血之晶石.dds",
		desc = _t"祭祀爱神阿芙罗狄忒之处，她是爱的象征！爱神殿的等级越高，她的能力越强，可以到${npc(23561)}处提升爱神殿的等级。",
		tech =
		{
			{
				name = _t"爱神的祈祷",
				desc = _t"每天你都可以到${npc(23565)}处像爱神祈祷，并获得储存经验，爱神殿的等级越高，每天可以获得的储存经验越多！",
				icon = "soci\\技能_强效加血_圣琴.dds",
				level = {1, 2, 3, 4, 5},
				level_condition = 
				{
					_t"爱神殿1级方可激活，可以每天来领取储存经验！",
					_t"爱神殿2级方可激活下一级，每天可以领取更多的储存经验！",
					_t"爱神殿3级方可激活下一级，每天可以领取更多的储存经验！",
					_t"爱神殿4级方可激活下一级，每天可以领取更多的储存经验！",
					_t"已达到最高等级！",
				},
			},
		},
	},
	{
		repu_id = 2,
		name = _t"酒神殿",
		icon = "soci\\黄色血之晶石.dds",
		desc = _t"祭祀酒神狄俄尼索斯之处，他的狂欢仪式有着醉人的力量！酒神殿的等级越高，他的能力越强，可以到${npc(23561)}处提升酒神殿的等级。",
		tech =
		{
			{
				name = _t"百邪不侵",
				desc = _t"可以到${npc(23569)}处购买神物，神物可以增加你的抗性，让你在于其他玩家战斗时受到更少的伤害！",
				icon = "soci\\技能_反震 _剑盾.dds",
				level = {1, 2, 3, 4,5},
				level_condition = 
				{
					_t"酒神殿1级方可激活，可以购买优秀品质的神物！",
					_t"酒神殿2级方可激活下一级，可以购买精良品质的神物！",
					_t"酒神殿3级方可激活下一级，可以购买史诗品质的神物！",
					_t"酒神殿4级方可激活下一级，可以购买传说品质的神物！",
					_t"已达到最高等级！",
				},
			},
		},
	},
	{
		repu_id = 3,
		name = _t"月神殿",
		icon = "soci\\白色血之晶石.dds",
		desc = _t"祭祀月神阿尔忒弥斯之处，她掌管着夜间的魔法！月神殿的等级越高，她的能力越强，可以到${npc(23561)}处提升月神殿的等级。",
		tech =
		{
		},
	},
	{
		repu_id = 4,
		name = _t"火神殿",
		icon = "soci\\红色血之晶石.dds",
		desc = _t"祭祀火神赫淮斯托斯之处，他又被称做工匠之神！火神殿的等级越高，他的能力越强，可以到${npc(23561)}处提升火神殿的等级。",
		tech =
		{
		},
	},
	{
		repu_id = 5,
		name = _t"战神殿",
		icon = "soci\\黑色血之晶石.dds",
		desc = _t"祭祀战神阿瑞斯之处，他是为战争而战的神！战神殿的等级越高，他的能力越强，可以到${npc(23561)}处提升战神殿的等级。",
		tech =
		{
			{
				name = _t"军团战力",
				desc = _t"在战神的庇护之下，提升所有军团内玩家的力量与体力。战神殿的级别越高，提升的等于属性越多！",
				icon = "soci\\攻击增加.dds",
				level = {[0]=1, 2, 3, 4, 5},
				level_condition = 
				{
					_t"战神殿1级方可激活，可以增加军团内玩家的力量！",
					_t"战神殿2级方可激活下一级，可以增加军团内玩家的力量与体力！",
					_t"战神殿3级方可激活下一级，增加更多军团内玩家的力量与体力！",
					_t"已达到最高等级！",
					_t"已达到最高等级！",
				},
			},
		},
	},
	{
		repu_id = 6,
		name = _t"牧神殿",
		icon = "soci\\青色血之晶石.dds",
		desc = _t"祭祀牧神赫尔墨斯之处，他速度如飞，又被称做商人的保护神！牧神殿的等级越高，他的能力越强，可以到${npc(23561)}处提升牧神殿的等级。",
		tech =
		{
			{
				name = _t"心有灵犀",
				desc = _t"在牧神的帮助下，你与坐骑可以更好的领会对方意图，使你骑乘时速度增加。牧神殿的等级越高，增加的速度越快！",
				icon = "soci\\骑坐.dds",
				level = {1, 2, 3, 4, 5},
				level_condition = 
				{
					_t"需求牧神殿1级方可激活，可以提升玩家骑乘时的速度！",
					_t"需求牧神殿2级方可激活下一级，提升更高的玩家骑乘时速度！",
					_t"需求牧神殿3级方可激活下一级，提升更高的玩家骑乘时速度！",
					_t"需求牧神殿4级方可激活下一级，提升更高的玩家骑乘时速度！",
					_t"已经是最高等级！",
				},
			},
		},
	},
}
