---------------------------------------------------------------
--  created:   2012.2.20
--  author:    hanwei
--
--  音频资源  ---------------------------------------------------------------


module("AUTO_2D_SOUND")
local trigger_music={
[1]="{473d36e0-09c6-4cfd-8bf8-65aa4cc79457}",   --军团相关\激励通知
[2]="{daf7a7d0-4b7e-4f82-aad9-7c1da5bbf169}",   --军团相关\军团升级
[3]="{7dc9e914-0b8c-4b61-85a3-322b9c9b3127}",   --军团相关\军团战战斗
[4]="{aed96047-d15a-4bcf-aa32-af4aad978915}",   --军团相关\军团战战斗1
[5]="{ca2d5882-463f-4eed-93d2-37a96685dadc}",   --军团相关\军团战准备
[6]="{d826d429-a499-4ed4-a764-f4f5506b79a9}",   --军团相关\危机通知
[7]="{bfb32522-fe78-428e-acb7-03e993e6aca0}",   --群殴竞技场\群殴竞技场胜利
[8]="{d9338260-4a92-4ec9-8e30-13a992a496de}",   --群殴竞技场\群殴竞技场失败
[9]="{dce11c78-abf9-45ec-be1b-69767f9e15d3}",   --群殴竞技场\群殴竞技场战斗
[10]="{de006456-35f9-4cf6-b603-a0d9bc0d10fe}",   --荣誉主题\成就达成
[11]="{8baf379e-ed67-4a2b-98d0-a45e3939117c}",   --荣誉主题\副本完成
[12]="{f8eaec5c-0039-48ea-a2ef-d75f6841a332}",   --荣誉主题\人物升级1
[13]="{ef647a2b-d5e5-4eb7-8309-64c96e12379a}",   --荣誉主题\人物升级2
[14]="{747923d0-999e-4f45-9bf1-bddca689bbbb}",   --荣誉主题\图鉴获得
[15]="{d708a390-ae68-42b8-be03-4a5b3eb790b6}",   --荣誉主题\小宇宙升级
[16]="{2ca52447-b75c-4c41-98ff-a447817db7ee}",   --探索相关\地图探索
[17]="{2884856b-a2a7-4bed-a710-0ef5fc0e82b8}",   --探索相关\篇章开启
[18]="{72e843ce-f90f-444f-b8db-336268c2755b}",   --任务相关\任务接取
[19]="{268371cf-9e6f-4a37-bc23-381ffe6f1579}",   --任务相关\任务完成

}

LEVEL_UP              				= 	""
TASK_FINISH           				= 	"{ef42365b-a381-4f03-b9b5-2b4d4abca0fb}"
INVITE_PROMPT         				= 	""
WHISPER_PROMPT        				= 	""
BATTLE_START          				= 	""
START_ACCELERATE_RUN  				= 	"{192865f4-e718-4715-8659-39d345320d06}"
ACHI_COMPLETE						=	trigger_music[10]	-- 成就达成
TITLE_OBTAIN						=	""	-- 称号获得
PHOTOBOOK_OBTAIN					=	trigger_music[14]	-- 图鉴获得
COSMOS_LEV_UP						= 	trigger_music[15]	-- 小宇宙升级
REPU_LEV_UP							=	""	-- 声望升级
LEAGUE_GAME_READY                   =     trigger_music[5]  -- 军团排位赛准备
LEAGUE_GAME_START					=	trigger_music[3]	-- 军团排位赛开始
LEAGUE_GAME_ENEMY_BULIDING_RUIN		=	trigger_music[1]	-- 摧毁敌方建筑
LEAGUE_GAME_SELF_BULIDING_RUIN		=	trigger_music[6]	-- 摧毁己方建筑
LEISURE_ARENA_WIN                   =   trigger_music[7]  --慢节奏pvp胜利
LEISURE_ARENA_LOSE                  =   trigger_music[8]  --慢节奏pvp失败
LEISURE_ARENA_FIGHT                 =   trigger_music[9]  --慢节奏pvp战斗
DUNGEON_SUCCESS						=	trigger_music[11]  -- 副本胜利




-- 界面动态指引音频配置

voiceguide={
   male={
      [1]="{9234b401-fc2d-4a14-af2a-92670acc82dc}",
      [2]="{226dfd16-e79f-47aa-ad85-255512d05480}",
      [3]="{766b9c22-974a-4abb-acf5-0120b76f8f11}",
      [4]="{1897003f-1062-490c-818c-618f9d4a015c}",
      [5]="{c097673a-2593-4e6a-8ac5-7aa09deffd4a}",
      [6]="{7ebfa482-34c7-4ac8-81ac-c6a06b21fd2d}",
      [7]="{586f23ef-000d-427f-9e33-5a5e25aaca5a}",
      [8]="{54c246ae-c841-45eb-966f-abbeef1b33f8}",
      [9]="{3d9e7760-6436-4c1d-a342-2a5ee32d38fa}",
      [10]="{a659b11d-87c3-48c6-9921-ed2dda415574}",
      [11]="{568fae9b-3b1e-4075-b609-106defb29089}",
      [12]="{3626a14c-bff5-47b8-ae4b-a319f52ed0e4}",
      [13]="{95147c11-9d2f-461c-bfad-18906dfd8425}",
      [14]="{df88d767-5ad2-46de-8f6f-bbb0d3de8a19}",
      [15]="{cdbe3588-b8d8-49b3-8cd4-60737b14264f}",
      [16]="{f81926a7-a449-4ddd-8ae7-afc600a4d96b}",
      [17]="{9e10e5b9-bcf5-4ff2-b279-dfa105b51662}",
      [18]="{db9f95f1-303c-4425-91c6-0e085be33a35}",
      [19]="{654a5436-144f-433b-8a4c-0aef88182464}",
      [20]="{acb62518-1c7a-490b-b011-44444754a4eb}",
      [21]="{ee022646-63a9-4398-a2c6-9b519253de0a}",
      [22]="{200d1f72-61c0-44ea-839a-1823d446fa94}",
      [23]="{e3acc9d1-fde1-4780-bebb-5d288c6fe26e}",
      [24]="{07a40f31-7654-4c8e-b972-b159948054c9}",
      [25]="{a13b9392-9030-4f13-90e4-6c8aae901587}",
      [26]="{d8a72fa0-8dc8-437b-9ab1-7cdf3a780978}",
      [27]="{def106c9-9674-4d22-acd4-81d9e424f423}",
      [28]="{6e62e8fd-6a9d-4b47-a470-dfa8b449b9e8}",
      [29]="{6975cdf4-ea39-4782-9a6d-042c37af9236}",
      [30]="{c616c8c6-62e4-41ec-aeb1-497e351964db}",
      [31]="{34d3e3b7-4c82-4f77-b6fd-e507c32e61f5}",
      [32]="{4fc2460e-81da-4cac-9916-4b604a646149}",
      [33]="{5c6ac3f4-e4e2-4e0e-b368-c60bdb1d0e63}",
      [34]="{cb6ea447-d582-4f8b-84da-40cdba9f988d}",
      [35]="{c4a7b100-f48c-449c-9df7-5116212a033a}",
      [36]="{90a1a37f-e204-400c-b249-b6a56a5a0422}",
      [37]="{473de02a-8adc-4874-a688-4100cfc24317}",
      [38]="{3831a255-ce36-4653-a360-80bd6de7840c}",
      [39]="{b55ef1ef-a4b5-4245-a768-2f950f4a693d}",
      [40]="{341052ce-5a0a-4475-9bc6-975bb744f3b8}",
      [41]="{47574bfe-ce8a-4335-8622-1d3a6cbedc47}",
      [42]="{c8beb9bb-bc6a-4cd2-8f4c-484e2dda92fc}",
      [43]="{d3da120e-6452-453e-aae2-2fadf25b4612}",
      [44]="{1000883a-4e13-45f5-9855-577f576a805c}",
      [46]="{08e574d5-f1b0-4395-be28-d2c4acb3fbfe}",
      [47]="{36f3069f-efc1-4052-b115-e939514e52e3}",
      [48]="{55628550-1fb4-438e-9832-21503b436dbe}",
      [49]="{7a2eaa6b-6945-4dea-a4ea-b247da017ca2}",
      [50]="{8bdd3b08-634a-439d-99f7-f1f11740592f}",
      [51]="{87f770fe-0c15-4f45-b4b2-bc4aa4f0feeb}",
      [52]="{e3822815-ac72-43ee-b3f3-6cdf0e08ab5d}",
      [53]="{58d20251-f8ea-4adc-8c8f-2383db07153a}",
      [54]="{9a6b7187-20af-43e5-af43-94b3d02273e4}",
      [55]="{60926068-819b-4746-98a6-febe880b4d1d}",
      [56]="{483f7b4e-fbc2-4314-95dc-17b36e9db535}",
      [57]="{ac6472c2-cad9-47eb-aeb1-f10b911bb9d6}",
      [58]="{84cd1e1a-f346-470a-839b-3fe6c182a23d}",
      [59]="{c475e7e8-b7fd-4201-9182-cf955d7c143b}",
      [60]="{3286059a-11b4-4db5-bc61-d65a2d68665b}",
   },
   female={
      [1]="{4aec6ce9-3b28-4d51-a47f-d4e69d6f9c14}",
      [2]="{67bbced2-419d-40ac-b9a8-16b0df5fb1ff}",
      [3]="{8abc63b7-cc58-4b22-bcc6-19e8c1272fac}",
      [4]="{6493e0ee-3cec-426c-a2da-31b0f2a2fd20}",
      [5]="{4f48b1bf-ed93-4ebd-ade0-032e031ec482}",
      [6]="{e0ba627c-7c7e-41b6-aca9-0a6ba428bf44}",
      [7]="{2c8bc91b-1d99-4509-a3ce-c24b62aedd57}",
      [8]="{db988d39-6279-403a-b2e3-f68a46b735a0}",
      [9]="{d3eb6a0c-9bd6-4838-87da-6f547fc81f2b}",
      [10]="{b830f200-47e1-478f-ac95-dd6e4a10731f}",
      [11]="{81516584-9da6-4fa9-8548-23f1ac76180d}",
      [12]="{3591da83-6b1d-4c3c-aede-49845a55bba8}",
      [13]="{a75918a8-64ea-49c8-88da-9de17cc56ce2}",
      [14]="{d8d165cc-1920-40ea-b59e-ce8691600845}",
      [15]="{f6e0e0f4-83a9-4966-bda5-41dfc8c050da}",
      [16]="{9710cfed-5090-4721-a816-5a5c725f434f}",
      [17]="{81c8f77e-598f-4263-af35-21fc5d491f6e}",
      [18]="{2e5fe076-2f98-46b1-bcd7-cf60f123f50a}",
      [19]="{309d3689-a225-4ea4-9150-66e638f461be}",
      [20]="{6fb0e291-243a-495c-854e-251067a32c90}",
      [21]="{fccb56d4-1f94-4d51-bfa6-d21609132162}",
      [22]="{f50da1a0-888d-41cf-b241-9fe60f3c97f3}",
      [23]="{6c409cd8-b927-411b-9266-87da8359484e}",
      [24]="{be19b5e3-867f-4e4f-a49c-82630db8ff08}",
      [25]="{79c32428-c328-411c-bbf7-d1b2c3d88d93}",
      [26]="{95d0594e-3c99-4607-a0fc-82618d52eb83}",
      [27]="{71b7c7f1-d8d9-4ded-bbc7-810ecc042036}",
      [28]="{ba96b626-a343-4524-a3b2-90d3ccb75548}",
      [29]="{2c491332-ab91-4b61-9b29-92377f71ad91}",
      [30]="{d9610a80-223a-4e07-a6ec-84b244870c2c}",
      [31]="{baca5e89-0015-4e00-aeaa-9442b26c4e62}",
      [32]="{d4cf3ee7-ed86-4df5-a575-f5798342dba1}",
      [33]="{2920d5e9-281c-4057-92c9-1b1c24fbaf3a}",
      [34]="{b620f27f-b734-463f-8669-10763af220d3}",
      [35]="{ae602e2c-f592-4d30-8f30-105939f42a37}",
      [36]="{020b016b-aa33-4a38-8a1b-6664f4784ae7}",
      [37]="{d7909bc4-02f8-4b06-a639-3be8877a3c3e}",
      [38]="{0b52ada8-64a8-418e-b606-22af4edf9755}",
      [39]="{9139c691-7697-474b-be1e-bd8d23dc5691}",
      [40]="{c6efe3ad-a433-47cf-b22c-6f0a5d8cf30c}",
      [41]="{f2f1f305-3e17-43d4-a316-5b46e5f481ba}",
      [42]="{8a14440a-a739-4d84-b06f-b8be6f2224d7}",
      [43]="{43c2b845-c0b1-4fd5-b3ce-c80127ff0981}",
      [44]="{9a4a806f-252f-41f5-aa96-95ea902c10bb}",
      [46]="{c7e538d5-0ecc-40ef-9b76-ae52ade4e2fe}",
      [47]="{a37f32b3-7a9e-4da4-9778-01ae0e348c45}",
      [48]="{e09df91d-d841-4735-9bb4-ef7de8d7fdce}",
      [49]="{714b5d78-ef6b-4e15-befa-cb32996ddb18}",
      [50]="{4999502b-ad31-4494-965f-24f2110225a6}",
      [51]="{01787b04-a083-42cc-b269-c2e6c6434762}",
      [52]="{fcc272d9-34fa-45cd-9204-a242ffab25e3}",
      [53]="{6bca7da5-d0af-4416-9674-94421653349f}",
      [54]="{982e7ff0-75cc-45ad-a7e3-7522354061dd}",
      [55]="{f147b5d5-2d1d-4b10-9690-a18565213f32}",
      [56]="{d21954bf-adda-4ad1-a62e-fb2880f05e6b}",
      [57]="{e52a67ec-af90-4878-901f-5557ad2c2369}",
      [58]="{5d35f8e9-6f4c-43d8-8a82-c7d2b9154e57}",
      [59]="{70d68a55-7707-4038-8889-07187b95335f}",
      [60]="{d46881af-b9f1-4e4b-b04b-34bf41a843b4}",
   },
}


function Get2DSoundGUID(self, key)
    return self[key]
end
