--[[ @i18n animation ]]
local _t = require("i18n").context("animation")

module("STRING_TABLE")

----------------------新手村-------------------------

--新手修行地_天马
_M["ANIMATION_1002_天马_魔铃_1"] = _t"听着 破坏物体的根本"
_M["ANIMATION_1002_天马_魔铃_2"] = _t"就是要将原子粉碎"
_M["ANIMATION_1002_天马_魔铃_3"] = _t"集中你的力量"
_M["ANIMATION_1002_天马_魔铃_4"] = _t"看来你已经有资格参加圣衣争夺赛了"
_M["ANIMATION_1002_天马_player_1"] = _t"天马座圣衣 一定是我的"

--新手修行地_白鸟
_M["ANIMATION_1002_白鸟_卡妙_1"] = _t"你已经有资格去圣域参加圣衣争夺赛了"
_M["ANIMATION_1002_白鸟_player_1"] = _t"白鸟座圣衣"
_M["ANIMATION_1002_白鸟_player_2"] = _t"一定是我的"


--新手修行地_天龙
_M["ANIMATION_1002_天龙_童虎_1"] = _t"光靠蛮力是不行的"
_M["ANIMATION_1002_天龙_童虎_2"] = _t"圣域的争夺赛就要开始了"
_M["ANIMATION_1002_天龙_童虎_3"] = _t"如果你想得到圣衣"
_M["ANIMATION_1002_天龙_童虎_4"] = _t"就必须领悟小宇宙的力量"
_M["ANIMATION_1002_天龙_player_1"] = _t"童虎老师 我一定会拿到天龙座圣衣"


--新手修行地_仙女
_M["ANIMATION_1002_仙女_仙王座_1"] = _t"想不到你体内还有这样的力量"
_M["ANIMATION_1002_仙女_仙王座_2"] = _t"你已经有资格去圣域参加圣衣争夺赛了"
_M["ANIMATION_1002_仙女_player_1"] = _t"老师 我一定会拿到仙女座圣衣"


--新手修行地_凤凰
_M["ANIMATION_1002_凤凰_基鲁提_1"] = _t"怨恨吧"
_M["ANIMATION_1002_凤凰_基鲁提_2"] = _t"怨恨你的敌人 怨恨这个世界"
_M["ANIMATION_1002_凤凰_基鲁提_3"] = _t"你不需要慈悲 更不需要软弱 用你怨恨的力量"
_M["ANIMATION_1002_凤凰_基鲁提_4"] = _t"粉碎眼前的一切吧"
_M["ANIMATION_1002_凤凰_player_1"] = _t"谁也不能阻止我去圣域"
_M["ANIMATION_1002_凤凰_player_2"] = _t"凤凰座圣衣 一定是我的"


--新手村--穆救玩家
_M["ANIMATION_1005_player_1"] = _t"怎么消失了"
_M["ANIMATION_1005_player_2"] = _t"究竟是怎么回事"
_M["ANIMATION_1005_穆_1"] = _t"这些问题 以后你会知道答案"
_M["ANIMATION_1005_穆_2"] = _t"总之 先离开这里"

--新手村--黄金幻象战斗_天马
_M["ANIMATION_1004_天马_艾欧里亚_1"] = _t"啊"
_M["ANIMATION_1004_天马_艾欧里亚_2"] = _t"真是乏味啊"
_M["ANIMATION_1004_天马_艾欧里亚_3"] = _t"你的拳头就这么慢吗"
_M["ANIMATION_1004_天马_艾欧里亚_4"] = _t"愚蠢"
_M["ANIMATION_1004_天马_艾欧里亚_5"] = _t"区区青铜圣斗士"
_M["ANIMATION_1004_天马_艾欧里亚_6"] = _t"太慢了"
_M["ANIMATION_1004_天马_艾欧里亚_7"] = _t"在你死之前 先带你去见一个人"
_M["ANIMATION_1004_天马_player_1"] = _t"啊"
_M["ANIMATION_1004_天马_player_2"] = _t"这里是"
_M["ANIMATION_1004_天马_player_3"] = _t"圣域吗"
_M["ANIMATION_1004_天马_player_4"] = _t"为什么会突然来到这里"
_M["ANIMATION_1004_天马_player_5"] = "..."
_M["ANIMATION_1004_天马_player_6"] = _t"魔铃老师"
_M["ANIMATION_1004_天马_player_7"] = _t"这是"
_M["ANIMATION_1004_天马_艾欧里亚_8"] = _t"眼前这人你应该不陌生吧"
_M["ANIMATION_1004_天马_player_8"] = _t"放了她"
_M["ANIMATION_1004_天马_艾欧里亚_9"] = _t"我可没有囚禁她"
_M["ANIMATION_1004_天马_魔铃_1"] = _t"我愿永远效忠于您 大人"
_M["ANIMATION_1004_天马_player_9"] = _t"这 这不可能"
_M["ANIMATION_1004_天马_艾欧里亚_10"] = _t"魔铃和艾德都选择了效忠于我，不要再做挣扎了"
_M["ANIMATION_1004_天马_艾欧里亚_11"] = _t"嗯"
_M["ANIMATION_1004_天马_艾欧里亚_12"] = _t"难道你 怎么可能"
_M["ANIMATION_1004_天马_player_10"] = _t"圣斗士只会选择爱与正义"
_M["ANIMATION_1004_天马_player_11"] = _t"收起你的阴谋"
_M["ANIMATION_1004_天马_艾欧里亚_13"] = _t"竟然能看破我的幻境 但别高兴的太早"
_M["ANIMATION_1004_天马_艾欧里亚_14"] = _t"闪电光速拳"
_M["ANIMATION_1004_天马_艾欧里亚_15"] = _t"真是愚蠢 你根本没有胜算"
_M["ANIMATION_1004_天马_player_12"] = _t"就算拼上性命 我也要打倒你"
_M["ANIMATION_1004_天马_艾欧里亚_16"] = _t"可笑"
_M["ANIMATION_1004_天马_艾欧里亚_17"] = _t"嗯"
_M["ANIMATION_1004_天马_艾欧里亚_18"] = _t"简直是自寻死路"

--新手村--黄金幻象战斗 _天龙
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_1"] = _t"哼哼哼哼"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_2"] = _t"我最讨厌你们这种不知死活的家伙"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_3"] = _t"积尸气冥界波"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_4"] = _t"去地狱找你的真相吧"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_5"]= _t"就让这些曾今被我杀死的人 好好折磨你吧"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_6"]= _t"他们没有痛苦 不会死亡 仇视一切生灵"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_7"]= _t"好好享受吧"
_M["ANIMATION_1004_天龙_player_1"] = _t"开什么玩笑 我可不想死在这种地方"
_M["ANIMATION_1004_天龙_player_2"] = _t"果然打不死吗"
_M["ANIMATION_1004_天龙_player_3"] = _t"那就把你们打下去"
_M["ANIMATION_1004_天龙_小女孩_1"] = _t"哥哥"
_M["ANIMATION_1004_天龙_小女孩_2"] = _t"姐姐"
_M["ANIMATION_1004_天龙_player_4"] = _t"嗯"
_M["ANIMATION_1004_天龙_player_5"] = _t"你是谁 为什么会在这"
_M["ANIMATION_1004_天龙_player_6"] = _t"我这是 死了吗"
_M["ANIMATION_1004_天龙_player_7"] = _t"我感觉到一股温暖的小宇宙"
_M["ANIMATION_1004_天龙_player_8"] = _t"圣衣正在传递给我力量"
_M["ANIMATION_1004_天龙_player_9"] = _t"燃烧吧 我的小宇宙"
_M["ANIMATION_1004_天龙_player_10"] = _t"庐山 升 龙 霸"
_M["ANIMATION_1004_天龙_player_11"] = _t"我不会被困在这里的"
_M["ANIMATION_1004_天龙_player_12"] = _t"就算要死 也不会死在这里"
_M["ANIMATION_1004_天龙_player_13"] = _t"我从地狱回来了 迪斯马斯克"
_M["ANIMATION_1004_天龙_巨蟹座迪斯马斯克_8"]= _t"嗯"

--新手村--黄金幻象战斗 _凤凰
_M["ANIMATION_1004_凤凰_处女座沙加_1"] = _t"自不量力"
_M["ANIMATION_1004_凤凰_处女座沙加_2"] = _t"你来这里简直就是送死。"
_M["ANIMATION_1004_凤凰_处女座沙加_3"] = _t"落入地狱的轮回吧"
_M["ANIMATION_1004_凤凰_处女座沙加_4"] = _t"六道轮回"
_M["ANIMATION_1004_凤凰_处女座沙加_5"] = _t"开"
_M["ANIMATION_1004_凤凰_player_1"] = _t"这是什么"
_M["ANIMATION_1004_凤凰_player_2"] = _t"无法击碎"
_M["ANIMATION_1004_凤凰_处女座沙加_6"] = _t"天魔降伏"
_M["ANIMATION_1004_凤凰_处女座沙加_7"] = _t"中了我的天魔降伏"
_M["ANIMATION_1004_凤凰_处女座沙加_8"] = _t"你竟然还能站的起来。"
_M["ANIMATION_1004_凤凰_player_3"] = _t"哼 只有这种程度吗"
_M["ANIMATION_1004_凤凰_处女座沙加_9"] = _t"不得不佩服你的毅力"
_M["ANIMATION_1004_凤凰_处女座沙加_10"] = _t"之前还是小看你了"
_M["ANIMATION_1004_凤凰_处女座沙加_11"] = _t"那就让你见识我真正的实力吧"
_M["ANIMATION_1004_凤凰_处女座沙加_12"] = _t"天舞宝轮"
_M["ANIMATION_1004_凤凰_player_4"] = _t"什么"
_M["ANIMATION_1004_凤凰_处女座沙加_13"] = _t"第一感，剥夺"
_M["ANIMATION_1004_凤凰_处女座沙加_14"] = _t"你已经失去触觉 犹如一个废人"
_M["ANIMATION_1004_凤凰_player_5"] = _t"什 什么"
_M["ANIMATION_1004_凤凰_处女座沙加_15"] = _t"你现在已经无法挥拳了"
_M["ANIMATION_1004_凤凰_player_6"] = _t"开什么玩笑 我一定会打倒你"
_M["ANIMATION_1004_凤凰_处女座沙加_16"] = _t"哼 看来是对你太仁慈了"
_M["ANIMATION_1004_凤凰_处女座沙加_17"] = _t"那么 接下来是 "
_M["ANIMATION_1004_凤凰_处女座沙加_18"] = _t"嗅觉 "
_M["ANIMATION_1004_凤凰_处女座沙加_19"] = _t"灭 "
_M["ANIMATION_1004_凤凰_处女座沙加_20"] = _t"味觉"
_M["ANIMATION_1004_凤凰_处女座沙加_21"] = _t"灭 "
_M["ANIMATION_1004_凤凰_处女座沙加_22"] = _t"视觉"
_M["ANIMATION_1004_凤凰_处女座沙加_23"] = _t"灭 "
_M["ANIMATION_1004_凤凰_处女座沙加_24"] = _t"在你五感全部消失前你还有什么遗言吗"
_M["ANIMATION_1004_凤凰_player_7"] = _t"我 绝对 啊"
_M["ANIMATION_1004_凤凰_处女座沙加_25"] = _t"哼"
_M["ANIMATION_1004_凤凰_处女座沙加_26"] = _t"那就让绝望成为你在这世间最后的回响吧"
_M["ANIMATION_1004_凤凰_处女座沙加_27"] = _t"天空霸邪"
_M["ANIMATION_1004_凤凰_处女座沙加_28"] = _t"魑魅魍魉"
_M["ANIMATION_1004_凤凰_处女座沙加_29"] = _t"散"
_M["ANIMATION_1004_凤凰_处女座沙加_30"] = _t"天舞宝轮"
_M["ANIMATION_1004_凤凰_处女座沙加_31"] = _t"就在这来自地狱的业火中烧成灰烬吧。"
_M["ANIMATION_1004_凤凰_处女座沙加_32"] = _t"什么 这感觉是"
_M["ANIMATION_1004_凤凰_处女座沙加_33"] = _t"这强大的小宇宙到底是"
_M["ANIMATION_1004_凤凰_player_8"] = _t"不管被打倒多少次，只要我的小宇宙还在燃烧，凤凰的火焰就不会熄灭！"

--新手村--黄金幻象战斗_仙女
_M["ANIMATION_1004_仙女_阿布罗狄_1"] = _t"哼"
_M["ANIMATION_1004_仙女_阿布罗狄_2"] = _t"泛着血腥味的花香真是迷人啊"
_M["ANIMATION_1004_仙女_player_1"] = _t"冷 好冷 我已经死了吗"
_M["ANIMATION_1004_仙女_player_2"] = _t"这 是哪里"
_M["ANIMATION_1004_仙女_阿布罗狄_3"] = _t"这里将是灵魂的泯灭之地"
_M["ANIMATION_1004_仙女_player_3"] = _t"灵魂泯灭 那就来吧"
_M["ANIMATION_1004_仙女_仙王座_1"] = _t"放肆"
_M["ANIMATION_1004_仙女_仙王座_2"] = _t"你真令我感到耻辱"
_M["ANIMATION_1004_仙女_仙王座_3"] = _t"辜负我的教诲 顶撞黄金圣斗士"
_M["ANIMATION_1004_仙女_player_4"] = _t"师父 不是这样的 他们隐瞒了真相"
_M["ANIMATION_1004_仙女_player_5"] = _t"师父"
_M["ANIMATION_1004_仙女_教皇_1"] = _t"背叛圣域 必将受到我的审判 罪人"
_M["ANIMATION_1004_仙女_player_6"] = _t"不 我没有"
_M["ANIMATION_1004_仙女_雅典娜_1"] = _t"真是没用啊"
_M["ANIMATION_1004_仙女_雅典娜_2"] = _t"身为圣斗士 竟然连保护女神的能力都没有"
_M["ANIMATION_1004_仙女_雅典娜_3"] = _t"真是太没用了"
_M["ANIMATION_1004_仙女_player_7"] = _t"啊"
_M["ANIMATION_1004_仙女_阿布罗狄_4"] = _t"哼 真是无聊"
_M["ANIMATION_1004_仙女_阿布罗狄_5"] = _t"嗯"
_M["ANIMATION_1004_仙女_阿布罗狄_6"] = _t"怎么可能"
_M["ANIMATION_1004_仙女_player_8"] = _t"你太大意了"
_M["ANIMATION_1004_仙女_player_9"] = _t"在我最迷惘的时候"
_M["ANIMATION_1004_仙女_player_10"] = _t"我感觉到圣衣燃烧的斗志"
_M["ANIMATION_1004_仙女_player_11"] = _t"是圣衣 唤醒了我的斗志"
_M["ANIMATION_1004_仙女_阿布罗狄_7"] = _t"死到临头了 还嘴硬"
_M["ANIMATION_1004_仙女_player_12"] = _t"这些花瓣 是什么时候"
_M["ANIMATION_1004_仙女_阿布罗狄_8"] = _t"开始变得有趣了呢"
_M["ANIMATION_1004_仙女_player_13"] = _t"老师 不是这样的 他们隐瞒了真相"
_M["ANIMATION_1004_仙女_player_14"] = _t"老师"

--新手村--黄金幻象战斗_白鸟
_M["ANIMATION_1004_白鸟_卡妙_1"] = _t"你的攻击对我根本不起作用"
_M["ANIMATION_1004_白鸟_卡妙_2"] = _t"因为你的所有战斗技巧"
_M["ANIMATION_1004_白鸟_卡妙_3"] = _t"都是我教的"
_M["ANIMATION_1004_白鸟_player_1"] = _t"别自欺欺人了 你只是个幻象"
_M["ANIMATION_1004_白鸟_卡妙_4"] = _t"哼 竟然被看出来了"
_M["ANIMATION_1004_白鸟_player_2"] = _t"废话少说"
_M["ANIMATION_1004_白鸟_卡妙_5"] = _t"真是固执 看来有必要让你见识一下什么是真正的冻气了"
_M["ANIMATION_1004_白鸟_卡妙_6"] = _t"不愧是卡妙教导出的学员 竟然看破了我的假身"
_M["ANIMATION_1004_白鸟_卡妙_7"] = _t"不过很遗憾"
_M["ANIMATION_1004_白鸟_卡妙_8"] = _t"你就永远待在这吧"
_M["ANIMATION_1004_白鸟_player_3"] = _t"这是"
_M["ANIMATION_1004_白鸟_player_4"] = _t"想起来了"
_M["ANIMATION_1004_白鸟_player_5"] = _t"我刚陷入冰棺之中"
_M["ANIMATION_1004_白鸟_player_6"] = _t"可恶 怎么办"
_M["ANIMATION_1004_白鸟_卡妙_9"] = _t"到这为止了吗 你真让我感到耻辱"
_M["ANIMATION_1004_白鸟_卡妙_10"] = _t"看来我的教诲你都忘干净了"
_M["ANIMATION_1004_白鸟_player_7"] = _t"老师"
_M["ANIMATION_1004_白鸟_卡妙_11"] = _t"就这样就打算放弃了吗"
_M["ANIMATION_1004_白鸟_player_8"] = _t"不 我没有"
_M["ANIMATION_1004_白鸟_卡妙_12"] = _t"那还愣着干什么 唤醒你的小宇宙 击碎这个冰棺"
_M["ANIMATION_1004_白鸟_player_9"] = _t"击碎 可是 我的力量"
_M["ANIMATION_1004_白鸟_卡妙_13"] = _t"如果你还当自己是我卡妙的徒弟 就证明给我看"
_M["ANIMATION_1004_白鸟_player_10"] = _t"我会的"
_M["ANIMATION_1004_白鸟_player_11"] = _t"雅典娜啊"
_M["ANIMATION_1004_白鸟_player_12"] = _t"请赐予我力量"
_M["ANIMATION_1004_白鸟_player_13"] = _t"哪怕只有一瞬间"
_M["ANIMATION_1004_白鸟_卡妙_14"] = _t"嗯"
_M["ANIMATION_1004_白鸟_卡妙_15"] = _t"怎么可能"
_M["ANIMATION_1004_白鸟_player_14"] = _t"我回来了"
_M["ANIMATION_1004_白鸟_卡妙_16"] = _t"赠与你冰棺还不领情 竟然回来送死"
_M["ANIMATION_1004_白鸟_卡妙_17"] = _t"怎 怎么会"
_M["ANIMATION_1004_白鸟_卡妙_18"] = _t"冻气竟然难分高下"
_M["ANIMATION_1004_白鸟_卡妙_19"] = _t"不对 他的冻气的威力在减弱"
_M["ANIMATION_1004_白鸟_卡妙_20"] = _t"不对 她的冻气的威力在减弱"
_M["ANIMATION_1004_白鸟_卡妙_21"] = _t"事到如今这也是你的宿命"
_M["ANIMATION_1004_白鸟_卡妙_22"] = _t"去死吧"
_M["ANIMATION_1004_白鸟_卡妙_23"] = _t"什么"
_M["ANIMATION_1004_白鸟_卡妙_24"] = _t"哼"
_M["ANIMATION_1004_白鸟_卡妙_25"] = _t"看来我需要认真一点了"
_M["ANIMATION_1004_白鸟_player_15"] = _t"师父"

--新手村--黄金幻象战斗_双子
_M["ANIMATION_1004_双子_双子座撒加_1"] = _t"还没完呢"
_M["ANIMATION_1004_双子_双子座撒加_2"] = _t"不错 不错"
_M["ANIMATION_1004_双子_双子座撒加_3"] = _t"看来你并不是一无是处嘛"
_M["ANIMATION_1004_双子_双子座撒加_4"] = _t"只可惜"
_M["ANIMATION_1004_双子_双子座撒加_5"]= _t"你和黄金圣斗士的实力还差的远呢"
_M["ANIMATION_1004_双子_双子座撒加_6"]= _t"感受这股强大的力量吧"
_M["ANIMATION_1004_双子_player_1"]= _t"什么"
_M["ANIMATION_1004_双子_正义双子座_1"]= _t"年轻的圣斗士 前进的道路上满是荆棘"
_M["ANIMATION_1004_双子_正义双子座_2"]= _t"你能承受的了吗"
_M["ANIMATION_1004_双子_邪恶双子座_1"]= _t"力量可以征服一切"
_M["ANIMATION_1004_双子_邪恶双子座_2"]= _t"哪怕遁入邪恶也要拥有无尽的力量"
_M["ANIMATION_1004_双子_邪恶双子座_3"]= _t"你经得住诱惑吗"
_M["ANIMATION_1004_双子_双子座撒加_7"] = _t"这家伙还有点实力"
_M["ANIMATION_1004_双子_双子座撒加_8"] = _t"屈服我之后一定有用"
_M["ANIMATION_1004_双子_双子座撒加_9"]= _t"后会有期"
_M["ANIMATION_1004_双子_双子座撒加_10"]= _t"等等 这感觉是"
_M["ANIMATION_1004_双子_player_2"]= _t"我是不会受你的控制的"
_M["ANIMATION_1004_双子_双子座撒加_11"]= _t"难道说"
_M["ANIMATION_1004_双子_player_3"]= _t"没错"
_M["ANIMATION_1004_双子_player_4"]= _t"你还没发现吗 你愚蠢的蛊惑对我"
_M["ANIMATION_1004_双子_player_5"]= _t"毫无作用"
_M["ANIMATION_1004_双子_player_6"]= _t"我的心中早已有了自己的目标"
_M["ANIMATION_1004_双子_player_7"]= _t"圣衣赋予了我新的使命"
_M["ANIMATION_1004_双子_player_8"]= _t"觉悟吧"
_M["ANIMATION_1004_双子_双子座撒加_12"]= _t"这么说"
_M["ANIMATION_1004_双子_双子座撒加_13"]= _t"就没有利用你的必要了"
_M["ANIMATION_1004_双子_双子座撒加_14"]= _t"去死吧"


--新手村--竞技场夺圣衣
_M["ANIMATION_1001_艾德_1"] = _t"爆发小宇宙后果然厉害不少"
_M["ANIMATION_1001_艾德_2"] = _t"不过 我的实力还是在你之上"
_M["ANIMATION_1001_player_1"] = _t"好 好强"
_M["ANIMATION_1001_player_2"] = _t"就算你被称为天才，我也不会败给你"
_M["ANIMATION_1001_艾德_3"] = _t"怎么可能"
_M["ANIMATION_1001_艾德_4"] = _t"啊 又是这个感觉"
_M["ANIMATION_1001_player_3"] = _t"艾德 是我赢了"
_M["ANIMATION_1001_艾德_5"] = _t"偏偏在这个时候 我怎么可能会输"
_M["ANIMATION_1001_player_4"] = _t"恩 这个小宇宙"
_M["ANIMATION_1001_player_5"] = _t"变的好陌生"
_M["ANIMATION_1001_player_6"] = _t"艾德"
_M["ANIMATION_1001_player_7"] = _t"好快"
_M["ANIMATION_1001_player_8"] = _t"艾德的小宇宙消失了"
_M["ANIMATION_1001_player_9"] = _t"怎么会这样"
_M["ANIMATION_1001_player_10"] = _t"艾德 你醒醒"
_M["ANIMATION_1001_魔铃_1"] = _t"&name& 这股小宇宙非常危险 快制止他"
_M["ANIMATION_1001_player_11"] = _t"艾德"

--新手村--讲解圣衣_白鸟
_M["ANIMATION_1006_白鸟_魔铃_1"] = _t"听着"
_M["ANIMATION_1006_白鸟_魔铃_2"] = _t"宇宙"
_M["ANIMATION_1006_白鸟_魔铃_3"] = _t"是在150亿年前一次大爆炸中诞生的"
_M["ANIMATION_1006_白鸟_魔铃_4"] = _t"换句话说"
_M["ANIMATION_1006_白鸟_魔铃_5"] = _t"你我的肉体也是由于爆炸诞生的小宇宙之一"
_M["ANIMATION_1006_白鸟_魔铃_6"] = _t"真正的圣斗士是靠爆发自己的小宇宙获得超人的力量"
_M["ANIMATION_1006_白鸟_魔铃_7"] = _t"那力量可以粉碎星空 亦可以撕裂大地"
_M["ANIMATION_1006_白鸟_魔铃_8"] = _t"散发着耀眼的光芒"
_M["ANIMATION_1006_白鸟_魔铃_9"] = _t"除了小宇宙"
_M["ANIMATION_1006_白鸟_魔铃_10"] = _t"每个圣斗士都拥有自己的守护星座及圣衣"
_M["ANIMATION_1006_白鸟_魔铃_11"] = _t"而以白鸟座为蓝图制作的铠甲"
_M["ANIMATION_1006_白鸟_魔铃_12"] = _t"就是白鸟圣衣"
_M["ANIMATION_1006_白鸟_魔铃_13"] = _t"你要记住"
_M["ANIMATION_1006_白鸟_魔铃_14"] = _t"白鸟座圣衣蕴含极寒的能量 穿上它 你将拥有最强的冻气"

--新手村--讲解圣衣_凤凰
_M["ANIMATION_1006_凤凰_魔铃_1"] = _t"听着"
_M["ANIMATION_1006_凤凰_魔铃_2"] = _t"宇宙"
_M["ANIMATION_1006_凤凰_魔铃_3"] = _t"是在150亿年前一次大爆炸中诞生的"
_M["ANIMATION_1006_凤凰_魔铃_4"] = _t"换句话说"
_M["ANIMATION_1006_凤凰_魔铃_5"] = _t"你我的肉体也是由于爆炸诞生的小宇宙之一"
_M["ANIMATION_1006_凤凰_魔铃_6"] = _t"真正的圣斗士是靠爆发自己的小宇宙获得超人的力量"
_M["ANIMATION_1006_凤凰_魔铃_7"] = _t"那力量可以粉碎星空 亦可以撕裂大地"
_M["ANIMATION_1006_凤凰_魔铃_8"] = _t"散发着耀眼的光芒"
_M["ANIMATION_1006_凤凰_魔铃_9"] = _t"除了小宇宙"
_M["ANIMATION_1006_凤凰_魔铃_10"] = _t"每个圣斗士都拥有自己的守护星座及圣衣"
_M["ANIMATION_1006_凤凰_魔铃_11"] = _t"而以凤凰座为蓝图制作的铠甲"
_M["ANIMATION_1006_凤凰_魔铃_12"] = _t"就是凤凰圣衣"
_M["ANIMATION_1006_凤凰_魔铃_13"] = _t"你要记住"
_M["ANIMATION_1006_凤凰_魔铃_14"] = _t"凤凰座圣衣具有强大的自我修复能力 穿上它 你将拥有最强的不死之力"

--新手村--讲解圣衣_天龙
_M["ANIMATION_1006_天龙_魔铃_1"] = _t"听着"
_M["ANIMATION_1006_天龙_魔铃_2"] = _t"宇宙"
_M["ANIMATION_1006_天龙_魔铃_3"] = _t"是在150亿年前一次大爆炸中诞生的"
_M["ANIMATION_1006_天龙_魔铃_4"] = _t"换句话说"
_M["ANIMATION_1006_天龙_魔铃_5"] = _t"你我的肉体也是由于爆炸诞生的小宇宙之一"
_M["ANIMATION_1006_天龙_魔铃_6"] = _t"真正的圣斗士是靠爆发自己的小宇宙获得超人的力量"
_M["ANIMATION_1006_天龙_魔铃_7"] = _t"那力量可以粉碎星空 亦可以撕裂大地"
_M["ANIMATION_1006_天龙_魔铃_8"] = _t"散发着耀眼的光芒"
_M["ANIMATION_1006_天龙_魔铃_9"] = _t"除了小宇宙"
_M["ANIMATION_1006_天龙_魔铃_10"] = _t"每个圣斗士都拥有自己的守护星座及圣衣"
_M["ANIMATION_1006_天龙_魔铃_11"] = _t"而以天龙座为蓝图制作的铠甲"
_M["ANIMATION_1006_天龙_魔铃_12"] = _t"就是天龙圣衣"
_M["ANIMATION_1006_天龙_魔铃_13"] = _t"你要记住"
_M["ANIMATION_1006_天龙_魔铃_14"] = _t"天龙座圣衣是最具灵气的圣衣 穿上它 你将拥有最强的拳和盾"

--新手村--讲解圣衣_天马
_M["ANIMATION_1006_天马_魔铃_1"] = _t"听着"
_M["ANIMATION_1006_天马_魔铃_2"] = _t"宇宙"
_M["ANIMATION_1006_天马_魔铃_3"] = _t"是在150亿年前一次大爆炸中诞生的"
_M["ANIMATION_1006_天马_魔铃_4"] = _t"换句话说"
_M["ANIMATION_1006_天马_魔铃_5"] = _t"你我的肉体也是由于爆炸诞生的小宇宙之一"
_M["ANIMATION_1006_天马_魔铃_6"] = _t"真正的圣斗士是靠爆发自己的小宇宙获得超人的力量"
_M["ANIMATION_1006_天马_魔铃_7"] = _t"那力量可以粉碎星空 亦可以撕裂大地"
_M["ANIMATION_1006_天马_魔铃_8"] = _t"散发着耀眼的光芒"
_M["ANIMATION_1006_天马_魔铃_9"] = _t"除了小宇宙"
_M["ANIMATION_1006_天马_魔铃_10"] = _t"每个圣斗士都拥有自己的守护星座及圣衣"
_M["ANIMATION_1006_天马_魔铃_11"] = _t"而以天马座为蓝图制作的铠甲"
_M["ANIMATION_1006_天马_魔铃_12"] = _t"就是天马圣衣"
_M["ANIMATION_1006_天马_魔铃_13"] = _t"你要记住"
_M["ANIMATION_1006_天马_魔铃_14"] = _t"天马座圣衣拥有最强的速度 穿上它 你将拥有最快的拳"

--新手村--讲解圣衣_仙女
_M["ANIMATION_1006_仙女_魔铃_1"] = _t"听着"
_M["ANIMATION_1006_仙女_魔铃_2"] = _t"宇宙"
_M["ANIMATION_1006_仙女_魔铃_3"] = _t"是在150亿年前一次大爆炸中诞生的"
_M["ANIMATION_1006_仙女_魔铃_4"] = _t"换句话说"
_M["ANIMATION_1006_仙女_魔铃_5"] = _t"你我的肉体也是由于爆炸诞生的小宇宙之一"
_M["ANIMATION_1006_仙女_魔铃_6"] = _t"真正的圣斗士是靠爆发自己的小宇宙获得超人的力量"
_M["ANIMATION_1006_仙女_魔铃_7"] = _t"那力量可以粉碎星空 亦可以撕裂大地"
_M["ANIMATION_1006_仙女_魔铃_8"] = _t"散发着耀眼的光芒"
_M["ANIMATION_1006_仙女_魔铃_9"] = _t"除了小宇宙"
_M["ANIMATION_1006_仙女_魔铃_10"] = _t"每个圣斗士都拥有自己的守护星座及圣衣"
_M["ANIMATION_1006_仙女_魔铃_11"] = _t"而以仙女座为蓝图制作的铠甲"
_M["ANIMATION_1006_仙女_魔铃_12"] = _t"就是仙女圣衣"
_M["ANIMATION_1006_仙女_魔铃_13"] = _t"你要记住"
_M["ANIMATION_1006_仙女_魔铃_14"] = _t"仙女座圣衣是少数拥有武器的圣衣 穿上它 你将拥有最强的防御和攻击"




----------------------圣域-------------------------
--圣域--十二宫点燃火时钟
_M["ANIMATION_1111_字幕_1"] = _t"十二宫的火时钟全部点燃了 这是圣域准备迎击入侵者的信号"

--圣域--十二宫时钟熄灭
_M["ANIMATION_1112_沙加_1"] = _t"擅闯圣域 真是有趣"

--圣域--钟楼火熄灭_白羊
_M["ANIMATION_1113_字幕_1"] = _t"白羊宫的火焰熄灭了 时间已经过去了一个小时"

--圣域--钟楼火熄灭_金牛
_M["ANIMATION_1114_字幕_1"] = _t"金牛宫的火焰熄灭了 时间已经过去了二个小时"

--圣域--钟楼火熄灭_双子
_M["ANIMATION_1115_字幕_1"] = _t"双子宫的火焰熄灭了 时间已经过去了三个小时"

--圣域--钟楼火熄灭_巨蟹
_M["ANIMATION_1116_字幕_1"] = _t"巨蟹宫的火焰熄灭了 时间已经过去了四个小时"

--圣域--钟楼火熄灭_狮子
_M["ANIMATION_1117_字幕_1"] = _t"狮子宫的火焰熄灭了 时间已经过去了五个小时"

--圣域--钟楼火熄灭_处女
_M["ANIMATION_1118_字幕_1"] = _t"处女宫的火焰熄灭了 时间已经过去了六个小时"

--圣域--钟楼火熄灭_天秤
_M["ANIMATION_1119_字幕_1"] = _t"天秤宫的火焰熄灭了 时间已经过去了七个小时"

--圣域--钟楼火熄灭_天蝎
_M["ANIMATION_1120_字幕_1"] = _t"天蝎宫的火焰熄灭了 时间已经过去了八个小时"

--圣域--钟楼火熄灭_射手
_M["ANIMATION_1121_字幕_1"] = _t"射手宫的火焰熄灭了 时间已经过去了九个小时"

--圣域--钟楼火熄灭_摩羯
_M["ANIMATION_1122_字幕_1"] = _t"摩羯宫的火焰熄灭了 时间已经过去了十个小时"

--圣域--钟楼火熄灭_水瓶
_M["ANIMATION_1123_字幕_1"] = _t"水瓶宫的火焰熄灭了 时间已经过去了十一个小时"

--圣域--钟楼火熄灭_双鱼
_M["ANIMATION_1124_字幕_1"] = _t"双鱼宫的火焰熄灭了 时间已经过去了十二个小时"

--圣域--屋顶陶罐指引
_M["ANIMATION_1106_字幕_1"] = _t"小提示：加速跑+二段跳可以增强跳跃距离和高度^_^"

--圣域--屋顶珍珠指引
_M["ANIMATION_1108_字幕_1"] = _t"小提示：加速跑+二段跳可以增强跳跃距离和高度^_^"


--圣域--圣衣升阶介绍
_M["ANIMATION_1109_城户纱织_1"] = _t"你现在穿的只是最初的圣衣"
_M["ANIMATION_1109_城户纱织_2"] = _t"星座圣衣共有88套"
_M["ANIMATION_1109_城户纱织_3"] = _t"你可以通过努力，集齐它们"
_M["ANIMATION_1109_城户纱织_4"] = _t"随着你小宇宙的提升 圣衣能够进阶到新的状态"
_M["ANIMATION_1109_城户纱织_5"] = _t"只要努力，甚至能升级为黄金圣衣"
_M["ANIMATION_1109_player_1"] = _t"黄金圣衣"
_M["ANIMATION_1109_player_2"] = _t"我会努力提升小宇宙，成为最强的圣斗士"

--圣域--获得普罗米修斯之锤
_M["ANIMATION_1110_player_1"] = _t"浑身充满了力量"
_M["ANIMATION_1110_player_2"] = _t"不能再耽误时间了"

--圣域--初代天马对死神化身
_M["ANIMATION_1102_死神_1"] = _t"真是辛苦你们了 哈哈哈哈 "
_M["ANIMATION_1102_初代天马_1"] = _t"谁"
_M["ANIMATION_1102_死神_2"] = _t"冥王神血我就先收下了"
_M["ANIMATION_1102_死神_3"] = _t"而你们 都给我下地狱去吧"
_M["ANIMATION_1102_初代天马_2"] = _t"还不快走"
_M["ANIMATION_1102_player_1"] = _t"罗德里奥 可是你"
_M["ANIMATION_1102_初代天马_3"] = _t"快走 我来拖住他"
_M["ANIMATION_1102_死神_4"] = _t"想跑"
_M["ANIMATION_1102_死神_5"] = _t"哼 自不量力"
_M["ANIMATION_1102_死神_6"] = _t"还剩一个"
_M["ANIMATION_1102_初代天马_4"] = _t"住手"
_M["ANIMATION_1102_初代天马_5"] = _t"你的对手 是我"
_M["ANIMATION_1102_死神_7"] = _t"哼 你这副虚无的身躯还能做什么"
_M["ANIMATION_1102_初代天马_6"] = _t"只要我的灵魂之火还在燃烧"
_M["ANIMATION_1102_初代天马_7"] = _t"我便要拦下你"
_M["ANIMATION_1102_死神_8"] = _t"拦下我"
_M["ANIMATION_1102_死神_9"] = _t"哈哈哈哈"
_M["ANIMATION_1102_死神_10"] = _t"那你拦一次试试"
_M["ANIMATION_1102_初代天马_8"] = _t"延续百年的恩怨"
_M["ANIMATION_1102_初代天马_9"] = _t"是时候了结了"
_M["ANIMATION_1102_死神_11"] = _t"什么"
_M["ANIMATION_1102_初代天马_10"] = _t"一起化作宇宙的尘埃吧 达拿都斯"
_M["ANIMATION_1102_初代天马_11"] = _t"赌上我 天马座全部的骄傲"
_M["ANIMATION_1102_player_2"] = _t"这个小宇宙 是罗德里奥"
_M["ANIMATION_1102_潘多拉_1"] = _t"哈哈哈哈"
_M["ANIMATION_1102_player_3"] = _t"谁"
_M["ANIMATION_1102_潘多拉_2"] = _t"那个初代天马的灵魂马上就要完蛋了"
_M["ANIMATION_1102_player_4"] = _t"是你 你怎么在这"
_M["ANIMATION_1102_潘多拉_3"] = _t"我只是骗了一群学员和炼金术士进入森林"
_M["ANIMATION_1102_潘多拉_4"] = _t"他就被吓醒了 还把冥王神血的秘密交了出来"
_M["ANIMATION_1102_潘多拉_5"] = _t"不过我要感谢你 当初以为阿历克斯可以取得他的信任"
_M["ANIMATION_1102_潘多拉_6"] = _t"但显然 你更合适"
_M["ANIMATION_1102_player_5"] = _t"卑鄙"
_M["ANIMATION_1102_潘多拉_7"] = _t"随你怎么说 你跑不了的"
_M["ANIMATION_1102_潘多拉_8"] = _t"乖乖把冥王神血交出来"
_M["ANIMATION_1102_player_6"] = _t"我不会交给你的"
_M["ANIMATION_1102_睡神_1"] = _t"你话太多了 潘多拉"
_M["ANIMATION_1102_潘多拉_9"] = _t"修普诺斯大人"
_M["ANIMATION_1102_player_7"] = _t"身体 无法动弹"
_M["ANIMATION_1102_睡神_2"] = _t"拿上神血 我们走"
_M["ANIMATION_1102_潘多拉_10"] = _t"是 大人"
_M["ANIMATION_1102_睡神_3"] = _t"放心 我不喜欢杀人"
_M["ANIMATION_1102_睡神_4"] = _t"永恒的安眠"
_M["ANIMATION_1102_雅典娜_1"] = _t"正义的少年啊 上应星辰的斗士"
_M["ANIMATION_1102_player_8"] = _t"这温暖的小宇宙 难道是 "
_M["ANIMATION_1102_雅典娜_2"] = _t"永远不要向邪恶屈服 醒来吧 我的圣斗士"
_M["ANIMATION_1102_player_9"] = _t"雅典娜"

--圣域--觐见教皇
_M["ANIMATION_1101_教皇_1"] = _t"应星而生的战士 我代表女神为你送上奥林匹斯的祝福"
_M["ANIMATION_1101_教皇_2"] = _t"哼 幻胧"
_M["ANIMATION_1101_教皇_3"] = _t"魔皇拳"
_M["ANIMATION_1101_教皇_4"] = _t"欢迎来到圣域"

--圣域--三黄金大战双子神
_M["ANIMATION_1103_死神_1"] = _t"别急 这就送你下地狱"
_M["ANIMATION_1103_死神_2"] = _t"去死吧"
_M["ANIMATION_1103_死神_3"] = _t"嗯"
_M["ANIMATION_1103_艾欧里亚_1"] = _t"等离子光速拳"
_M["ANIMATION_1103_阿鲁迪巴_1"] = _t"黄金号角"
_M["ANIMATION_1103_艾欧里亚_2"] = _t"成功了"
_M["ANIMATION_1103_死神_4"] = _t"显然没有 看来需要让你们一窥我的力量了"
_M["ANIMATION_1103_沙加_1"] = _t"不好"
_M["ANIMATION_1103_沙加_2"] = _t"开"
_M["ANIMATION_1103_沙加_3"] = _t"不妙 再这样下去的话 啊"
_M["ANIMATION_1103_死神_5"] = _t"嗯"
_M["ANIMATION_1103_睡神_1"] = _t"哼"
_M["ANIMATION_1103_死神_6"] = _t"区区凡人 竟敢伤及我达那都斯"
_M["ANIMATION_1103_死神_7"] = _t"不可饶恕"
_M["ANIMATION_1103_沙加_4"] = _t"开"
_M["ANIMATION_1103_沙加_5"] = _t"邪恶之火 必将熄灭"
_M["ANIMATION_1103_沙加_6"] = _t"保护雅典娜以及一切美好的事物 都是我们黄金圣斗士的使命"
_M["ANIMATION_1103_沙加_7"] = _t"哪怕是丢弃荣誉或性命"
_M["ANIMATION_1103_阿鲁迪巴_2"] = _t"沙加"
_M["ANIMATION_1103_沙加_8"] = _t"不管敌人是多么的强大"
_M["ANIMATION_1103_沙加_9"] = _t"都要不惜一切代价的守护住"
_M["ANIMATION_1103_艾欧里亚_3"] = _t"也只有这样了"
_M["ANIMATION_1103_沙加_10"] = _t"守护住属于这圣域的"
_M["ANIMATION_1103_沙加_11"] = _t"正义"
_M["ANIMATION_1103_沙加_12"] = _t"雅典娜的惊叹"
_M["ANIMATION_1103_死神_8"] = _t"禁招吗"
_M["ANIMATION_1103_沙加_13"] = _t"快去 这里有我们"

--圣域--金牛出场
_M["ANIMATION_1105_阿鲁迪巴_1"] = _t"幻想着像无人镇守的白羊宫一样轻松通过吗"
_M["ANIMATION_1105_阿鲁迪巴_2"] = _t"哼"
_M["ANIMATION_1105_阿鲁迪巴_3"] = _t"踏进金牛宫已是你的殊荣 但很遗憾 你也只能到这了"

--圣域--硬闯12宫
_M["ANIMATION_1107_阿鲁迪巴_1"] = _t"哼"
_M["ANIMATION_1107_阿鲁迪巴_2"] = _t"趁现在逃走还来得及"
_M["ANIMATION_1107_阿鲁迪巴_3"] = _t"自讨苦吃"
_M["ANIMATION_1107_阿鲁迪巴_4"] = _t"什么"
_M["ANIMATION_1107_阿鲁迪巴_5"] = _t"这家伙 竟然能"
_M["ANIMATION_1107_player_1"] = _t"啊"
_M["ANIMATION_1107_阿鲁迪巴_6"] = _t"还算有点本事 但是"
_M["ANIMATION_1107_阿鲁迪巴_7"] = _t"你忽略了一个问题"
_M["ANIMATION_1107_阿鲁迪巴_8"] = _t"你的对手"
_M["ANIMATION_1107_阿鲁迪巴_9"] = _t"是我阿鲁迪巴"
_M["ANIMATION_1107_阿鲁迪巴_10"] = _t"不过"
_M["ANIMATION_1107_阿鲁迪巴_11"] = _t"已经很不错了 哈哈哈哈"

--圣域--冥王神血之谜
_M["ANIMATION_1127_初代天马英灵_1"] = _t"还记那是神话时代的一次圣战"
_M["ANIMATION_1127_初代天马英灵_2"] = _t"灾难瞬间降临"
_M["ANIMATION_1127_初代天马英灵_3"] = _t"冥王哈迪斯入侵了圣域"
_M["ANIMATION_1127_初代天马英灵_4"] = _t"大地与和平的守护者雅典娜"
_M["ANIMATION_1127_初代天马英灵_5"] = _t"向哈迪斯发起了激烈的反击"
_M["ANIMATION_1127_初代天马英灵_6"] = _t"当时的射手座黄金圣斗士以生命为代价"
_M["ANIMATION_1127_初代天马英灵_7"] = _t"从普罗米修斯手中借得了他的武器"
_M["ANIMATION_1127_初代天马英灵_8"] = _t"邪恶再次逼近之时"
_M["ANIMATION_1127_初代天马英灵_9"] = _t"雅典娜借助盗火者之锤的力量"
_M["ANIMATION_1127_初代天马英灵_10"] = _t"与她的守护者们一起打败了哈迪斯的进攻"
_M["ANIMATION_1127_初代天马英灵_11"] = _t"并让哈迪斯流下了一滴神血"
_M["ANIMATION_1127_初代天马英灵_12"] = _t"几万年以来 为恢复力量的哈迪斯一直在寻找神血的下落"

--圣域--十三年前的谣言
_M["ANIMATION_1128_村长_1"] = _t"故事发生在十三年前 让我想想"
_M["ANIMATION_1128_村长_2"] = _t"狮子座艾欧里亚的哥哥"
_M["ANIMATION_1128_村长_3"] = _t"是射手座黄金圣斗士艾欧罗斯"
_M["ANIMATION_1128_村长_4"] = _t"艾欧罗斯曾经是最富有正义感和勇气的圣斗士"
_M["ANIMATION_1128_村长_5"] = _t"但是在十三年前 被黑暗蒙蔽的艾欧罗斯背叛了女神"
_M["ANIMATION_1128_村长_6"] = _t"艾欧罗斯企图杀害女神 被教皇发现"
_M["ANIMATION_1128_村长_7"] = _t"于是他逃离了圣域"
_M["ANIMATION_1128_村长_8"] = _t"教皇派出摩羯座修罗追杀艾欧罗斯 后者死于遗忘之路"
_M["ANIMATION_1128_村长_9"] = _t"十三年来 艾欧里亚一直背负着叛徒的弟弟的罪名"

--圣域--升阶黄金圣衣
_M["ANIMATION_1129_射手座艾欧罗斯_1"] = _t"在长久的战斗中"
_M["ANIMATION_1129_射手座艾欧罗斯_2"] = _t"你的力量得到了升华"
_M["ANIMATION_1129_射手座艾欧罗斯_3"] = _t"现在"
_M["ANIMATION_1129_射手座艾欧罗斯_4"] = _t"是时候承担这份新的力量了"
_M["ANIMATION_1129_player_1"] = _t"这就是黄金圣衣的力量"


----------------------银河竞技场-------------------------

--银河竞技场--纱织爆发小宇宙
_M["ANIMATION_1207_莎尔娜_1"] = _t"什么"
_M["ANIMATION_1207_莎尔娜_2"] = _t"居然有人拥有如此强大的小宇宙"

--银河竞技场--纱织出场
_M["ANIMATION_1204_系统公告_1"] = _t"在全世界的注目中"
_M["ANIMATION_1204_系统公告_2"] = _t"这一天终于来临了"

--银河竞技场--黄金狮子来袭
_M["ANIMATION_1201_狮子座艾欧里亚_1"] = _t"那就只能动手了 给我让开"
_M["ANIMATION_1201_星矢_1"] = _t"休想"
_M["ANIMATION_1201_狮子座艾欧里亚_2"] = _t"看来你还不清楚和黄金圣斗士之间的差距"
_M["ANIMATION_1201_星矢_2"] = _t"怎么会这样 完全看不清他的拳"
_M["ANIMATION_1201_狮子座艾欧里亚_3"] = _t"不要在抵抗了 你不是我的对手"
_M["ANIMATION_1201_星矢_3"] = _t"我是 绝对不会让你带走圣衣的"
_M["ANIMATION_1201_星矢_4"] = _t"好强"
_M["ANIMATION_1201_星矢_5"] = _t"就算拼上性命"
_M["ANIMATION_1201_星矢_6"] = _t"也要阻止你"
_M["ANIMATION_1201_星矢_7"] = _t"天马流星拳！"
_M["ANIMATION_1201_狮子座艾欧里亚_4"] = _t"哼 就这种程度吗"
_M["ANIMATION_1201_狮子座艾欧里亚_5"] = _t"让你见识下真正的速度"
_M["ANIMATION_1201_城户纱织_1"] = _t"啊 星矢"
_M["ANIMATION_1201_狮子座艾欧里亚_6"] = _t"什么"
_M["ANIMATION_1201_狮子座艾欧里亚_7"] = _t"射手圣衣竟然"
_M["ANIMATION_1201_狮子座艾欧里亚_8"] = _t"为什么会这样"
_M["ANIMATION_1201_星矢_8"] = _t"啊 圣衣"
_M["ANIMATION_1201_狮子座艾欧里亚_9"] = _t"那个方向 是圣域"
_M["ANIMATION_1201_城户纱织_2"] = _t"艾欧里亚 你还不明白么"
_M["ANIMATION_1201_狮子座艾欧里亚_10"] = _t"如此强大而温暖的小宇宙"
_M["ANIMATION_1201_狮子座艾欧里亚_11"] = _t"难道她真的是雅典娜"

--银河竞技场--沙织被掳
_M["ANIMATION_1202_星矢_1"] = _t"纱织小姐"
_M["ANIMATION_1202_紫龙_1"] = _t"星矢"

--银河竞技场--十风穴穆救众人
_M["ANIMATION_1203_一辉_1"] = _t"星矢 你赢了"
_M["ANIMATION_1203_一辉_2"] = _t"圣衣归你"
_M["ANIMATION_1203_一辉_3"] = _t"山体就要崩塌了你们 快走吧"
_M["ANIMATION_1203_一辉_4"] = _t"你们 快走吧"
_M["ANIMATION_1203_星矢_1"] = _t"和我们一起走"
_M["ANIMATION_1203_一辉_5"] = _t"不 这或许 就是我的命运吧"
_M["ANIMATION_1203_瞬_1"] = _t"哥哥"
_M["ANIMATION_1203_一辉_6"] = _t"再见了 我的弟弟"
_M["ANIMATION_1203_瞬_2"] = _t"哥哥"
_M["ANIMATION_1203_穆_1"] = _t"这里危险 我带你们离开"

--银河竞技场--青木原树海_出
_M["ANIMATION_1206_字幕_1"] = _t"终于 我走出了这片遍布梦魇的森林"

--银河竞技场--冥王回忆
_M["ANIMATION_1208_冥王哈迪斯_1"] = _t"都结束了 雅典娜"
_M["ANIMATION_1208_player_1"] = _t"这...似乎是很久以前的事情..."
_M["ANIMATION_1208_player_2"] = _t"是梦吗...?"

--银河竞技场--星矢穿圣衣
_M["ANIMATION_1209_星矢_1"] = _t"这是紫龙用鲜血换来的新圣衣"
_M["ANIMATION_1209_星矢_2"] = _t"我一定会穿着它取得胜利"

--银河竞技场--仰望十风穴
_M["ANIMATION_1280_黑暗天马_1"] = _t"他们快要到了"

--银河竞技场--沙织身世之谜
_M["ANIMATION_1286_雅典娜_1"] = _t"那是十三年前 "
_M["ANIMATION_1286_雅典娜_2"] = _t"我的爷爷城户光证在希腊旅行时 发现了一名身负重伤的战士"
_M["ANIMATION_1286_雅典娜_3"] = _t"他就是射手座黄金圣斗士艾欧罗斯"
_M["ANIMATION_1286_雅典娜_4"] = _t"艾欧罗斯告诉爷爷"
_M["ANIMATION_1286_雅典娜_5"] = _t"怀中的女婴是雅典娜女神的转世 邪恶的力量想杀害这名女婴"
_M["ANIMATION_1286_雅典娜_6"] = _t"艾欧罗斯临死前 将雅典娜和射手座圣衣托付给爷爷"
_M["ANIMATION_1286_雅典娜_7"] = _t"请一定保护她 她是这个世上唯一的希望 他这样说着"
_M["ANIMATION_1286_雅典娜_8"] = _t"而当时的那名女婴"
_M["ANIMATION_1286_雅典娜_9"] = _t"正是我"

----------------------庐山-------------------------
--庐山--黄泉比良之战
_M["ANIMATION_1304_player_1"] = _t"紫龙 我掩护你"
_M["ANIMATION_1304_紫龙_1"] = _t"好"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_1"] = _t"可笑"
_M["ANIMATION_1304_player_2"] = _t"接招吧 迪斯马斯克"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_2"] = _t"只有这点力量么"
_M["ANIMATION_1304_player_3"] = _t"紫龙 趁现在"
_M["ANIMATION_1304_紫龙_2"] = _t"庐山龙飞翔"
_M["ANIMATION_1304_player_4"] = _t"干得好 紫龙"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_3"] = _t" 区区青铜圣斗士"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_4"] = _t"去死吧"
_M["ANIMATION_1304_player_5"] = _t"不好 紫龙"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_5"] = _t"谁！嗯？"
_M["ANIMATION_1304_童虎_1"] = _t"迪斯马斯克"
_M["ANIMATION_1304_紫龙_3"] = _t" 嗯？老师"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_6"] = _t"是你"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_7"] = _t"你们的脑袋暂且留着"
_M["ANIMATION_1304_巨蟹座迪斯马斯克_8"] = _t"我会在圣域等着你们"


--庐山--紫龙VS雷虎
_M["ANIMATION_1303_雷虎_1"] = _t"一决胜负吧 紫龙"
_M["ANIMATION_1303_紫龙_1"] = _t"来吧 师兄"
_M["ANIMATION_1303_紫龙_2"] = _t"庐山 升龙霸"
_M["ANIMATION_1303_紫龙_3"] = _t"师兄 你到底怎么了 快清醒过来吧"
_M["ANIMATION_1303_紫龙_4"] = _t"这里 是我们修炼的地方"
_M["ANIMATION_1303_雷虎_2"] = _t"我们要变的更强 紫龙"
_M["ANIMATION_1303_紫龙_5"] = _t"嗯"
_M["ANIMATION_1303_雷虎_3"] = _t"紫龙 再坚持一会儿"
_M["ANIMATION_1303_紫龙_6"] = _t"嗯"
_M["ANIMATION_1303_紫龙_7"] = _t"师兄你怎么变成这样"
_M["ANIMATION_1303_紫龙_8"] = _t"难道 你忘了庐山 忘了老师了么"
_M["ANIMATION_1303_紫龙_9"] = _t"给我清醒过来吧"
_M["ANIMATION_1303_雷虎_4"] = _t"老 老师"
_M["ANIMATION_1303_巨蟹座迪斯马斯克_1"] = _t"哈哈哈哈"
_M["ANIMATION_1303_巨蟹座迪斯马斯克_2"] = _t"蠢货 想要脱离我的控制 只有"
_M["ANIMATION_1303_巨蟹座迪斯马斯克_3"] = _t"死"
_M["ANIMATION_1303_雷虎_5"] = _t"受死吧 紫龙！"
_M["ANIMATION_1303_紫龙_10"] = _t"对不起了 师兄"
_M["ANIMATION_1303_紫龙_11"] = _t"庐山 升龙霸"
_M["ANIMATION_1303_雷虎_6"] = _t"紫龙 我输了 你终于变强了…"
_M["ANIMATION_1303_紫龙_12"] = _t"师兄"

--庐山--雷虎救紫龙
_M["ANIMATION_1302_迪斯马斯克_1"] = _t"接下来就送你们下地狱吧"
_M["ANIMATION_1302_迪斯马斯克_2"] = _t"哼哼哼哼 "
_M["ANIMATION_1302_迪斯马斯克_3"] = _t"嗯"
_M["ANIMATION_1302_雷虎_1"] = _t"啊"
_M["ANIMATION_1302_雷虎_2"] = _t"嗯"
_M["ANIMATION_1302_雷虎_3"] = _t"这里交给我 你俩别在这碍手碍脚"
_M["ANIMATION_1302_雷虎_4"] = _t"快走"
_M["ANIMATION_1302_迪斯马斯克_4"] = _t"竟然大意了 又混进来只"
_M["ANIMATION_1302_迪斯马斯克_5"] = _t"老鼠吗"
_M["ANIMATION_1302_迪斯马斯克_6"] = _t"那么"
_M["ANIMATION_1302_迪斯马斯克_7"] = _t"你们就都给我一起"
_M["ANIMATION_1302_迪斯马斯克_8"] = _t"去死吧"
_M["ANIMATION_1302_雷虎_5"] = _t"糟糕"
_M["ANIMATION_1302_雷虎_6"] = _t"啊"
_M["ANIMATION_1302_迪斯马斯克_9"] = _t"自不量力"
_M["ANIMATION_1302_雷虎_7"] = _t"啊"
_M["ANIMATION_1302_紫龙_1"] = _t"雷虎"
_M["ANIMATION_1302_迪斯马斯克_10"] = _t"不堪一击"
_M["ANIMATION_1302_迪斯马斯克_11"] = _t"嗯"
_M["ANIMATION_1302_迪斯马斯克_12"] = _t"可恶"
_M["ANIMATION_1302_雷虎_8"] = _t"快走"
_M["ANIMATION_1302_迪斯马斯克_13"] = _t"谁也别想走"
_M["ANIMATION_1302_雷虎_9"] = _t"紫龙 在没有打倒你前 我不会轻易死掉的"
_M["ANIMATION_1302_雷虎_10"] = _t"你们快走"
_M["ANIMATION_1302_雷虎_11"] = _t"啊"
_M["ANIMATION_1302_紫龙_2"] = _t"雷虎"

--庐山--紫龙救春丽
_M["ANIMATION_1301_春丽_1"] = _t"啊"
_M["ANIMATION_1301_紫龙_1"] = _t"春丽"
_M["ANIMATION_1301_紫龙_2"] = _t"看来只有将瀑布之水逆流来托起春丽 才能争取时间"
_M["ANIMATION_1301_紫龙_3"] = _t"春丽 我一定可以做到"
_M["ANIMATION_1301_紫龙_4"] = _t"燃烧吧 我的小宇宙"
_M["ANIMATION_1301_紫龙_5"] = _t"庐山 升龙霸"
_M["ANIMATION_1301_雷虎_1"] = _t"他竟然领悟了"

--庐山--龙珠之神龙出现
_M["ANIMATION_1305_神龙_1"] = _t"说出你的愿望 我会帮你实现"
_M["ANIMATION_1305_小悟空_1"] = _t"恩 恩"
_M["ANIMATION_1305_神龙_2"] = _t"我知道了 实现你们的愿望"
_M["ANIMATION_1305_小悟空_2"] = _t"神龙"

----------------------遗忘之路-------------------------
--遗忘之路--教皇内战
_M["ANIMATION_1401_player_1"] = _t"都结束了吗"
_M["ANIMATION_1401_希尔汗_1"] = _t"这股小宇宙"
_M["ANIMATION_1401_希尔汗_2"] = _t"难道是"
_M["ANIMATION_1401_希尔汗_3"] = _t"不好"
_M["ANIMATION_1401_教皇_1"] = _t"一切知晓真相的人必须死"
_M["ANIMATION_1401_教皇_2"] = _t"银河星爆"
_M["ANIMATION_1401_希尔汗_4"] = _t"快...跑..."
_M["ANIMATION_1401_player_2"] = _t"希尔汗"
_M["ANIMATION_1401_教皇_3"] = _t"这次看还有谁会来救你"
_M["ANIMATION_1401_教皇_4"] = _t"不 不要捣乱 我失去他的小宇宙了"
_M["ANIMATION_1401_艾欧罗斯_1"] = _t"要保护女神 圣斗士"

--遗忘之路--召唤命运女神
_M["ANIMATION_1402_祭祀_1"] = _t"命运变幻无常 若月之圆缺"
_M["ANIMATION_1402_祭祀_2"] = _t"人生经历坎坷起落 悲喜分合"
_M["ANIMATION_1402_祭祀_3"] = _t"亦终将归于安眠 如冰消雪解"
_M["ANIMATION_1402_祭祀_4"] = _t"命运之轮恒久转动 永不停歇"
_M["ANIMATION_1402_祭祀_5"] = _t"幸福转眼如云烟 只余煎熬折磨"
_M["ANIMATION_1402_祭祀_6"] = _t"乖戾的女神 你让人恐惧和憎恶"
_M["ANIMATION_1402_祭祀_7"] = _t"亦让人心生战栗崇拜 敬畏交灼"
_M["ANIMATION_1402_祭祀_8"] = _t"此刻我拨动琴弦邀请神喻"
_M["ANIMATION_1402_祭祀_9"] = _t"请让我聆听命运 无论悲亡或是存活"

--遗忘之路--放逐者之王出场
_M["ANIMATION_1403_杂兵_1"] = _t"这家伙打倒了海鸣之影 绝对不可以饶恕"
_M["ANIMATION_1403_放逐者之王_1"] = _t"等一等"
_M["ANIMATION_1403_放逐者之王_2"] = _t"我还有话要问他"


--遗忘之路--牢狱注水
_M["ANIMATION_1404_加隆_1"] = _t"救我出去"
_M["ANIMATION_1404_加隆_2"] = _t"我可以让你做主宰世界的王"
_M["ANIMATION_1404_player_1"] = _t"那里 那里的石头"
_M["ANIMATION_1404_player_2"] = _t"也许可以击碎"
_M["ANIMATION_1404_加隆_3"] = _t"银河星爆"
_M["ANIMATION_1404_加隆_4"] = _t"哈哈 终于可以出去了"










----------------------死亡皇后岛-------------------------
--死亡皇后岛--沉眠火山之战
_M["ANIMATION_1311_教皇_1"] = _t"是时候了"
_M["ANIMATION_1311_教皇_2"] = _t"苏醒吧 沉睡在皇后岛最深处的怨念"
_M["ANIMATION_1311_城户纱织_1"] = _t"星矢 你们是神选中的战士 是希望的圣斗士"
_M["ANIMATION_1311_城户纱织_2"] = _t"一定不能死"
_M["ANIMATION_1311_沙加_1"] = _t"这股小宇宙是"
_M["ANIMATION_1311_沙加_2"] = _t"看来事情没那么简单 就先饶过你们"

--死亡皇后岛--黑暗凤凰之战
_M["ANIMATION_1312_瞬_1"] = _t"太好了，只要打败他，哥哥就能醒过来了。"
_M["ANIMATION_1312_黑暗凤凰_1"] = _t"哈哈哈哈"
_M["ANIMATION_1312_黑暗凤凰_2"] = _t"你们真的以为可以打败我？"
_M["ANIMATION_1312_黑暗凤凰_3"] = _t"在我的幻境里，我就是无所不能的神"
_M["ANIMATION_1312_黑暗凤凰_4"] = _t"没有人可以杀死我。"
_M["ANIMATION_1312_player_1"] = _t"瞬"
_M["ANIMATION_1312_黑暗凤凰_5"] = _t"挡的不错，那就让你们尝尝强戈大人赐予我的力量。"
_M["ANIMATION_1312_瞬_2"] = _t"哥 哥哥"
_M["ANIMATION_1312_一辉_1"] = _t"瞬"
_M["ANIMATION_1312_一辉_2"] = _t"真以为这种幻境就能困住我"
_M["ANIMATION_1312_瞬_3"] = _t"哥哥"
_M["ANIMATION_1312_一辉_3"] = _t"凤翼天翔"


--死亡皇后岛--一辉与沙加之战
_M["ANIMATION_1313_沙加_1"] = _t"愚蠢的人"
_M["ANIMATION_1313_沙加_2"] = _t"既然你这么想死"
_M["ANIMATION_1313_一辉_1"] = _t"凤翼天翔"
_M["ANIMATION_1313_沙加_3"] = _t"天舞宝轮 开"
_M["ANIMATION_1313_沙加_4"] = _t"难道说"
_M["ANIMATION_1313_沙加_5"] = _t"神明已降下天罚"
_M["ANIMATION_1313_player_1"] = _t"火山竟然爆发了"
_M["ANIMATION_1313_沙加_6"] = _t"即使我不出手"
_M["ANIMATION_1313_沙加_7"] = _t"你也逃脱不了死亡的命运"

--死亡皇后岛--封印皇后岛
_M["ANIMATION_1314_player_1"] = _t"一辉"
_M["ANIMATION_1314_一辉_1"] = _t"不要再说了"
_M["ANIMATION_1314_player_2"] = _t"可是"
_M["ANIMATION_1314_一辉_2"] = _t"什么"
_M["ANIMATION_1314_枫_1"] = _t"一辉"
_M["ANIMATION_1314_枫_2"] = _t"你们还有更重要的事情要做"
_M["ANIMATION_1314_枫_3"] = _t"而皇后岛是我的家"
_M["ANIMATION_1314_枫_4"] = _t"就该由我自己来守护"
_M["ANIMATION_1314_一辉_3"] = _t"枫"


----------------------东西伯利亚-------------------------
--东西伯利亚--冰河VS亚雷库萨
_M["ANIMATION_1210_亚雷库萨_1"] = _t"看来你还是决定要与我为敌啊"
_M["ANIMATION_1210_亚雷库萨_2"] = _t"冰河"
_M["ANIMATION_1210_亚雷库萨_3"] = _t"最后再给你一次机会"
_M["ANIMATION_1210_亚雷库萨_4"] = _t"不然可别怪我不客气"
_M["ANIMATION_1210_冰河_1"] = _t"别妄想了，亚雷库萨！"
_M["ANIMATION_1210_冰河_2"] = _t"我一定会阻止你们的阴谋 拿到奥尔哈钢之核"
_M["ANIMATION_1210_亚雷库萨_5"] = _t"那真是……太可惜了"
_M["ANIMATION_1210_亚雷库萨_6"] = _t"不愧是我看中的力量 "
_M["ANIMATION_1210_亚雷库萨_7"] = _t"蔚蓝脉冲"
_M["ANIMATION_1210_亚雷库萨_8"] = _t"可恶"
_M["ANIMATION_1210_亚雷库萨_9"] = _t"给我上"
_M["ANIMATION_1210_冰河_3"] = _t"白鸟 绝不会屈服"
_M["ANIMATION_1210_冰河_4"] = _t"钻石星尘拳"
_M["ANIMATION_1210_亚雷库萨_10"] = _t"哼……这次就放过你"
_M["ANIMATION_1210_亚雷库萨_11"] = _t"但白鸟的力量，终将为我所用"

--东西伯利亚--玩家冰河vs加隆
_M["ANIMATION_1211_冰河_1"] = _t"加隆 为什么"
_M["ANIMATION_1211_加隆_1"] = _t"我早已抛弃了双子座黄金圣斗士的身份"
_M["ANIMATION_1211_加隆_2"] = _t"现在的我"
_M["ANIMATION_1211_加隆_3"] = _t"是海龙将军"
_M["ANIMATION_1211_冰河_2"] = _t"什么"
_M["ANIMATION_1211_加隆_4"] = _t"就让你们见识一下北大西洋七位海将军之长"
_M["ANIMATION_1211_加隆_5"] = _t"海龙将军的实力吧"
_M["ANIMATION_1211_加隆_6"] = _t"黄金三角异次元"
_M["ANIMATION_1211_冰河_3"] = _t"奥尔哈钢之核"
_M["ANIMATION_1211_冰河_4"] = _t"绝不能 让你得逞"
_M["ANIMATION_1211_加隆_7"] = _t"真是幼稚"
_M["ANIMATION_1211_加隆_8"] = _t"什么"
_M["ANIMATION_1211_加隆_9"] = _t"你们"
_M["ANIMATION_1211_加隆_10"] = _t"一定会付出代价"

--东西伯利亚--艾尔扎克出现
_M["ANIMATION_1212_雅科夫_1"] = _t"艾尔扎克"
_M["ANIMATION_1212_雅科夫_2"] = _t"他竟然还活着 他没有死"

--东西伯利亚--亚雷库萨弑父
_M["ANIMATION_1214_长老_1"] = _t"亚雷库萨 难道说 你想通了"

--东西伯利亚--瓦尔基里演讲
_M["ANIMATION_1215_瓦尔基里_1"] = _t"北欧族的勇士们"
_M["ANIMATION_1215_瓦尔基里_2"] = _t"我们并不渴望战争"
_M["ANIMATION_1215_瓦尔基里_3"] = _t"但当侵略发生的时候"
_M["ANIMATION_1215_瓦尔基里_4"] = _t"我们会用自己的身躯保卫故土"
_M["ANIMATION_1215_瓦尔基里_5"] = _t"许多弟兄已经为了胜利而献身"
_M["ANIMATION_1215_瓦尔基里_6"] = _t"但只要我们仍屹立在此 就没有人"
_M["ANIMATION_1215_瓦尔基里_7"] = _t"能将我们打败"
_M["ANIMATION_1215_瓦尔基里_8"] = _t"站起来吧 勇士们"
_M["ANIMATION_1215_瓦尔基里_9"] = _t"为北欧族而战"

--东西伯利亚--中加隆幻胧拳
_M["ANIMATION_1216_player_1"] = _t"加隆"
_M["ANIMATION_1216_加隆_1"] = _t"什么"
_M["ANIMATION_1216_加隆_2"] = _t"绝不能让他破坏我的计划"
_M["ANIMATION_1216_加隆_3"] = _t"看来只能这样了"
_M["ANIMATION_1216_加隆_4"] = _t"幻胧魔皇拳"
_M["ANIMATION_1216_player_2"] = _t"我这是"
_M["ANIMATION_1216_player_3"] = _t"睡了多久"

--东西伯利亚--冰河被俘
_M["ANIMATION_1217_亚雷库萨_1"] = _t"我需要你的力量 冰河"
_M["ANIMATION_1217_亚雷库萨_2"] = _t"做我们的伙伴吧"
_M["ANIMATION_1217_冰河_1"] = _t"妄想 我不会做你们南下侵略的帮凶"
_M["ANIMATION_1217_冰河_2"] = _t"钻石星辰拳"
_M["ANIMATION_1217_亚雷库萨_3"] = _t"哼"
_M["ANIMATION_1217_冰河_3"] = _t"什么 我的拳竟然毫无效果"
_M["ANIMATION_1217_亚雷库萨_4"] = _t"哼 蔚蓝脉冲"
_M["ANIMATION_1217_亚雷库萨_5"] = _t"哈哈哈哈"
_M["ANIMATION_1217_亚雷库萨_6"] = _t"带走"
_M["ANIMATION_1217_player_1"] = _t"冰河"
_M["ANIMATION_1217_亚雷库萨_7"] = _t"嗯？"
_M["ANIMATION_1217_亚雷库萨_8"] = _t"哼"



----------------------亚特兰蒂斯-------------------------
--亚特兰蒂斯--修亚VS海龙
_M["ANIMATION_1230_修亚_1"] = _t"这是我和他之间的战斗 请你不要插手"
_M["ANIMATION_1230_加隆_1"] = _t"哼  想不到你会和雅典娜的圣斗士混在一起"
_M["ANIMATION_1230_加隆_2"] = _t"不过"
_M["ANIMATION_1230_加隆_3"] = _t"无所谓了  "
_M["ANIMATION_1230_修亚_2"] = _t"少说废话"
_M["ANIMATION_1230_加隆_4"] = _t"你在看哪里"
_M["ANIMATION_1230_加隆_5"] = _t"可恶"
_M["ANIMATION_1230_加隆_6"] = _t"去死吧"

--亚特兰蒂斯--玩家VS海马
_M["ANIMATION_1232_海马_1"] = _t"高涨波涛"


----------------------七大洋柱-------------------------
--七大洋柱--生命支柱破碎
_M["ANIMATION_2045_合_1"] = _t"摧毁生命支柱"
_M["ANIMATION_2045_合_2"] = _t"上啊"
_M["ANIMATION_2045_波塞冬_1"] = _t"不可能"
_M["ANIMATION_2045_波塞冬_2"] = _t"你们 不可原谅"
_M["ANIMATION_2045_雅典娜_1"] = _t"你已经失败了 波塞冬 "
_M["ANIMATION_2045_波塞冬_3"] = _t"你手上拿的是"
_M["ANIMATION_2045_波塞冬_4"] = _t"雅典娜之壶"
_M["ANIMATION_2045_波塞冬_5"] = _t"可恶"
_M["ANIMATION_2045_波塞冬_6"] = _t"去死吧"
_M["ANIMATION_2045_合_3"] = _t"加隆"
_M["ANIMATION_2045_加隆_1"] = _t"对不起 雅典娜"
_M["ANIMATION_2045_雅典娜_2"] = _t"在这个时代觉醒原本就不是你本意 再次安眠吧 波塞冬"
_M["ANIMATION_2045_波塞冬_7"] = _t"住手 雅典娜 你会后悔的"
_M["ANIMATION_2045_雅典娜_3"] = _t"维护世界和平 这就是我的使命啊"


----------------------哈迪斯城-------------------------
--哈迪斯城--玩家VS拉达曼迪斯
_M["ANIMATION_1250_拉达曼迪斯_1"] = _t"你的实力连被我亲手杀死的资格都没有"
_M["ANIMATION_1250_拉达曼迪斯_2"] = _t"但我很乐意送你去另一个世界"
_M["ANIMATION_1250_拉达曼迪斯_3"] = _t"嗯"
_M["ANIMATION_1250_拉达曼迪斯_4"] = _t"比我想象的还要急迫呢"
_M["ANIMATION_1250_拉达曼迪斯_5"] = _t"那么 如你所愿"
_M["ANIMATION_1250_穆_1"] = _t"艾欧里亚"
_M["ANIMATION_1250_拉达曼迪斯_6"] = _t"别着急 接下来就轮到你们了"
_M["ANIMATION_1250_穆_2"] = _t"不能就这样结束"
_M["ANIMATION_1250_穆_3"] = _t"&name& 你是最后的希望"
_M["ANIMATION_1250_穆_4"] = _t"雅典娜就交给你了"

----------------------冥界-------------------------
--冥界--沙加出场
_M["ANIMATION_1323_杂兵1_1"] = _t"胆敢混入神圣的冥界"
_M["ANIMATION_1323_杂兵2_1"] = _t"趁大人还没发现"
_M["ANIMATION_1323_众杂兵_1"] = _t"宰了他"
_M["ANIMATION_1323_杂兵3_1"] = _t"最后一击"
_M["ANIMATION_1323_杂兵1_2"] = _t"是雅典娜 抓住她"
_M["ANIMATION_1323_沙加_1"] = _t"不知死活的饿鬼啊"
_M["ANIMATION_1323_沙加_2"] = _t"你们的珠子已经变黑了"
_M["ANIMATION_1323_沙加_3"] = _t"在轮回里寻找归宿吧"

--冥界--秒杀六天星
_M["ANIMATION_1324_拉达曼迪斯_1"] = _t"加隆 我们的账以后再算"
_M["ANIMATION_1324_地恶星_1"] = _t"大人 这个圣斗士请交给我们"
_M["ANIMATION_1324_拉达曼迪斯_2"] = _t"蠢货 你们几百个一起上也不是他的对手"
_M["ANIMATION_1324_撒加_1"] = _t"真是关爱下属 你们可以走了"
_M["ANIMATION_1324_杂兵_1"] = _t"什么 混帐东西 太狂妄了"
_M["ANIMATION_1324_地恶星_2"] = _t"一定让你尝尝我们的厉害"
_M["ANIMATION_1324_撒加_2"] = _t"你们想见识星辰粉碎的样子吗"
_M["ANIMATION_1324_撒加_3"] = _t"真是缺乏刺激呐"

--冥界--潘多拉抓走一辉
_M["ANIMATION_1325_天雄星_1"] = _t"怎 怎么消失了"
_M["ANIMATION_1325_撒加_1"] = _t"潘多拉"

--冥界--玩家冲入犹大环
_M["ANIMATION_1326_杂兵1_1"] = _t"你们休想通过这里"
_M["ANIMATION_1326_星矢_1"] = _t"天马流星拳"
_M["ANIMATION_1326_杂兵2_1"] = _t"拦住他们"
_M["ANIMATION_1326_星矢_2"] = _t"我们走"

--冥界--瞬的回忆
_M["ANIMATION_1327_雅典娜_1"] = _t"想杀我 你必须要终止日食 否则我不会让任何人死的"
_M["ANIMATION_1327_雅典娜_2"] = _t"啊"
_M["ANIMATION_1327_沙加_1"] = _t"雅典娜"
_M["ANIMATION_1327_哈迪斯_1"] = _t"怎么了 雅典娜 你不是自愿献出生命的吗"
_M["ANIMATION_1327_雅典娜_3"] = _t"瞬"
_M["ANIMATION_1327_雅典娜_4"] = _t"快点醒过来吧"
_M["ANIMATION_1327_哈迪斯_2"] = _t"怎么回事"
_M["ANIMATION_1327_哈迪斯_3"] = _t"雅典娜的血 好烫"
_M["ANIMATION_1327_雅典娜_5"] = _t"我感觉到了"
_M["ANIMATION_1327_雅典娜_6"] = _t"我感觉到瞬的小宇宙"
_M["ANIMATION_1327_雅典娜_7"] = _t"只要我活着就有义务守护一切生命 为此转生到这个时代 哈迪斯 快点离开瞬的肉体"
_M["ANIMATION_1327_哈迪斯_4"] = _t"啊"
_M["ANIMATION_1327_哈迪斯_5"] = _t"雅典娜"
_M["ANIMATION_1327_雅典娜_8"] = _t"你现在应该明白再战下去是没有意义的 快点停止日食吧哈迪斯"
_M["ANIMATION_1327_哈迪斯_6"] = _t"雅典娜"
_M["ANIMATION_1327_哈迪斯_7"] = _t"我要让你跟我一样"
_M["ANIMATION_1327_哈迪斯_8"] = _t"我要毁了你"
_M["ANIMATION_1327_沙加_2"] = _t"雅典娜"

--冥界--音之战
_M["ANIMATION_1328_天兽星_1"] = _t"你唯一能发出攻击音符的琴弦已被我切断了"
_M["ANIMATION_1328_天兽星_2"] = _t"乖乖受死吧"
_M["ANIMATION_1328_天兽星_3"] = _t"你绝望的样子太让我快乐了"
_M["ANIMATION_1328_天兽星_4"] = _t"自从你来到这里 我就再也没能为冥王大人演奏过"
_M["ANIMATION_1328_天兽星_5"] = _t"在你死之前告诉你真相吧"
_M["ANIMATION_1328_天兽星_6"] = _t"你们看到的太阳是我的杰作"
_M["ANIMATION_1328_天兽星_7"] = _t"哈哈哈哈"
_M["ANIMATION_1328_天兽星_8"] = _t"可恶的奥路菲"
_M["ANIMATION_1328_天兽星_9"] = _t"看我的均衡诅咒"
_M["ANIMATION_1328_天兽星_10"] = _t"你"
_M["ANIMATION_1328_天兽星_11"] = _t"居然用牙齿"

--冥界--潜修开启
_M["ANIMATION_1329_player_1"] = _t"这是"
_M["ANIMATION_1329_player_2"] = _t"阿赖耶识"
_M["ANIMATION_1329_沙加_1"] = _t"圣战就要开始 我感受到了你的小宇宙"
_M["ANIMATION_1329_player_3"] = _t"沙加"
_M["ANIMATION_1329_沙加_2"] = _t"一定要领悟阿赖耶识"
_M["ANIMATION_1329_沙加_3"] = _t"以前的经验已经帮不了你"
_M["ANIMATION_1329_沙加_4"] = _t"你需要新的历练才能战斗"
_M["ANIMATION_1329_player_4"] = _t"沙加"
_M["ANIMATION_1329_player_5"] = _t"新的历练"
_M["ANIMATION_1329_player_6"] = _t"那是"
_M["ANIMATION_1329_player_7"] = _t"我感觉到了"




----------------------黄金十二宫-------------------------
--黄金十二宫--白羊宫_穆修圣衣
_M["ANIMATION_2100_穆_1"] = _t"想打败黄金圣斗士 就必须充分燃烧你们的小宇宙"
_M["ANIMATION_2100_穆_2"] = _t"也就是"
_M["ANIMATION_2100_穆_3"] = _t"觉醒你们的第七感"
_M["ANIMATION_2100_众_1"] = _t"第七感"
_M["ANIMATION_2100_穆_4"] = _t"不错"
_M["ANIMATION_2100_穆_5"] = _t"第七感是超越六感的存在"
_M["ANIMATION_2100_穆_6"] = _t"你们必须领悟它"
_M["ANIMATION_2100_穆_7"] = _t"你的圣衣也需要修理"
_M["ANIMATION_2100_player_1"] = _t"感觉圣衣充满了力量"
_M["ANIMATION_2100_星矢_1"] = _t"快走 时间不多了"

--黄金十二宫--金牛宫_战斗开场
_M["ANIMATION_2102_阿鲁迪巴_1"] = _t"你不是我的对手"
_M["ANIMATION_2102_阿鲁迪巴_2"] = _t"赶紧离开这里"
_M["ANIMATION_2102_星矢_1"] = _t"我怎么能在这里就倒下"
_M["ANIMATION_2102_星矢_2"] = _t"纱织小姐 我一定会救你的"


--黄金十二宫--金牛宫之泰坦新星发动
_M["ANIMATION_2103_星矢_1"] = _t"燃烧吧，我的小宇宙"
_M["ANIMATION_2103_星矢_2"] = _t"天马---流星拳"
_M["ANIMATION_2103_阿鲁迪巴_1"] = _t"和之前完全不一样的力量"
_M["ANIMATION_2103_阿鲁迪巴_2"] = _t"看来我要认真一点了。"
_M["ANIMATION_2103_阿鲁迪巴_3"] = _t"泰坦新星"

--黄金十二宫--纱织中箭
_M["ANIMATION_2101_天箭座_1"] = _t"这就带你们去面见教皇大人"
_M["ANIMATION_2101_天箭座_2"] = _t"只不过"
_M["ANIMATION_2101_天箭座_3"] = _t"是带你们的尸体"
_M["ANIMATION_2101_天箭座_4"] = _t"看招"
_M["ANIMATION_2101_天箭座_5"] = _t"幻影黄金箭"
_M["ANIMATION_2101_player_1"] = _t"不好"
_M["ANIMATION_2101_众_1"] = _t"纱织小姐"
_M["ANIMATION_2101_星矢_1"] = _t"天马流星拳"
_M["ANIMATION_2101_天箭座_6"] = _t"呵呵呵呵"
_M["ANIMATION_2101_天箭座_7"] = _t"你们救不了这个女人的"
_M["ANIMATION_2101_player_2"] = _t"纱织小姐"


--黄金十二宫--射手宫_黄金箭飞出
_M["ANIMATION_2104_艾欧罗斯_1"] = _t"年轻的圣斗士啊 雅典娜就托付给你们了   ----艾欧罗斯"

--黄金十二宫--狮子宫_卡西欧士救玩家
_M["ANIMATION_2106_狮子座艾欧里亚_1"] = _t"去死吧"
_M["ANIMATION_2106_player_1"] = _t"卡西欧士"
_M["ANIMATION_2106_卡西欧士_1"] = _t"只有这样他才会清醒"
_M["ANIMATION_2106_卡西欧士_2"] = _t"你快走吧"




----------------------活动副本-------------------------
--新两环--塔耳塔洛斯_睡神阴影出场
_M["ANIMATION_2041_睡神阴影_1"] = _t"看来我的收藏馆又能添加新鲜的标本了"
_M["ANIMATION_2041_睡神阴影_2"] = _t"陷入无尽的睡眠吧"

--新两环--塔耳塔洛斯_死神阴影出场
_M["ANIMATION_2027_死神阴影_1"] = _t"放弃吧"
_M["ANIMATION_2027_死神阴影_2"] = _t"你们是绝对逃不掉的"

--新两环--塔耳塔洛斯_冥后出场
_M["ANIMATION_2033_冥后_1"] = _t"就为了几颗种子"
_M["ANIMATION_2033_冥后_2"] = _t"打扰我的沉睡"
_M["ANIMATION_2033_冥后_3"] = _t"真是"
_M["ANIMATION_2033_冥后_4"] = _t"不想活了"

--新两环--塔耳塔洛斯_冥后变身
_M["ANIMATION_2034_冥后_1"] = _t"来点刺激吧"

--活动--射手逃亡1
_M["ANIMATION_2020_艾欧罗斯_1"] = _t"快走"

--活动--射手逃亡2
_M["ANIMATION_2021_修罗_1"] = _t"别妄想通过那里"
_M["ANIMATION_2021_艾欧罗斯_1"] = _t"快走"

--活动--射手逃亡3
_M["ANIMATION_2022_修罗_1"] = _t"死了吗"
_M["ANIMATION_2022_修罗_2"] = _t"哼"
_M["ANIMATION_2022_白鲸座_1"] = _t"站住"

--活动--射手逃亡4
_M["ANIMATION_2023_艾欧罗斯_1"] = _t"住手 修罗"
_M["ANIMATION_2023_艾欧罗斯_2"] = _t"解释也没有用吗"
_M["ANIMATION_2023_艾欧罗斯_3"] = _t"既然这样  我也只能全力相拼了"
_M["ANIMATION_2023_艾欧罗斯_4"] = _t"原子闪电  光速拳"
_M["ANIMATION_2023_艾欧罗斯_5"] = _t"黄 金 箭"
_M["ANIMATION_2023_修罗_1"] = _t"哼 去死吧"
_M["ANIMATION_2023_修罗_2"] = _t"接下来"
_M["ANIMATION_2023_player_1"] = _t"修罗"
_M["ANIMATION_2023_player_2"] = _t"住手"
_M["ANIMATION_2023_修罗_3"] = _t"又来一个送死的"

--活动--十风穴_瞬救星矢
_M["ANIMATION_2019_瞬_1"] = _t"赶上了"
_M["ANIMATION_2019_黑暗仙女_1"] = _t"救他之前 先救救你们自己吧"
_M["ANIMATION_2019_星矢_1"] = _t"我不能 连累你们"
_M["ANIMATION_2019_瞬_2"] = _t"星矢"
_M["ANIMATION_2019_瞬_3"] = _t"这里拜托你了"
_M["ANIMATION_2019_黑暗仙女_2"] = _t"抓住他们"

--两环--沉没的亚特兰蒂斯1
_M["ANIMATION_2009_海斗士美人鱼_1"] = _t"打的不错嘛"
_M["ANIMATION_2009_海斗士美人鱼_2"] = _t"这么想知道真相的话"
_M["ANIMATION_2009_海斗士美人鱼_3"] = _t"就跟我来吧"

--两环--沉没的亚特兰蒂斯3
_M["ANIMATION_2011_加隆_1"] = _t"救 救救我 啊"
_M["ANIMATION_2011_加隆_2"] = _t"哈哈哈哈"

--两环--沉没的亚特兰蒂斯4
_M["ANIMATION_2017_海斗士美人鱼_1"] = _t"终于还是被你发现了"
_M["ANIMATION_2017_player_1"] = _t"是谁"
_M["ANIMATION_2017_海斗士美人鱼_2"] = _t"别紧张"
_M["ANIMATION_2017_海斗士美人鱼_3"] = _t"接下来发生的一切会更有趣的"
_M["ANIMATION_2017_海斗士美人鱼_4"] = _t"被选中的人要挑选一件鳞衣接受挑战"
_M["ANIMATION_2017_海斗士美人鱼_5"] = _t"但愿你"
_M["ANIMATION_2017_海斗士美人鱼_6"] = _t"尽快找到答案"
_M["ANIMATION_2017_海斗士美人鱼_7"] = _t"祝你好运"

--三环狮子--狮子登场
_M["ANIMATION_2002_狮子座艾欧里亚_1"] = _t"现在才到么 太慢了"
_M["ANIMATION_2002_狮子座艾欧里亚_2"] = _t"看来你们需要再锻炼一下"

--三环狮子--火堆玩法
_M["ANIMATION_2001_系统公告_1"] = _t"鼓起勇气 通过狮子座火的试炼吧"
_M["ANIMATION_2001_系统公告_2"] = _t"^ff0000（将狮子的考验者吸引至火焰旁可以更快的击杀）"

--钟楼-1
_M["ANIMATION_2012_莎尔娜_1"] = _t"守住去往圣域的通道"
_M["ANIMATION_2012_莎尔娜_2"] = _t"不要放过任何一个敌人 否则后果不堪设想"
_M["ANIMATION_2012_杂兵_1"] = _t"冲啊 为了哈迪斯大人 摧毁圣域"

--钟楼-2
_M["ANIMATION_2013_莎尔娜_1"] = _t"真没想到你们还打败了一个冥斗士"
_M["ANIMATION_2013_莎尔娜_2"] = _t"雅典娜神像附近出现了一股邪恶的小宇宙"
_M["ANIMATION_2013_莎尔娜_3"] = _t"快去守卫雅典娜神像"
_M["ANIMATION_2013_莎尔娜_4"] = _t"跟上我"
_M["ANIMATION_2013_莎尔娜_5"] = _t"别再磨蹭了"

--钟楼-3
_M["ANIMATION_2014_上代双子_1"] = _t"既然冥王让我复活 我就要为他而战"
_M["ANIMATION_2014_上代双子_2"] = _t"你们这些鼠辈 在痛苦中挣扎吧"

--三环双鱼--阿布罗狄出场
_M["ANIMATION_2006_双鱼座阿布罗迪_1"] = _t"欢迎来到双鱼幻境"
_M["ANIMATION_2006_双鱼座阿布罗迪_2"] = _t"我是爱与美共存的阿布罗狄"
_M["ANIMATION_2006_双鱼座阿布罗迪_3"] = _t"打败我"
_M["ANIMATION_2006_双鱼座阿布罗迪_4"] = _t"我就承认你是圣斗士"

--纱织别墅1--士兵闯入
_M["ANIMATION_2003_士兵甲_1"] = _t"抓住城户沙织"

--纱织别墅2--乌鸦乱舞
_M["ANIMATION_2004_白银圣斗士乌鸦座_1"] = _t"出来吧 我的小可爱"
_M["ANIMATION_2004_白银圣斗士乌鸦座_2"] = _t"给我 抓住她"

--纱织别墅3--天箭出场
_M["ANIMATION_2005_白银圣斗士天箭座_1"] = _t"城户沙织"
_M["ANIMATION_2005_白银圣斗士天箭座_2"] = _t"你的死期 到了"

--十风穴--一辉登场
_M["ANIMATION_2015_一辉_1"] = _t"哼"

--冰海神殿--海魔女和大乌贼
_M["ANIMATION_2038_海魔女_1"] = _t"到此为止吧"
_M["ANIMATION_2038_海魔女_2"] = _t"即使救得了她 也没有任何意义"
_M["ANIMATION_2038_海魔女_3"] = _t"因为"
_M["ANIMATION_2038_海魔女_4"] = _t"波塞冬大人"
_M["ANIMATION_2038_海魔女_5"] = _t"已经苏醒"
_M["ANIMATION_2038_海魔女_6"] = _t"还有"
_M["ANIMATION_2038_海魔女_7"] = _t"我准备了一个惊喜要送给你"
_M["ANIMATION_2038_海魔女_8"] = _t"希望你喜欢"

--冰海神殿--女武神瓦尔基里
_M["ANIMATION_2039_女武神_1"] = _t"为了守护这冰原的人民"
_M["ANIMATION_2039_女武神_2"] = _t"就算要与你们为敌"
_M["ANIMATION_2039_女武神_3"] = _t"我也在所不惜"

--冥界十二宫--宿命的对决
_M["ANIMATION_2047_史昂_1"] = _t"童虎"

--冥界十二宫--沙加坐化
_M["ANIMATION_2048_撒加_1"] = _t"还没完呢"
_M["ANIMATION_2048_穆_1"] = _t"不可原谅"
_M["ANIMATION_2048_合_1"] = _t"雅典娜的惊叹"
_M["ANIMATION_2048_穆_2"] = _t"雅典娜"
_M["ANIMATION_2048_雅典娜_1"] = _t"跟我来 撒加 我会亲自和你做个了断"

--冥界十二宫--女神之死
_M["ANIMATION_2049_雅典娜_1"] = _t"撒加"
_M["ANIMATION_2049_雅典娜_2"] = _t"你还犹豫什么"
_M["ANIMATION_2049_合_1"] = _t"雅典娜"













