--[[ @i18n dungeon ]]
local _t = require("i18n").context("dungeon")
DialogRaidHint =
{}
DialogRaidHint.StarGuard =  --影响星相守护是否生效,仅在多人副本有效
{
    [206] = true,
    [207] = true,
    [208] = true,
	[209] = true,
    [210] = true,
    [211] = true,
    [212] = true,
    [213] = true,
    [214] = true,
    [215] = true,
    [216] = true,
    [217] = true,
    [218] = true,
    [219] = true,
	[335] = true,
	[336] = true,
	[338] = true,
    [401] = true,
    [402] = true,
    [403] = true,
    [404] = true,
    [405] = true,
    [406] = true,
    [407] = true,
    [408] = true,
    [409] = true,
    [410] = true,
	[411] = true,
    [412] = true,
	[415] = true,
	[416] = true,
	[417] = true,
	[418] = true,
	[419] = true,
    [422] = true,
    [423] = true,
    [424] = true,
    [425] = true,
    [426] = true,


}
DialogRaidHint[401] = --纱织测试
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'圣域士兵 %d/30',1001},
    		[2]={_t'圣域士兵 %d/30 \r英仙座亚鲁哥路 %d/1 \r蜥蜴座美斯狄 %d/1',1100,1004,1005},
			[3]={_t'消灭前来攻击纱织的敌人 \r第一波敌人 %d/18 \r第二波敌人 %d/22 \r第三波敌人 %d/21 \r第四波敌人 %d/18',1006,1007,1008,1009},
    		[4]={_t'乌鸦座加米安 %d/1',1010},
			[5]={_t'天箭座托勒密 %d/1',1011},
			[6]={_t'进入战斗倒计时：%d 秒',1101},
			[7]={_t'冥斗士士兵 %d/15 \r地奇星赛洛斯 %d/1 \r海斗士士兵 %d/15 \r海魔女苏兰特 %d/1',1002,1004,1003,1005},
    	}
DialogRaidHint[402] = --圣战回忆
        {
    	   CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    	   HintTitle = _t'战斗目标：',
           [0]={_t'等待战斗开始'},
	       [1]={_t'冥斗士地囚星杰拉尔德 %d/1',101},
    	   [2]={_t'冥斗士地恶星伊索尔 %d/1',102},
           [3]={_t'关闭所有幻象机关，以消除天空的幻象'},
           [4]={_t'冥斗士天败星伊万 %d/1',103},
    	}
DialogRaidHint[403] = --三环双鱼宫
        {
    	   CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    	   HintTitle = _t'战斗目标：',
           [0]={_t'等待战斗开始'},
	       [1]={_t'仙皇座白银圣斗士 %d/1',100},
    	   [2]={_t'双鱼座黄金圣斗士 %d/1',101},
    	}
DialogRaidHint[404] = --三环狮子宫
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'狮子考验者 %d/4 \r狮子召唤者 %d/2 \r狮子突击者 %d/34',100,103,101},
			[2]={_t'路障【石头】 %d/1',104},
    		[3]={_t'艾欧里亚的幻影 %d/1',102},
    	}
DialogRaidHint[405] = --三环天秤
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
    		[1]={_t'天贵星投影 %d/1',15},
    		[2]={_t'天猛星投影 %d/1',20},
			[3]={_t'童虎幻影 %d/1',21},
    	}
DialogRaidHint[406] = --保卫钟楼
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'保卫圣域，消灭冲向圣域的敌人！ \r不要让进入圣域的敌人达到10个。 \r已有 %d个敌人进入圣域 \r正在防御第 %d/5波敌人 \r击杀敌人 %d/%d',102,101,106,107},
    		[2]={_t'消灭冥斗士天角星洛克 %d/1',103},
			[3]={_t'前往雅典娜神像，消灭沿途的敌人'},
    		[4]={_t'保卫雅典娜神像！ \r正在防御第 %d/8波敌人 \r击杀敌人 %d/%d',104,106,107},
			[5]={_t'消灭上代双子座 %d/1',105},
            [6]={_t'保卫雅典娜神像！ \r下一波敌人在 %d秒后到来',108},
    	}
DialogRaidHint[407] = --二环亚特兰蒂斯
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'找到游轮上的水手'},
			[1]={_t'海斗士勇士 %d/9 \r海马 %d/1',1030,1002},
    		[2]={_t'潮汐蟹 %d/20',1033},
			[3]={_t'海怪 %d/1',1006},
			[4]={_t'黑暗鲸鱼座梅德赛斯 %d/1',1008},
			[5]={_t'水母 %d/20 \r潮汐巫师 %d/2',1037,1038},
			[6]={_t'在180秒内杀死尽量多的敌人：\r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1051,1042},
			[7]={_t'海斗士士兵 %d/15',1044},
			[8]={_t'六兽妖 %d/1',1023},
    		[9]={_t'前往海龙祭坛'},
			[10]={_t'海龙 %d/1',1024},
			[11]={_t'继续前进'},
			[12]={_t'消灭潮水般涌来的怪物'},
			[13]={_t'跟随狄蒂丝，探究海底的秘密'},
			[14]={_t'释放魔鬼鱼灵魂'},
			[15]={_t'释放海魔女灵魂 \r最终杀敌数：%d',1042},
			[16]={_t'释放海皇子灵魂'},
			[17]={_t'海斗士精英 %d/6 \r海马 %d/1',1031,1002},
			[18]={_t'潮汐术士 %d/2 \r海马 %d/1',1032,1002},
			[19]={_t'潮汐蟹 %d/40',1033},
			[20]={_t'海斗士杀手 %d/6 \r黑暗飞鱼座爱莉丝 %d/1',1034,1004},
			[21]={_t'黑暗斗士勇士 %d/9 \r黑暗飞鱼座爱莉丝 %d/1',1035,1004},
			[22]={_t'复活的斗士精英 %d/10 \r黑暗飞鱼座爱莉丝 %d/1',1036,1004},
			[23]={_t'水母 %d/15 \r黑暗斗士队长 %d/1',1037,1039},
			[24]={_t'潮汐巫师 %d/2 \r黑暗斗士队长 %d/1',1038,1039},
			[25]={_t'在180秒内杀死尽量多的敌人： \r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1051,1042},
			[26]={_t'海斗士士兵 %d/30',1044},
			[27]={_t'嗜血蝙蝠 %d/15 \r黑暗斗士头目 %d/3',1046,1045},
			[28]={_t'黑暗斗士精英 %d/7 \r黑暗斗士头目 %d/1',1047,1045},
			[29]={_t'复活的斗士勇士 %d/6 \r塞壬女妖 %d/6',1048,1049},
			[30]={_t'找出真正的海龙鳞衣\r被蓝光覆盖的人可以开启真假海龙鳞衣'},
			[31]={_t'继续前进，小心路上的滚石\r到达高台后，杀死全部巨石召唤者'},
			[32]={_t'继续前进，小心路上的刺柱机关和怪物'},
			[33]={_t'继续前进，小心路边海蛇的冰冻攻击'},
			[34]={_t'狄蒂丝再次出现，上前与狄蒂丝对话\r（建议等队友都到了再去找她）'},
    	}
DialogRaidHint[408] = --墓地挽魂歌
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0]={_t'等待战斗开始'},
            [1]={_t'探索墓地'},
            [2]={_t'开启石屋中的潘多拉万花筒 %d/1',35},
            [3]={_t'与石屋中的潘多拉谈话'},
            [4]={_t'前代独角兽座 %d/1',22},
            [5]={_t'肃清庭院 \r墓地卫队长 %d/4 \r前代变色龙座 %d/1 \r迷题事件：破解墓地法阵 %d/1 \r法阵一区 %d/1 \r法阵二区 %d/1 \r法阵三区 %d/1 \r法阵四区 %d/1 \r法阵五区 %d/1',10,23,24,15,16,17,18,19},
            [6]={_t'触摸能量异动的圣衣箱 \r击败前来进犯的敌人 \r结印冥斗士 %d/6 \r墓地执行官 %d/6 \r冥界恶灵 %d/6 \r复活的圣域士兵 %d/36',25,26,27,34},
            [7]={_t'肃清墓穴 \r墓穴潜伏者 %d/5 \r墓穴守卫 %d/30',28,29},
            [8]={_t'冥王小宇宙能量体 %d/1',30},
            [13]={_t'与石屋中的潘多拉谈话 \r探索事件：地狱三头犬 %d/1',31},
            [14]={_t'前代独角兽座 %d/1 \r探索事件：地狱三头犬 %d/1',22,31},
            [15]={_t'肃清庭院 \r墓地卫队长 %d/4 \r前代变色龙座 %d/1 \r迷题事件：破解墓地法阵 %d/1 \r法阵一区 %d/1 \r法阵二区 %d/1 \r法阵三区 %d/1 \r法阵四区 %d/1 \r法阵五区 %d/1 \r探索事件：地狱三头犬 %d/1',10,23,24,15,16,17,18,19,31},
            [16]={_t'触摸能量异动的圣衣箱 \r击败前来进犯的敌人 \r结印冥斗士 %d/6 \r墓地执行官 %d/6 \r冥界恶灵 %d/6 \r复活的圣域士兵 %d/36 \r探索事件：地狱三头犬 %d/1',25,26,27,34,31},
            [17]={_t'肃清墓穴 \r墓穴潜伏者 %d/5 \r墓穴守卫 %d/30 \r探索事件：地狱三头犬 %d/1',28,29,31},
            [18]={_t'冥王小宇宙能量体 %d/1 \r探索事件：地狱三头犬 %d/1',30,31},
            [9]={_t'潘多拉的死亡赠礼：第%d/4波，下一波奖励怪物将在%d/60秒后刷新',32,33},
            [10]={_t'死亡挣脱：消灭埋伏的冥界死灵 %d/20',14},
            [11]={_t'潘多拉的死亡赠礼：终章倒计时%d/60秒',33},
        }
DialogRaidHint[409] = --塔耳塔洛斯
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'进入塔耳塔洛斯'},
			[1]={_t'击杀泰坦斗士守卫之灵 %d/1',101},
    		[2]={_t'击杀断桥灵魂看守 %d/1 \r找到深入塔耳塔洛斯的路',102},
			[3]={_t'击败泰坦巨人精英克诺斯 %d/1',103},
		    [4]={_t'击败上古守卫 %d/2\r打开通往塔耳塔洛斯深处的大门',104},
			[5]={_t'继续前进\r摧毁冥后封印'},
    		[6]={_t'击破天魔星奎因 %d/1',105},
			[7]={_t'击破死神阴影 %d/1',106},
			[8]={_t'击败冥后 %d/1\r取得木栾子果实',107},
    		[9]={_t'离开地狱最深处'},
			[10]={_t'在120秒内尽可能多的击杀冥王的守卫：\r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',109,108},
			[11]={_t'利用火药监管者，尽快打开走廊的门'},
			[12]={_t'杀死地阔星 %d/1\r小心地阔星身边的双足飞龙',1102},
			[13]={_t'杀死天间星卡隆 %d/1\r摆渡人亡灵的存在会使卡隆实力大增',1101},
			[14]={_t'杀死睡神阴影 %d/1\r小心冥蝶王和冥蝶',1100},
			[15]={_t'破坏睡神沙漏，然后离开睡神幻境'},
			[16]={_t'在60秒内尽可能多的击杀冥王守卫：\r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1111,1110},
			[17]={_t'继续前进\r摧毁冥后封印'},
    	}
DialogRaidHint[410] = --新三环冰火深渊
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'半身巨人 %d/1',1},
			[2]={_t'抵挡深渊进攻 \r^e12500剩余时间：%d 秒^N',4101},
    		[3]={_t'熔岩巨人 %d/1',3},
			[4]={_t'组合巨人 %d/1',4},
			[5]={_t'天权星阿鲁贝利西 %d/1',5},
			[6]={_t'天璇星八腿战马哈根 %d/1',6},
    	}
DialogRaidHint[411] = --新三环北欧小镇
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			--[[[1]={_t'冰斗士百夫长 %d/1 \r冰斗士弓箭手 %d/2 \r冰斗士卫兵 %d/5',100,101,102},
			[2]={_t'冰斗士百夫长 %d/4 \r冰斗士斥候 %d/6 \r冰斗士精英 %d/19',103,104,105},
    		[3]={_t'击败开阳星冰斗士希度 %d/1',106},
			[4]={_t'冰斗士百夫长 %d/3 \r冰斗士精英 %d/2 \r北极熊 %d/6',107,108,109},
			[5]={_t'击败玉衡星冰斗士法利鲁 %d/1',110},
			[6]={_t'城门 %d/1',111},
            ]]--
            [1]={_t'冰斗士百夫长 %d/3 \r冰斗士精英 %d/10 \r冰斗士斥候 %d/6',107,105,104},
            [2]={_t'击败开阳星冰斗士希度 %d/1',106},
            [3]={_t'冰斗士百夫长 %d/4 \r冰斗士精英 %d/9 \r北极熊 %d/6',103,105,109},
            [4]={_t'击败玉衡星冰斗士法利鲁 %d/1',110},
    	}
DialogRaidHint[412] = --新三环大蛇
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'在女神的指引下前进'},
    		[2]={_t'天机星杜鲁 %d/1',1000},
    		[3]={_t'前往蟒蛇头顶，消灭沿途的所有弓箭手'},
			[4]={_t'打爆蛇眼，找到通往蟒蛇口中的道路'},
			[5]={_t'从爆开的蛇眼处跳下去 \r邪神洛基 %d/1',1003},
			[6]={_t'拯救神族长老，杀死克尔和托尔'},
    	}
DialogRaidHint[415] = --攻破！复仇者联盟
        {
    	   CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    	   HintTitle = _t'战斗目标：',
           [0]={_t'等待战斗开始'},
	       [1]={_t'天枢星齐格弗里德 %d/1',1008},
    	   [2]={_t'天璇星哈根 %d/1',1007},
		   [3]={_t'天璇星哈根 %d/1 \r冥斗士天哭星 %d/1',1007,1012},
		   [4]={_t'天机星杜鲁 %d/1',1006},
		   [5]={_t'天机星杜鲁 %d/1 \r天贵星米洛斯 %d/1',1006,1010},
		   [6]={_t'杀死冥界三废： \r天角星洛克 %d/1 \r天杀星史蒂文 %d/1 \r天牢星哥顿 %d/1',1014,1015,1016},
		   [7]={_t'天权星阿鲁贝利亚 %d/1 \r冥斗士天捷星 %d/1 \r小心天捷星召出的魔蝶和蝙蝠',1003,1011},
		   [8]={_t'玉衡星菲利路 %d/1',1001},
		   [9]={_t'海马拜安 %d/1',1017},
		   [10]={_t'开阳星希度 %d/1 \r辅星巴度 %d/1',1005,1004},
		   [11]={_t'堕落的白银半人马座 %d/1 \r堕落的白银白鲸座 %d/1 \r堕落的白银银蝇座 %d/1',1021,1020,1019},
		   [12]={_t'天猛星拉达曼提斯 %d/1',1013},
		   [13]={_t'摇光星米伊美 %d/1 \r堕落的白银仙皇座 %d/1',1002,1018},
		   [14]={_t'邪神洛基 %d/1',1009},
		   [15]={_t'冰斗士队长 %d/4 \r冰斗士侍者 %d/8 \r北欧神族勇士 %d/8',1022,1025,1024},
		   [16]={_t'北欧弓箭手 %d/4 \r北极熊 %d/8 \r森林狼 %d/8',1023,1026,1027},
		   [17]={_t'隐藏事件：\r极地大青狼 %d/1',1029},
    	}
		
DialogRaidHint[417] = --哀嚎！地狱奏鸣曲
        {
    	   CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    	   HintTitle = _t'战斗目标：',
           [0]={_t'等待战斗开始'},
	       [1]={_t'深潜者 %d/1',1001},
		   [2]={_t'毒蛙 %d/7 \r冥界精英卫兵 %d/7 \r嗜血蝙蝠 %d/9 \r死神卫士 %d/9',1002,1003,1004,1005},
		   [3]={_t'嗜血蝙蝠 %d/9 \r死神卫士 %d/9',1004,1005},
		   [4]={_t'天败星伊万 %d/1',1006},
		   [5]={_t'走进神秘法阵'},
		   [6]={_t'进入法阵人数： %d \r法阵破解倒计时： %d',1007,1008},
		   [7]={_t'天贵星米洛斯 %d/1',1009},
		   [8]={_t'寒冰冥斗士 %d/1',1010},
		   [9]={_t'啖魂兽 %d/6 \r冥界精英卫兵 %d/6',1011,1012},
		   [10]={_t'与天间星卡隆交谈\r（只有队长才能与卡隆对话）'},
		   [11]={_t'天间星卡隆 %d/1',1013},
		   [12]={_t'卡隆十分憎恶那些盗宝贼，他们\r总是躲藏在石堆里，觊觎卡隆的\r宝藏。\r破坏石堆，找到他们，并将他们消灭\r（只有队长才能与卡隆对话）\r已消灭盗宝贼 %d',1202},
		   [13]={_t'冥蝶 %d/12 \r冥界精英卫兵 %d/12',1014,1015},
		   [14]={_t'进入发光区域'},
		   [15]={_t'在180秒内尽可能多的击杀敌人：\r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1016,1017},
		   [16]={_t'天兽星法拉奥 %d/1',1018},
		   [17]={_t'乌鸦 %d/11 \r冥界精英卫兵 %d/11',1019,1020},
		   [18]={_t'地狱冥蛇 %d/6 \r堕落术士 %d/6',1021,1022},
		   [19]={_t'解救仙女，用最快的速度杀死斯芬克斯\r否则每隔20秒，就会有一个仙女被献祭\r^e12500剩余仙女：%d 个^N \r斯芬克斯 %d/1',1023,1024},
		   [20]={_t'成功解救了 %d 个仙女\r快去取仙女留给你的礼物',1023},
		   [21]={_t'食腐秃鹫 %d/18 \r冥界女妖 %d/18',1025,1026},
		   [22]={_t'天雄星艾亚哥斯 %d/1',1027},
		   [23]={_t'隐藏BOSS：冥后珀尔塞福涅 %d/1',1028},
    	}
DialogRaidHint[418] = --复生！死去的斗士
        {
    	   CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    	   HintTitle = _t'战斗目标：',
           [0]={_t'等待战斗开始'},
	       [1]={_t'仙王座戴达罗斯 %d/1',1001},
		   [2]={_t'英仙座亚鲁哥路 %d/1',1002},
		   [3]={_t'仙王座戴达罗斯 %d/1 \r英仙座亚鲁哥路 %d/1',1001,1002},
		   [4]={_t'天箭座托勒密 %d/1',1003},
		   [5]={_t'乌鸦座加米安 %d/1',1004},
		   [6]={_t'天箭座托勒密 %d/1 \r乌鸦座加米安 %d/1',1003,1004},
		   [7]={_t'蜥蜴座美斯狄 %d/1',1005},
		   [8]={_t'六分仪座 %d/1',1006},
		   [9]={_t'乌鸦座加米安 %d/1 \r六分仪座 %d/1',1005,1006},
		   [10]={_t'熔岩巨人 %d/1',1016},
		   [11]={_t'消灭沿路的海斗士卫兵'},
		   [12]={_t'北海巨妖艾尔扎克 %d/1',1007},
		   [13]={_t'海魔女苏兰特 %d/1',1008},
		   [14]={_t'北海巨妖艾尔扎克 %d/1 \r海魔女苏兰特 %d/1',1007,1008},
		   [15]={_t'海马将军拜安 %d/1',1009},
		   [16]={_t'海怪将军隆奈狄斯 %d/1',1010},
		   [17]={_t'海马将军拜安 %d/1 \r海怪将军隆奈狄斯 %d/1',1009,1010},
		   [18]={_t'六兽妖伊奥 %d/1',1011},
		   [19]={_t'海皇子克修拉 %d/1',1012},
		   [20]={_t'六兽妖伊奥 %d/1 \r海皇子克修拉 %d/1',1011,1012},
		   [21]={_t'天猛星拉达曼提斯 %d/1',1013},
		   [22]={_t'海斗士加隆 %d/1',1014},
		   [23]={_t'海皇波塞冬 %d/1',1015},
		   [24]={_t'海斗士加隆 %d/1 \r海皇波塞冬 %d/1',1014,1015},
    	}
DialogRaidHint[419] = --Q版保卫纱织
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[8]={_t'保护女神，杀死女神的敌人：\r海皇波塞冬 %d/1 \r海斗士 %d/32 \r小心大炮',2000,2004},
			[9]={_t'保护女神，杀死女神的敌人：\r冥王哈迪斯 %d/1 \r冥斗士 %d/15',2001,2003},
			[10]={_t'发生了什么？教皇好像背叛了女神'},
			[11]={_t'追上背叛了女神的教皇\r圣斗士士兵 %d/10',2005},
			[12]={_t'继续追击教皇（教皇已到达看台）\r圣斗士士兵 %d/8',2006},
			[13]={_t'继续追击教皇（教皇已离开看台）\r圣斗士士兵 %d/10',2007},
			[14]={_t'（教皇已到达大厅中央）\r击败教皇 %d/1',2009},
    	}
DialogRaidHint[421] = --潘多拉魔盒小副本1
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'副本目标：',
			[0]={_t'这里是小偷怪巢穴吗'},
			[1]={_t'在120秒内尽可能多的抓住小偷： \r^e12500剩余时间：%d 秒^N ',103},
    		[2]={_t'抓住大盗基得'},
			[3]={_t'从灵魂娃娃那里离开魔盒次元空间'},
    	}
DialogRaidHint[422] = --逆流！三环双鱼
        {
    	   CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    	   HintTitle = _t'战斗目标：',
           [0]={_t'等待战斗开始'},
	       [1]={_t'仙皇座白银圣斗士 %d/1',100},
    	   [2]={_t'冥斗士天魔星 %d/1',101},
    	}
DialogRaidHint[423] = --逆流！三环狮子
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'狮子考验者 %d/4 \r狮子召唤者 %d/2 \r狮子突击者 %d/34',100,103,101},
			[2]={_t'路障【石头】 %d/1',104},
    		[3]={_t'冥斗士天阴星 %d/1',102},
			[4]={_t'冥斗士天阴星 %d/1 \r在120秒内拯救尽量多的学员： \r^e12500剩余时间：%d 秒^N \r还剩余学员：%d',102,5616,5615},
    	}
DialogRaidHint[424] = --逆流！三环天秤
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
    		[1]={_t'天贵星投影 %d/1',15},
    		[2]={_t'天猛星投影 %d/1',20},
			[3]={_t'冥斗士地暴星 %d/1',21},
    	}
DialogRaidHint[425] = --逆流！保卫钟楼
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[1]={_t'保卫圣域，消灭冲向圣域的敌人！ \r不要让进入圣域的敌人达到10个。 \r已有 %d个敌人进入圣域 \r正在防御第 %d/5波敌人 \r击杀敌人 %d/%d',102,101,106,107},
    		[2]={_t'消灭冥斗士天角星洛克 %d/1',103},
			[3]={_t'前往雅典娜神像，消灭沿途的敌人'},
    		[4]={_t'保卫雅典娜神像！ \r正在防御第 %d/8波敌人 \r击杀敌人 %d/%d',104,106,107},
			[5]={_t'消灭冥斗士天暗星 %d/1',105},
            [6]={_t'保卫雅典娜神像！ \r下一波敌人在 %d秒后到来',108},
			[7]={_t'在120秒内杀死尽量多的敌人： \r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1004,1003},
    	}
DialogRaidHint[426] = --逆流！亚特兰蒂斯
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'找到游轮上的水手'},
			[1]={_t'海斗士勇士 %d/9 \r海马 %d/1',1030,1002},
    		[2]={_t'潮汐蟹 %d/20',1033},
			[3]={_t'海怪 %d/1',1006},
			[4]={_t'黑暗鲸鱼座梅德赛斯 %d/1',1008},
			[5]={_t'水母 %d/20 \r潮汐巫师 %d/2',1037,1038},
			[6]={_t'在180秒内杀死尽量多的敌人：\r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1051,1042},
			[7]={_t'海斗士士兵 %d/15',1044},
			[8]={_t'六兽妖 %d/1',1023},
    		[9]={_t'前往海龙祭坛'},
			[10]={_t'冥斗士天异星 %d/1',1024},
			[11]={_t'继续前进'},
			[12]={_t'消灭潮水般涌来的怪物'},
			[13]={_t'跟随狄蒂丝，探究海底的秘密'},
			[14]={_t'释放魔鬼鱼灵魂'},
			[15]={_t'释放海魔女灵魂 \r最终杀敌数：%d',1042},
			[16]={_t'释放海皇子灵魂'},
			[17]={_t'海斗士精英 %d/6 \r海马 %d/1',1031,1002},
			[18]={_t'潮汐术士 %d/2 \r海马 %d/1',1032,1002},
			[19]={_t'潮汐蟹 %d/40',1033},
			[20]={_t'海斗士杀手 %d/6 \r黑暗飞鱼座爱莉丝 %d/1',1034,1004},
			[21]={_t'黑暗斗士勇士 %d/9 \r黑暗飞鱼座爱莉丝 %d/1',1035,1004},
			[22]={_t'复活的斗士精英 %d/10 \r黑暗飞鱼座爱莉丝 %d/1',1036,1004},
			[23]={_t'水母 %d/15 \r黑暗斗士队长 %d/1',1037,1039},
			[24]={_t'潮汐巫师 %d/2 \r黑暗斗士队长 %d/1',1038,1039},
			[25]={_t'在180秒内杀死尽量多的敌人： \r^e12500剩余时间：%d 秒^N \r已杀死敌人：%d',1051,1042},
			[26]={_t'海斗士士兵 %d/30',1044},
			[27]={_t'嗜血蝙蝠 %d/15 \r黑暗斗士头目 %d/3',1046,1045},
			[28]={_t'黑暗斗士精英 %d/7 \r黑暗斗士头目 %d/1',1047,1045},
			[29]={_t'复活的斗士勇士 %d/6 \r塞壬女妖 %d/6',1048,1049},
			[30]={_t'找出真正的冥界之锤\r被蓝光覆盖的人可以开启真假冥界之锤'},
			[31]={_t'继续前进，小心路上的滚石\r到达高台后，杀死全部巨石召唤者'},
			[32]={_t'继续前进，小心路上的刺柱机关和怪物'},
			[33]={_t'继续前进，小心路边海蛇的冰冻攻击'},
			[34]={_t'狄蒂丝再次出现，上前与狄蒂丝对话\r（建议等队友都到了再去找她）'},
    	}
		
DialogRaidHint[335] = --仲夏节初级副本60-
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待雅典娜沉思完毕，与雅典娜交谈以开始祈福 \r推荐实力较弱的玩家穿上处女座黄金圣衣 \r%d秒',109},
			[1]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
    		[2]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[3]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
    		[4]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[5]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[6]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[7]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[8]={_t'你保卫了女神！愿上天祝福你！'},
			[9]={_t'很遗憾，没有及时为纱织充满能量，现在全力击败梦神的灵体吧 \r梦神灵体 %d/1',108},
    	}	
DialogRaidHint[336] = --仲夏节高级副本60+
        {
		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待雅典娜沉思完毕，与雅典娜交谈以开始祈福 \r推荐实力较弱的玩家穿上处女座黄金圣衣 \r%d秒',109},
			[1]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
    		[2]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[3]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
    		[4]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[5]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[6]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[7]={_t'通关目标：为雅典娜充满能量，使雅典娜的生命达到百分之百 \r \r只有被处女座圣衣祝福的人才能为雅典娜充能 \r \r触摸神之惩戒可以为雅典娜充能和击退敌人，发动后需要2分钟才能再次发动 \r消灭所有的冥界入侵者'},
			[8]={_t'你保卫了女神！愿上天祝福你！'},
			[9]={_t'很遗憾，没有及时为纱织充满能量，现在全力击败梦神的灵体吧 \r梦神灵体 %d/1',108},
    	}
DialogRaidHint[338] = --七夕节活动副本
        {
		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待春丽寻找到紫龙的位置后，与春丽交谈 \r%d秒',1},
			[1]={_t'阶段目标：触摸泰坦之锤变身为泰坦斗士，击碎冥界物资 \r \r将散落的木箱搬到光圈处搭成浮桥 \r只有未变身的人才能搬起箱子 \r浮桥完成度 %d/35 \r \r通过浮桥到达黄泉之井，击败天角星洛克。 \r战斗已开始%d秒 \r小心地刺',3,7},
    		[2]={_t'通关目标：与紫龙一起击败天角星洛克！'},
			[3]={_t'很遗憾，没有及时搭好浮桥，现在全力击败天角星洛克吧！'},
    		[4]={_t'你帮助春丽救了紫龙！愿天下有情人终成眷属！'},
    	}			
DialogRaidHint[206] = --装备副本：十风穴
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
            [0] = {_t'击败凤凰座圣斗士一辉 %d/1', 3},
    	}
DialogRaidHint[216] = --装备副本：英雄十风穴
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
            [0] = {_t'击败黑暗天马 %d/1 \r（队长与黑暗天马对话，选择挑战难度）', 100},
            [1] = {_t'击败黑暗天马 %d/1 \r（队长与黑暗天马对话，选择挑战难度）\r ^FFCC00黑暗天马进入狂暴状态，重置倒计时：^N\r ^FF0000 %d 秒 ^N', 100, 101},
            [2] = {_t'击败黑暗白鸟 %d/1 \r（队长与黑暗白鸟对话，选择挑战难度）', 102},
            [3] = {_t'击败黑暗白鸟 %d/1 \r（队长与黑暗白鸟对话，选择挑战难度）\r ^FFCC00黑暗白鸟进入狂暴状态，重置倒计时：^N\r ^FF0000 %d 秒 ^N', 102, 103},
            [4] = {_t'击败黑暗天龙 %d/1 \r（队长与黑暗天龙对话，选择挑战难度）', 104},
            [5] = {_t'击败黑暗天龙 %d/1 \r（队长与黑暗天龙对话，选择挑战难度）\r ^FFCC00黑暗天龙进入狂暴状态，重置倒计时：^N\r ^FF0000 %d 秒 ^N', 104, 105},
            [6] = {_t'击败凤凰座圣斗士一辉 %d/1 \r（队长与一辉对话，选择挑战难度）', 106},
            [7] = {_t'击败凤凰座圣斗士一辉 %d/1 \r（队长与一辉对话，选择挑战难度）\r ^FFCC00一辉进入狂暴状态，重置倒计时：^N\r ^FF0000 %d 秒 ^N', 106, 107},
            [8] = {_t'副本通关'},
    	}
DialogRaidHint[207] = --装备副本：射手之心
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
            [0] = {_t'等待战斗开始'},
			[1] = {_t'保护射手座艾欧罗斯，消灭敌人！'},
			[2] = {_t'消灭半人马座巴比伦 %d/1',101},
			[3] = {_t'消灭天箭座魔矢 %d/1',102},
			[4] = {_t'逃跑，不要让修罗追到'},
			[5] = {_t'消灭白鲸座摩西斯 %d/1',103},
			[6] = {_t'消灭黄金圣斗士摩羯座修罗 %d/1',104},
            [7] = {_t'消灭山谷内的圣域伏击卫兵 %d/5',105},
            [8] = {_t'为艾欧罗斯清除前进道路上的敌人'},
            [9] = {_t'山洞中有埋伏，快速通过山洞'},
            [10]= {_t'^FF0000护送艾欧罗斯逃离失败。^N \r^FF0000可以在天箭座平台与艾欧罗斯对话，重新开始护送过程^N'},
    	}
DialogRaidHint[217] = --装备副本：射手之心
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
            [0] = {_t'等待战斗开始'},
			[1] = {_t'保护射手座艾欧罗斯，消灭敌人！'},
			[2] = {_t'消灭半人马座巴比伦 %d/1\r（队长与巴比伦对话，选择挑战难度）',101},
			[3] = {_t'消灭天箭座魔矢 %d/1\r（队长与魔矢对话，选择挑战难度）',102},
			[4] = {_t'护送艾欧罗斯逃离 \r不要让修罗追到'},
			[5] = {_t'消灭白鲸座摩西斯 %d/1\r（队长与摩西斯对话，选择挑战难度）',103},
			[6] = {_t'消灭黄金圣斗士摩羯座修罗 %d/1\r（队长与修罗对话，选择挑战难度）',104},
            [7] = {_t'消灭山谷内的圣域伏击卫兵 %d/5',105},
            [8] = {_t'为艾欧罗斯清除前进道路上的敌人'},
            [9] = {_t'山洞中有埋伏，快速通过山洞'},
            [10]= {_t'^FF0000护送艾欧罗斯逃离失败。^N \r^FF0000可以在天箭座平台与艾欧罗斯对话，重新开始护送过程^N'},
			[11] = {_t'消灭半人马座巴比伦 %d/1\r（队长与巴比伦对话，选择挑战难度）\r^FFCC00巴比伦进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',101,110},
			[12] = {_t'消灭天箭座魔矢 %d/1\r（队长与魔矢对话，选择挑战难度）\r^FFCC00魔矢进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',102,110},
			[13] = {_t'消灭白鲸座摩西斯 %d/1\r（队长与摩西斯对话，选择挑战难度）\r^FFCC00摩西斯进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',103,110},
			[14] = {_t'消灭黄金圣斗士摩羯座修罗 %d/1\r（队长与修罗对话，选择挑战难度）\r^FFCC00修罗进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',104,110},
            
    	}
DialogRaidHint[208] = --黄金十二宫 01-03
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'等待战斗开始'},
			[10]={_t'前往白羊宫'},
            [11]={_t'与白羊宫前的穆先生谈一谈'},
            [12]={_t'在嘉米尔幻境收集银星砂 %d/100', 200},
            [13]={_t'回到白羊宫与穆先生谈一谈'},
            [14]={_t'在白羊宫内击败穆先生 %d/1', 201},
            [21]={_t'赶往金牛宫'},
			[22]={_t'打败阿鲁迪巴 %d/1 \r帮助星矢小宇宙充能 %d/10',4,1},
    		[23]={_t'距离泰坦新星发动时间： \r倒计时：%d 秒 \r打败阿鲁迪巴 %d/1',2,4},
            [30]={_t'赶往双子宫'},
            [31]={_t'打败双子宫的守护者 %d/1',301},
            [32]={_t'打败次元空间的守护 %d/4',302},

    	}
DialogRaidHint[209] = --冰海神殿
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'阶段提示：',
			[0]={_t'深入冰海神殿'},
			[1]={_t'进入 ^FFCC00黄色^N 传送门\r 击败摇光星米伊美 %d/1 \r 极光的颜色：^FFCC00黄^N', 101},
			[2]={_t'解除海皇封印 %d/1 \r 清除路上的珊瑚屏障 \r 极光的颜色：^FFCC00黄^N', 102},
			[3]={_t'进入 ^00CC00绿色^N 传送门 \r 击败天枢星齐格弗里德 %d/1 \r 极光的颜色：^00CC00绿^N', 103},
			[4]={_t'进入 ^00CCCC青色^N 传送门 \r 解除海皇封印 %d/5 \r 极光的颜色：^00CC00绿^N^00CCCC青^N', 104},
			[5]={_t'进入 ^0066FF蓝色^N 传送门 \r 击破苏兰特的幻象 %d/3 \r 极光的颜色：^00CC00绿^N^0066FF蓝^N', 105},
			[6]={_t'击败大乌贼法夫纳 %d/1 \r 极光的颜色：^00CC00绿^N^0066FF蓝^N', 106},
			[7]={_t'进入 ^9900FF紫色^N 传送门 \r 击败女武神瓦尔基里 %d/1 \r 极光的颜色：^FFCC00黄^N^9900FF紫^N', 107},
			[8]={_t'副本通关'},
        }
DialogRaidHint[210] = --装备副本：七大洋巨柱
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
            [0] = {_t'等待战斗开始'},
			[1] = {_t'前往北冰洋  \r消灭海斗士魔鬼鱼 艾尔扎克 %d/1',101},
			[2] = {_t'前往北太平洋之柱  \r消灭海斗士海马 拜安 %d/1',102},
			[3] = {_t'前往南太平洋之柱  \r消灭海斗士六兽妖 伊奥 %d/1',103},
			[4] = {_t'前往印度洋之柱  \r消灭海斗士海皇子 克修拉 %d/1',104},
			[5] = {_t'前往南冰洋之柱  \r消灭海斗士海怪 卡萨 %d/1',105},
			[6] = {_t'前往南大西洋之柱  \r消灭海斗士海魔女 苏兰特 %d/1',106},
            [7] = {_t'前往北大西洋之柱  \r消灭海斗士海龙 加隆 %d/1',107},
            [8] = {_t'前往海皇神殿  \r消灭海皇 波塞冬 %d/1',108},
            [9] = {_t'前往生命之柱  \r消灭海皇 波塞冬 %d/1',108},
    	}
DialogRaidHint[211] = --黄金十二宫 04-06
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
            [0] = {_t'前往巨蟹宫'},
			[1] = {_t'前往巨蟹宫'},
			[2] = {_t'打败巨蟹座黄金圣斗士 迪斯马斯克 %d/1',101},
			[3] = {_t'前往狮子宫'},
			[4] = {_t'打败狮子座黄金圣斗士 艾欧里亚 %d/1\r艾欧里亚已经失去理智，他的^FFCC00等离子光速拳^N可以击毁^FFCC00石柱^N，石柱的毁坏可以使他承受的伤害增加',102},
			[5] = {_t'前往处女宫'},
            [6] = {_t'击败左右护法 %d/2', 200},
            [7] = {_t'开启莲花石门'},
			[8] = {_t'打败处女座黄金圣斗士 沙加 %d/1',103},
            [9] = {_t'副本通关'},
    	}
DialogRaidHint[212] = --黄金十二宫 07-09
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0]={_t'等待战斗开始'},
            [1]={_t'前往天秤宫'},
            [2]={_t'与瞬交谈'},
            [3]={_t'救出冰河 %d/1 \r在%d/180秒内打碎冰棺',51,50},
            [4]={_t'前往天蝎宫'},
            [5]={_t'打败天蝎座黄金圣斗士 米罗 %d/1', 200},
            [6]={_t'前往射手宫'},
            [7]={_t'击败射手宫的四英灵 %d/4',300},
        }
DialogRaidHint[215] = --黄金十二宫 10-12
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0]={_t'前往摩羯宫'},
            [1]={_t'前往摩羯宫'},
            [2]={_t'突破摩羯宫'},
            [3]={_t'打败摩羯座黄金圣斗士 修罗 %d/1',100},
            [4]={_t'前往水瓶宫'},
            [5]={_t'穿越暴风雪的封锁'},
            [6]={_t'打败水瓶座黄金圣斗士 卡妙 %d/1',200},
            [7]={_t'前往双鱼宫'},
            [8]={_t'闯过双鱼宫机关'},
            [9]={_t'打败双鱼座黄金圣斗士 阿布罗狄 %d/1\r要小心阿布罗狄的^FFCC00血腥玫瑰^N，当白玫瑰因吸血而变成红玫瑰时，死亡的力量会让阿布罗狄更加强大',401},
        }
DialogRaidHint[213] = --女神的挽歌前
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0]={_t'前往白羊宫'},
            [1]={_t'击败前代白羊座 史昂 %d/1\r （队长与史昂对话，选择挑战难度）', 105},
            [2]={_t'前往金牛宫'},
            [3]={_t'与金牛座 阿鲁迪巴 对话'},
            [4]={_t'击败地暗星 尼奥比 %d/1\r （队长与尼奥比对话，选择挑战难度）', 107},
            [5]={_t'前往双子宫'},
            [6]={_t'与双子座圣斗士对话, 进入异次元空间'},
            [7]={_t'进入异次元空间，与修罗对话'},
            [8]={_t'接受射手座的考验，前往下一个次元空间'},
            [9]={_t'前往下一个次元空间，与卡妙对话'},
            [10]={_t'打破封印冰河的冰棺'},
            [11]={_t'与冰河对话，前往下一个次元'},
            [12]={_t'前往下一个次元空间，与撒加对话'},
            [13]={_t'进入记忆迷宫，击败双子暗影\r 拾取^66ccff记忆碎片·因^N %d/1\r 拾取^66ccff记忆碎片·果^N %d/1', 103, 104},
            [14]={_t'用两片记忆碎片合成^cc66ff双子之钥^N\r 打开囚禁加隆的铁牢 %d/1', 102},
            [15]={_t'与加隆对话，回到双子宫'},
            [16]={_t'前往巨蟹宫'},
            [17]={_t'击败地妖星 缪 %d/1\r （队长与缪对话，选择挑战难度）', 109},
            [18]={_t'副本通关'},
            [19]={_t'击败前代白羊座 史昂 %d/1\r （队长与史昂对话，选择挑战难度）\r^FFCC00史昂进入狂暴状态，战斗重置倒计时：^N \r^FF0000%d秒^N', 105, 106},
            [20]={_t'击败地暗星 尼奥比 %d/1\r （队长与尼奥比对话，选择挑战难度）\r^FFCC00尼奥比进入狂暴状态，战斗重置倒计时：^N \r^FF0000%d秒^N', 107, 108},
            [21]={_t'击败地妖星 缪 %d/1\r （队长与缪对话，选择挑战难度）\r^FFCC00缪进入狂暴状态，战斗重置倒计时：^N \r^FF0000%d秒^N', 109, 110},
        }
DialogRaidHint[214] = --女神的挽歌后
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0]={_t'前往狮子宫'},
            [1]={_t'解除陷阱 %d/6 \r 找出地伏星莱米的本体', 101},
            [2]={_t'击败地伏星 莱米 %d/1 \r (队长与莱米对话，选择挑战难度)', 102},
            [3]={_t'击败地伏星 莱米 %d/1 \r (队长与莱米对话，选择挑战难度) \r ^FFCC00莱米进入狂暴状态，战斗重置倒计时：^N \r^FF0000 %d秒^N', 102, 103},
            [4]={_t'前往处女宫'},
            [5]={_t'击败地暴星 古加多 %d/1 \r (队长与古加多对话，选择挑战难度)', 104},
            [6]={_t'击败地暴星 古加多 %d/1 \r (队长与古加多对话，选择挑战难度) \r ^FFCC00古加多进入狂暴状态，战斗重置倒计时：^N \r^FF0000 %d秒^N', 104, 105},
            [7]={_t'进入处女宫，清除幽冥暗影魔 %d/8', 106},
            [8]={_t'进入沙罗双树园'},
            [9]={_t'击败复生的黄金圣斗士 三位一体 %d/1 \r (队长与撒加对话，选择挑战难度)', 107},
            [10]={_t'击败复生的黄金圣斗士 三位一体 %d/1 \r (队长与撒加对话，选择挑战难度) \r ^FFCC00三位一体进入狂暴状态，战斗重置倒计时：^N \r^FF0000 %d秒^N', 107, 108},
            [11]={_t'通过传送前往女神殿，了解事情的真相'},
            [12]={_t'副本通关'},
        }
DialogRaidHint[218] =   --蓝冰堡
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0] = {_t'等待战斗开始'},
			[1] = {_t'消灭天璇星战马哈根 %d/1\r（队长与哈根对话，选择挑战难度）',101},
			[2] = {_t'消灭玉衡星北极狼菲利路 %d/1\r（队长与菲利路对话，选择挑战难度）',102},
			[3] = {_t'消灭天权星水晶魔剑阿鲁贝利西 %d/1\r（队长与阿鲁贝利西对话，选择挑战难度）',103},
			[4] = {_t'消灭开阳星剑齿虎希度 %d/1\r消灭辅星剑齿虎巴度 %d/1\r（队长与希度对话，选择挑战难度）',104,105},
			[5] = {_t'前往蓝冰堡西部，寻找北极狼菲利路'},
            [6] = {_t'抵挡冰斗士与狼群的攻击，直到北极狼菲利路出现。'},
            [11] = {_t'消灭天璇星战马哈根 %d/1\r（队长与哈根对话，选择挑战难度）\r^FFCC00哈根进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',101,110},
			[12] = {_t'消灭玉衡星北极狼菲利路 %d/1\r（队长与菲利路对话，选择挑战难度）\r^FFCC00菲利路进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',102,110},
			[13] = {_t'消灭天权星水晶魔剑阿鲁贝利西 %d/1\r（队长与阿鲁贝利西对话，选择挑战难度）\r^FFCC00阿鲁贝利西进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',103,110},
			[14] = {_t'消灭开阳星剑齿虎希度 %d/1\r消灭辅星剑齿虎巴度 %d/1\r（队长与希度对话，选择挑战难度）\r^FFCC00剑齿虎兄弟进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',104,110},
        }
DialogRaidHint[219] =   --哈迪斯城
        {
            CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
            HintTitle = _t'战斗目标：',
            [0] = {_t'等待战斗开始'},
			[1] = {_t'消灭天魔星妖花 奎因 %d/1\r（队长与奎因对话，选择挑战难度）',101},
			[2] = {_t'消灭天哭星鸟妖 巴连达因 %d/1\r（队长与巴连达因对话，选择挑战难度）',102},
			[3] = {_t'消灭地奇星青蛙 赛洛斯 %d/1\r（队长与赛洛斯对话，选择挑战难度）',103},
			[4] = {_t'消灭天猛星 拉达曼迪斯 %d/1\r（队长与拉达曼迪斯对话，选择挑战难度）',104},
            [11] = {_t'消灭天魔星妖花 奎因 %d/1\r（队长与奎因对话，选择挑战难度）\r^FFCC00哈根进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',101,110},
			[12] = {_t'消灭天哭星鸟妖 巴连达因 %d/1\r（队长与巴连达因对话，选择挑战难度）\r^FFCC00菲利路进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',102,110},
			[13] = {_t'消灭地奇星青蛙 赛洛斯 %d/1\r（队长与赛洛斯对话，选择挑战难度）\r^FFCC00阿鲁贝利西进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',103,110},
			[14] = {_t'消灭天猛星 拉达曼迪斯 %d/1\r（队长与拉达曼迪斯对话，选择挑战难度）\r^FFCC00剑齿虎兄弟进入狂暴状态，战斗重置倒计时:^N \r^FF0000%d秒^N',104,110},
        }
DialogRaidHint[51] = --军团升级活动
        {
    		CurArgs = 'repu_20',  --表示为第几张星图
    		HintTitle = _t'战斗目标：',
    		[11]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/5 \r获得水象星魂 %d/80 \r获得火象星魂 %d/140',"repu_21","repu_22","repu_23","repu_24"},
			[12]={_t'获得风象星魂 %d/5 \r获得土象星魂 %d/10 \r获得水象星魂 %d/140 \r获得火象星魂 %d/80',"repu_21","repu_22","repu_23","repu_24"},
			[13]={_t'获得风象星魂 %d/60 \r获得土象星魂 %d/25 \r获得水象星魂 %d/60 \r获得火象星魂 %d/20',"repu_21","repu_22","repu_23","repu_24"},
			[14]={_t'获得风象星魂 %d/25 \r获得土象星魂 %d/60 \r获得水象星魂 %d/20 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[21]={_t'获得风象星魂 %d/20 \r获得土象星魂 %d/10 \r获得水象星魂 %d/160 \r获得火象星魂 %d/280',"repu_21","repu_22","repu_23","repu_24"},
			[22]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/20 \r获得水象星魂 %d/280 \r获得火象星魂 %d/160',"repu_21","repu_22","repu_23","repu_24"},
			[23]={_t'获得风象星魂 %d/120 \r获得土象星魂 %d/50 \r获得水象星魂 %d/120 \r获得火象星魂 %d/40',"repu_21","repu_22","repu_23","repu_24"},
			[24]={_t'获得风象星魂 %d/50 \r获得土象星魂 %d/120 \r获得水象星魂 %d/40 \r获得火象星魂 %d/120',"repu_21","repu_22","repu_23","repu_24"},
			[31]={_t'获得风象星魂 %d/30 \r获得土象星魂 %d/15 \r获得水象星魂 %d/240 \r获得火象星魂 %d/420',"repu_21","repu_22","repu_23","repu_24"},
			[32]={_t'获得风象星魂 %d/15 \r获得土象星魂 %d/30 \r获得水象星魂 %d/420 \r获得火象星魂 %d/240',"repu_21","repu_22","repu_23","repu_24"},
			[33]={_t'获得风象星魂 %d/180 \r获得土象星魂 %d/75 \r获得水象星魂 %d/180 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[34]={_t'获得风象星魂 %d/75 \r获得土象星魂 %d/180 \r获得水象星魂 %d/60 \r获得火象星魂 %d/180',"repu_21","repu_22","repu_23","repu_24"},
    	}
DialogRaidHint[52] = --军团升级活动
        {
    		CurArgs = 'repu_20',  --表示为第几张星图
    		HintTitle = _t'战斗目标：',
    		[11]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/5 \r获得水象星魂 %d/80 \r获得火象星魂 %d/140',"repu_21","repu_22","repu_23","repu_24"},
			[12]={_t'获得风象星魂 %d/5 \r获得土象星魂 %d/10 \r获得水象星魂 %d/140 \r获得火象星魂 %d/80',"repu_21","repu_22","repu_23","repu_24"},
			[13]={_t'获得风象星魂 %d/60 \r获得土象星魂 %d/25 \r获得水象星魂 %d/60 \r获得火象星魂 %d/20',"repu_21","repu_22","repu_23","repu_24"},
			[14]={_t'获得风象星魂 %d/25 \r获得土象星魂 %d/60 \r获得水象星魂 %d/20 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[21]={_t'获得风象星魂 %d/20 \r获得土象星魂 %d/10 \r获得水象星魂 %d/160 \r获得火象星魂 %d/280',"repu_21","repu_22","repu_23","repu_24"},
			[22]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/20 \r获得水象星魂 %d/280 \r获得火象星魂 %d/160',"repu_21","repu_22","repu_23","repu_24"},
			[23]={_t'获得风象星魂 %d/120 \r获得土象星魂 %d/50 \r获得水象星魂 %d/120 \r获得火象星魂 %d/40',"repu_21","repu_22","repu_23","repu_24"},
			[24]={_t'获得风象星魂 %d/50 \r获得土象星魂 %d/120 \r获得水象星魂 %d/40 \r获得火象星魂 %d/120',"repu_21","repu_22","repu_23","repu_24"},
			[31]={_t'获得风象星魂 %d/30 \r获得土象星魂 %d/15 \r获得水象星魂 %d/240 \r获得火象星魂 %d/420',"repu_21","repu_22","repu_23","repu_24"},
			[32]={_t'获得风象星魂 %d/15 \r获得土象星魂 %d/30 \r获得水象星魂 %d/420 \r获得火象星魂 %d/240',"repu_21","repu_22","repu_23","repu_24"},
			[33]={_t'获得风象星魂 %d/180 \r获得土象星魂 %d/75 \r获得水象星魂 %d/180 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[34]={_t'获得风象星魂 %d/75 \r获得土象星魂 %d/180 \r获得水象星魂 %d/60 \r获得火象星魂 %d/180',"repu_21","repu_22","repu_23","repu_24"},
    	}
DialogRaidHint[53] = --军团升级活动
        {
    		CurArgs = 'repu_20',  --表示为第几张星图
    		HintTitle = _t'战斗目标：',
    		[11]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/5 \r获得水象星魂 %d/80 \r获得火象星魂 %d/140',"repu_21","repu_22","repu_23","repu_24"},
			[12]={_t'获得风象星魂 %d/5 \r获得土象星魂 %d/10 \r获得水象星魂 %d/140 \r获得火象星魂 %d/80',"repu_21","repu_22","repu_23","repu_24"},
			[13]={_t'获得风象星魂 %d/60 \r获得土象星魂 %d/25 \r获得水象星魂 %d/60 \r获得火象星魂 %d/20',"repu_21","repu_22","repu_23","repu_24"},
			[14]={_t'获得风象星魂 %d/25 \r获得土象星魂 %d/60 \r获得水象星魂 %d/20 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[21]={_t'获得风象星魂 %d/20 \r获得土象星魂 %d/10 \r获得水象星魂 %d/160 \r获得火象星魂 %d/280',"repu_21","repu_22","repu_23","repu_24"},
			[22]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/20 \r获得水象星魂 %d/280 \r获得火象星魂 %d/160',"repu_21","repu_22","repu_23","repu_24"},
			[23]={_t'获得风象星魂 %d/120 \r获得土象星魂 %d/50 \r获得水象星魂 %d/120 \r获得火象星魂 %d/40',"repu_21","repu_22","repu_23","repu_24"},
			[24]={_t'获得风象星魂 %d/50 \r获得土象星魂 %d/120 \r获得水象星魂 %d/40 \r获得火象星魂 %d/120',"repu_21","repu_22","repu_23","repu_24"},
			[31]={_t'获得风象星魂 %d/30 \r获得土象星魂 %d/15 \r获得水象星魂 %d/240 \r获得火象星魂 %d/420',"repu_21","repu_22","repu_23","repu_24"},
			[32]={_t'获得风象星魂 %d/15 \r获得土象星魂 %d/30 \r获得水象星魂 %d/420 \r获得火象星魂 %d/240',"repu_21","repu_22","repu_23","repu_24"},
			[33]={_t'获得风象星魂 %d/180 \r获得土象星魂 %d/75 \r获得水象星魂 %d/180 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[34]={_t'获得风象星魂 %d/75 \r获得土象星魂 %d/180 \r获得水象星魂 %d/60 \r获得火象星魂 %d/180',"repu_21","repu_22","repu_23","repu_24"},
    	}
DialogRaidHint[54] = --军团升级活动
        {
    		CurArgs = 'repu_20',  --表示为第几张星图
    		HintTitle = _t'战斗目标：',
    		[11]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/5 \r获得水象星魂 %d/80 \r获得火象星魂 %d/140',"repu_21","repu_22","repu_23","repu_24"},
			[12]={_t'获得风象星魂 %d/5 \r获得土象星魂 %d/10 \r获得水象星魂 %d/140 \r获得火象星魂 %d/80',"repu_21","repu_22","repu_23","repu_24"},
			[13]={_t'获得风象星魂 %d/60 \r获得土象星魂 %d/25 \r获得水象星魂 %d/60 \r获得火象星魂 %d/20',"repu_21","repu_22","repu_23","repu_24"},
			[14]={_t'获得风象星魂 %d/25 \r获得土象星魂 %d/60 \r获得水象星魂 %d/20 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[21]={_t'获得风象星魂 %d/20 \r获得土象星魂 %d/10 \r获得水象星魂 %d/160 \r获得火象星魂 %d/280',"repu_21","repu_22","repu_23","repu_24"},
			[22]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/20 \r获得水象星魂 %d/280 \r获得火象星魂 %d/160',"repu_21","repu_22","repu_23","repu_24"},
			[23]={_t'获得风象星魂 %d/120 \r获得土象星魂 %d/50 \r获得水象星魂 %d/120 \r获得火象星魂 %d/40',"repu_21","repu_22","repu_23","repu_24"},
			[24]={_t'获得风象星魂 %d/50 \r获得土象星魂 %d/120 \r获得水象星魂 %d/40 \r获得火象星魂 %d/120',"repu_21","repu_22","repu_23","repu_24"},
			[31]={_t'获得风象星魂 %d/30 \r获得土象星魂 %d/15 \r获得水象星魂 %d/240 \r获得火象星魂 %d/420',"repu_21","repu_22","repu_23","repu_24"},
			[32]={_t'获得风象星魂 %d/15 \r获得土象星魂 %d/30 \r获得水象星魂 %d/420 \r获得火象星魂 %d/240',"repu_21","repu_22","repu_23","repu_24"},
			[33]={_t'获得风象星魂 %d/180 \r获得土象星魂 %d/75 \r获得水象星魂 %d/180 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[34]={_t'获得风象星魂 %d/75 \r获得土象星魂 %d/180 \r获得水象星魂 %d/60 \r获得火象星魂 %d/180',"repu_21","repu_22","repu_23","repu_24"},
    	}
DialogRaidHint[55] = --军团升级活动
        {
    		CurArgs = 'repu_20',  --表示为第几张星图
    		HintTitle = _t'战斗目标：',
    		[11]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/5 \r获得水象星魂 %d/80 \r获得火象星魂 %d/140',"repu_21","repu_22","repu_23","repu_24"},
			[12]={_t'获得风象星魂 %d/5 \r获得土象星魂 %d/10 \r获得水象星魂 %d/140 \r获得火象星魂 %d/80',"repu_21","repu_22","repu_23","repu_24"},
			[13]={_t'获得风象星魂 %d/60 \r获得土象星魂 %d/25 \r获得水象星魂 %d/60 \r获得火象星魂 %d/20',"repu_21","repu_22","repu_23","repu_24"},
			[14]={_t'获得风象星魂 %d/25 \r获得土象星魂 %d/60 \r获得水象星魂 %d/20 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[21]={_t'获得风象星魂 %d/20 \r获得土象星魂 %d/10 \r获得水象星魂 %d/160 \r获得火象星魂 %d/280',"repu_21","repu_22","repu_23","repu_24"},
			[22]={_t'获得风象星魂 %d/10 \r获得土象星魂 %d/20 \r获得水象星魂 %d/280 \r获得火象星魂 %d/160',"repu_21","repu_22","repu_23","repu_24"},
			[23]={_t'获得风象星魂 %d/120 \r获得土象星魂 %d/50 \r获得水象星魂 %d/120 \r获得火象星魂 %d/40',"repu_21","repu_22","repu_23","repu_24"},
			[24]={_t'获得风象星魂 %d/50 \r获得土象星魂 %d/120 \r获得水象星魂 %d/40 \r获得火象星魂 %d/120',"repu_21","repu_22","repu_23","repu_24"},
			[31]={_t'获得风象星魂 %d/30 \r获得土象星魂 %d/15 \r获得水象星魂 %d/240 \r获得火象星魂 %d/420',"repu_21","repu_22","repu_23","repu_24"},
			[32]={_t'获得风象星魂 %d/15 \r获得土象星魂 %d/30 \r获得水象星魂 %d/420 \r获得火象星魂 %d/240',"repu_21","repu_22","repu_23","repu_24"},
			[33]={_t'获得风象星魂 %d/180 \r获得土象星魂 %d/75 \r获得水象星魂 %d/180 \r获得火象星魂 %d/60',"repu_21","repu_22","repu_23","repu_24"},
			[34]={_t'获得风象星魂 %d/75 \r获得土象星魂 %d/180 \r获得水象星魂 %d/60 \r获得火象星魂 %d/180',"repu_21","repu_22","repu_23","repu_24"},
    	}
DialogRaidHint[339] = --[月度活动]觉醒！沙加的六道
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，请选择道业\r选择道业后，与沙加对话开启战斗'},
			[1]={_t'与对应的六道生物战斗  ^00ffff%d / 100^N\r^ffff00与自身相同的六道战斗才能获得计数^N\r^00ff00温馨提示：攻击非自身对应的六道可能会让自己的小伙伴无法获得修业^N\r与自己对应的六道战斗可以获得修业\r^ffff00个人^N获得 ^ffff0010^N 个修业解锁六道第^ffff00二^N技能\r^ffff00个人^N获得 ^ffff0020^N 个修业解锁六道第^ffff00三^N技能\r距离大批六道变种生物出现：^ff0000 %d ^N 秒',9,10},
            [2]={_t'与对应的六道生物战斗  ^00ffff%d / 100^N\r^ffff00与自身相同的六道战斗才能获得计数^N\r^00ff00温馨提示：攻击非自身对应的六道可能会让自己的小伙伴无法获得修业^N\r与自己对应的六道战斗可以获得修业\r^ffff00个人^N获得 ^ffff0010^N 个修业解锁六道第^ffff00二^N技能\r^ffff00个人^N获得 ^ffff0020^N 个修业进阶六道第^ffff00三^N技能\r^ff0000注意！大批六道变种生物出现在沙罗双树附近^N',9},
			[3]={_t'打败穿着冥衣的黄金圣斗士  撒加 %d/1',8},
			[4]={_t'副本通关'},
    	}
		
DialogRaidHint[340] = --[月度活动]圣战夜！童虎的记忆
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，与童虎对话开启战斗'},
			[1]={_t'帮助童虎清除阻碍的冥斗士\r击败 冥界杂兵  ^00ffff%d / 15^N\r',9},
			[2]={_t'跟随童虎\r击败 天猛星  ^00ffff%d / 1^N\r',1},
			[3]={_t'帮助童虎清除阻碍的冥斗士\r击败 冥界杂兵  ^00ffff%d / 20^N\r',10},
			[4]={_t'跟随童虎\r击败 天贵星  ^00ffff%d / 1^N\r',2},
			[5]={_t'帮助童虎清除阻碍的冥斗士\r击败 冥界杂兵  ^00ffff%d / 18^N\r',11},
			[6]={_t'跟随童虎\r击败 天雄星  ^00ffff%d / 1^N\r',3},
			[7]={_t'跟随童虎\r击败 冥王哈迪斯 ^00ffff%d / 1^N',4},
			[8]={_t'副本通关'},
    	}

DialogRaidHint[341] = --[月度活动]突破！天蝎的试炼
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，与米罗对话开启战斗'},
			[1]={_t'击败 猩红毒蝎  ^00ffff%d / 100^N\r^ffff00周围的极寒领域可以解除身上的蝎毒^N \r温馨提示：变成毒蝎后会持续对周围的^00ff00小伙伴^N造成^FF0000伤害^N，请及时解毒',1},
			[2]={_t'突破天蝎的试炼\r击败 米罗  ^00ffff%d / 1^N\r',3},
			[3]={_t'副本通关'},
    	}
		
DialogRaidHint[342] = --[月度活动]逼近！射手的危机
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，与艾欧罗斯对话开启战斗'},
			[1]={_t'收集 小宇宙能量  ^00ffff%d / 200^N\r注意躲避死神的攻击，收集金色的小宇宙能量球\r温馨提示：请合理使用技能^00ff00加速，星辰凝聚^N',1},
			[2]={_t'解除射手的危机\r击败 死神  ^00ffff%d / 1^N\r',3},
			[3]={_t'副本通关'},
    	}
		
DialogRaidHint[343] = --[圣诞节活动]大雪！保卫圣诞树
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'与圣诞老人对话开启战斗\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r雪精灵的等级比数量更重要'},
			[1]={_t'距离第^ffff001^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff0012^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[2]={_t'当前进度：第^ffff001 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[3]={_t'距离第^ffff002^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff0011^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[4]={_t'当前进度：第^ffff002 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[5]={_t'距离第^ffff003^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff0010^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[6]={_t'当前进度：第^ffff003 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[7]={_t'距离第^ffff004^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff009^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[8]={_t'当前进度：第^ffff004 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[9]={_t'距离第^ffff005^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff008^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[10]={_t'当前进度：第^ffff005 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[11]={_t'距离第^ffff006^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff007^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[12]={_t'当前进度：第^ffff006 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[13]={_t'距离第^ffff007^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff006^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[14]={_t'当前进度：第^ffff007 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[15]={_t'距离第^ffff008^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff005^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[16]={_t'当前进度：第^ffff008 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[17]={_t'距离第^ffff009^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff004^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[18]={_t'当前进度：第^ffff009 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[19]={_t'距离第^ffff0010^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff003^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[20]={_t'当前进度：第^ffff0010 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[21]={_t'距离第^ffff0011^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff002^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[22]={_t'当前进度：第^ffff0011 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[23]={_t'距离第^ffff0012^N波敌人出现还有 ^ffff00%d 秒^N\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r剩余^ffff001^N波敌人 \r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',2,4,5},
			[24]={_t'当前进度：第^ffff0012 ^N/ ^ffff0012^N波敌人 \r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N\r雪精灵共有3级，收集敌人掉落的光球，分别需要对其使用1、2、2次雪花技能才能升级\r^ffff00雪精灵的等级比数量更重要',4,5},
			[25]={_t'恭喜你！再一次打击了邪恶！\r击杀敌人/逃跑敌人 \r  ^ffff00%d ^N/ ^ff0000%d ^N'},
    	}
		
DialogRaidHint[344] = --[月度活动]摩羯！修罗的剑道
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，与修罗对话开启战斗'},
			[1]={_t'消灭 冥界士兵  ^00ffff%d / 270^N\r剩余圣剑： ^00ffff%d / 9^N\r温馨提示：在^00ff00圣剑^N或^00ff00修罗^N附近获得^00ff00【圣剑领域】^N后才能对冥界势力造成有效伤害',1,5},
			[2]={_t'击败 天哭星  ^00ffff%d / 1^N\r',3},
			[3]={_t'副本通关'},
    	}
    	
		
DialogRaidHint[345] = --[月度活动]摩羯！修罗的剑道
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，与卡妙对话开启战斗'},
			[1]={_t'采集 冰结晶  ^00ffff%d / 120^N\r剩余时间： ^00ffff%d秒 ^N\r温馨提示：通过^ffff00采集冰结晶^N或^ffff00击碎队友身上的冰块^N获得^ffff00【绝招的真谛】^N\r^ffff00注意^N躲避冰霜炸弹',1,8},
			[2]={_t'击败 卡妙  ^00ffff%d / 1^N\r',3},
			[3]={_t'卡妙的传承试炼完成了！'},
			[4]={_t'采集 冰结晶  ^00ffff%d / 120^N\r^00ff00没有在规定时间内收集足够冰结晶^N\r温馨提示：通过^ffff00采集冰结晶^N或^ffff00击碎队友身上的冰块^N获得^ffff00【绝招的真谛】^N\r^ffff00注意^N躲避冰霜炸弹',1},
    	}
		
DialogRaidHint[346] = --[月度活动]双鱼！玫瑰对魔花
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'战斗准备阶段，与双鱼宫守卫对话开启战斗'},
			[1]={_t'清除 受侵蚀的玫瑰  ^00ffff%d / 120^N\r剩余时间： ^00ffff%d秒 ^N\r注意：尽快消灭那些不断长大的^ffff00变异中的玫瑰^N，防止其变异成魔鬼花 \r一旦被变成冥蝶，尽快到白玫瑰附近解毒',2,5},
			[2]={_t'击败 天魔星 奎因  ^00ffff0 / 1'},
			[3]={_t'双鱼宫的危机解除了！'},
    	}
		
DialogRaidHint[347] = --[月度活动]白羊！师徒大作战
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'与贵鬼对话开启战斗'},
			[1]={_t'击败所有的 贵鬼 ^00ffff%d / 28^N\r剩余时间： ^00ffff%d秒 ^N\r注意：小心贵鬼扔在场地中的各种^ffff00机关^N\r穆会放水晶墙来干扰战斗',2,3},
			[2]={_t'击败 白羊座 穆  ^00ffff0 / 1'},
			[3]={_t'恭喜你通过穆的考验！'},
    	}

DialogRaidHint[348] = --[月度活动]双子！善恶对决
        {
    		CurArgs = 10000,  --表示副本提示进入第几阶段,1为第一阶段,依次类推
    		HintTitle = _t'战斗目标：',
			[0]={_t'与恶双子交谈开启战斗'},
			[1]={_t'击败 邪恶的士兵 ^00ffff%d / 100^N\r剩余时间： ^00ffff%d秒',3,5},
			[2]={_t'击败 恶双子'},
			[3]={_t'你们成功维护了双子心中的善念！'},
    	}