--[[ @i18n help ]]
local _t = require("i18n").context("help")
---界面指引的数据处理脚本，提示数据
module("guide_task", package.seeall)
_M[1]=
{
        id = 2108,
        level_low = 200,
        level_high = 200,
        name = _t"【圣衣星铸】",
        award = _t"经验、金券、道具",
        finish = _t"在圣衣的星铸界面对圣衣进行一次^00FF00星铸操作^FFFFFF\r奖励：100000 经验、20000 金券、${item(18771)}一枚！",
        desc = _t"您可以在【圣衣】->【星铸】界面进行相关操作，星铸需要道具星玉，不同圣衣所需的星玉不同！也可以查看百科${help(63)}了解更多信息",
}
_M[2]=
{
        id = 2106,
        level_low = 200,
        level_high = 200,
        name = _t"【女神的圣斗士】",
        award = _t"经验、装备",
        finish = _t"完成任意一个^00FF00女神的圣斗士^FFFFFF\r奖励：100000 经验、${item(3087)}1件！",
        desc = _t"您可以在${npc(9187)}处接取【女神的圣斗士】！也可以查看百科${help(55)}了解更多信息",
}
_M[3]=
{
        id = 2112,
        level_low = 200,
        level_high = 200,
        name = _t"【魔盒拆分】",
        award = _t"经验、金券、道具",
        finish = _t"在魔盒界面进行一次^00FF00拆分操作^FFFFFF\r奖励：50000 经验、10000 金券、${item(18771)}一枚！",
        desc = _t"您可以通过包裹界面的魔盒按钮激活魔盒界面进行拆分操作。也可以查看百科${help(67)}了解更多信息",
}
_M[4]=
{
        id = 2104,
        level_low = 200,
        level_high = 200,
        name = _t"【圣战回忆】",
        award = _t"经验、装备",
        finish = _t"完成一次不定时活动^00FF00【圣战回忆】^FFFFFF\r奖励：150000 经验、${item(3093)}1件！",
        desc = _t"圣战回忆每天最多完成2次，在${npc(13950)}处报名参加，请组队至少3人前往！也可以通过日程表的组队平台功能报名参加！查看百科${help(84)}了解更多信息",
}
_M[5]=
{
        id = 2100,
        level_low = 200,
        level_high = 200,
        name = _t"【集结！十二宫危机】",
        award = _t"经验、装备",
        finish = _t"完成一次定时活动^00FF00【集结！十二宫危机】^FFFFFF\r奖励：350000 经验、${item(3561)}1件！",
        desc = _t"该活动可以在${npc(13949)}处组队参加，每天只能参加一次！也可以通过日程表的组队平台功能报名参加！查看百科${help(78)}了解更多信息",
}
_M[6]=
{
        id = 2107,
        level_low = 200,
        level_high = 200,
        name = _t"【命运的试炼】",
        award = _t"经验、金券、道具",
        finish = _t"完成任意一个^00FF00命运的试炼^FFFFFF\r奖励：200000 经验、50000 金券、${item(18771)}一枚！",
        desc = _t"您可以在${npc(8608)}处接取【命运的试炼】！也可以查看百科${help(54)}了解更多信息",
}
_M[7]=
{
        id = 2113,
        level_low = 200,
        level_high = 200,
        name = _t"【装备升阶】",
        award = _t"经验、金券、道具",
        finish = _t"在魔盒界面进行一次^00FF00装备升阶操作^FFFFFF\r奖励：80000 经验、30000 金券、${item(18771)}一枚！",
        desc = _t"您可以通过包裹界面的魔盒按钮激活魔盒界面进行升阶操作。也可以查看百科${help(67)}了解更多信息",
}
_M[8]=
{
        id = 2101,
        level_low = 200,
        level_high = 200,
        name = _t"【危急！纱织守护者】",
        award = _t"经验、金券、装备",
        finish = _t"完成一次定时活动^00FF00【危急！纱织守护者】^FFFFFF\r奖励：700000 经验、40000 金券、${item(2163)}1件！",
        desc = _t"该活动可以在圣域${npc(13057)}处组队参加，每个时间段只能参加一次！也可以通过日程表的组队平台功能报名参加！查看百科${help(79)}了解更多信息",
}
_M[9]=
{
        id = 2102,
        level_low = 200,
        level_high = 200,
        name = _t"【风暴！亚特兰蒂斯】",
        award = _t"经验、金券、聚能物品",
        finish = _t"完成一次不定时活动^00FF00【风暴！亚特兰蒂斯】^FFFFFF\r奖励：900000 经验、80000 金券、${item(5114)}10个！",
        desc = _t"该活动可以在圣域${npc(14420)}处组队参加，每天只能参加一次！也可以通过日程表的组队平台功能报名参加！查看百科${help(80)}了解更多信息",
}
_M[10]=
{
        id = 2103,
        level_low = 200,
        level_high = 200,
        name = _t"【传承！黄金试炼】",
        award = _t"经验、金券、聚能物品",
        finish = _t"完成一次不定时活动^00FF00【传承！黄金试炼】^FFFFFF\r奖励：1200000 经验、120000 金券、${item(8398)}10个！",
        desc = _t"该活动可以在圣域${npc(12838)}处组队参加，每天可以参加5次！也可以通过日程表的组队平台功能报名参加！查看百科${help(81)}了解更多信息",
}
_M[11]=
{
        id = 2109,
        level_low = 200,
        level_high = 200,
        name = _t"【装备聚能】",
        award = _t"经验、金券、道具",
        finish = _t"对任意装备进行一次^00FF00聚能操作^FFFFFF\r奖励：300000 经验、50000 金券、${item(18771)}一枚！",
        desc = _t"您可以在${npc(11576)}处进行装备聚能操作，装备聚能道具${item(5114)}可以通过新手礼包获取！也可以查看百科${help(72)}了解更多信息",
}
_M[12]=
{
        id = 2114,
        level_low = 200,
        level_high = 200,
        name = _t"【生产技能】",
        award = _t"经验、金券、道具",
        finish = _t"学习任意一项^00FF00生产技能^FFFFFF\r奖励：100000 经验、50000 金券、${item(18771)}一枚！",
        desc = _t"您可以在${npc(17542)}处学习生产技能，也可以查看百科${help(68)}了解更多信息",
}
_M[13]=
{
        id = 2035,
        level_low = 200,
        level_high = 200,
        name = _t"【星辰的史诗】",
        award = _t"经验、道具",
        finish = _t"完成一次活动^00FF00【星辰的史诗】^FFFFFF\r奖励：500000 经验、${item(18771)}一枚！",
        desc = _t"您可以在${npc(10635)}处参加活动【星辰的史诗】！或查看日程表、帮助系统了解更多信息",
}
_M[14]=
{
        id = 2105,
        level_low = 200,
        level_high = 200,
        name = _t"【十风穴】",
        award = _t"经验、装备",
        finish = _t"完成一次副本^00FF00【十风穴】^FFFFFF\r奖励：2000000 经验、${item(4035)}1件！",
        desc = _t"您可以在${npc(15294)}处进入副本【十风穴】！也可以查看百科${help(85)}了解更多信息",
}
_M[15]=
{
        id = 2110,
        level_low = 200,
        level_high = 200,
        name = _t"【符文镶嵌】",
        award = _t"经验、金券、道具",
        finish = _t"对任意装备进行一次^00FF00符文镶嵌操作^FFFFFF\r奖励：300000 经验、60000 金券、${item(18771)}一枚！",
        desc = _t"您可以在${npc(17850)}处进行符文镶嵌操作，符文镶嵌道具${item(12986)}可以通过新手礼包获取！也可以查看百科${help(304)}了解更多信息",
}
_M[16]=
{
        id = 2046,
        level_low = 200,
        level_high = 200,
        name = _t"【阿提卡遗迹】",
        award = _t"经验、道具",
        finish = _t"完成任务^00FF00【圣斗士的战斗】^FFFFFF\r奖励：1800000 经验、${item(18771)}一枚！",
        desc = _t"您可以在${npc(16355)}处接取任务【圣斗士的战斗】，通过日程表的自动排队系统进入【阿提卡遗迹】完成该任务",
}
_M[17]=
{
        id = 2111,
        level_low = 200,
        level_high = 200,
        name = _t"【小宇宙占星】",
        award = _t"经验、金券、道具",
        finish = _t"在小宇宙的占星界面进行一次^00FF00占星操作^FFFFFF\r奖励：800000 经验、80000 金券、${item(18771)}一枚！",
        desc = _t"您可以在小宇宙的占星界面进行占星操作，占星需要小宇宙的感悟道具${item(9842)}可以通过新手礼包获取！也可以查看百科${help(62)}了解更多信息",
}
_M[18]=
{
        id = 2115,
        level_low = 200,
        level_high = 200,
        name = _t"【射手逃亡】",
        award = _t"经验、道具",
        finish = _t"完成一次副本^00FF00【射手逃亡】^FFFFFF\r奖励：2500000 经验、${item(18771)}一枚！",
        desc = _t"您可以在${npc(18846)}处进入副本【射手逃亡】！或查看日程表、帮助系统了解更多信息",
}
_M[19]=
{
        id = 2065,
        level_low = 200,
        level_high = 200,
        name = _t"【黄金十二宫】",
        award = _t"经验、道具",
        finish = _t"完成一次副本^00FF00【黄金十二宫】^FFFFFF\r奖励：5000000 经验、${item(18771)}一枚！",
        desc = _t"您可以在${npc(18479)}处进入副本【黄金十二宫】！或查看日程表、帮助系统了解更多信息",
}