--
--[[ @i18n questionaire ]]
local _t = require("i18n").context("questionaire")
-------------------
--
--    调查问卷题目库
--
-------------------

QuestionaireDB = {}
QuestionaireDB[36943]=
    {
         welcome = _t"您打开了测试问卷1",
         award   = {
                 [1] = 13523, -- 奖励1 id
                 [2] = 999, -- 奖励1 num
                 [3] = 13737, -- 奖励2 id
                 [4] = 999, -- 奖励2 num
                 },
         questionnum = 7, -- 问题数量
         question1 = _t"你觉得打怪难度如何？",
         question1_answer = {
                 [1] = _t"简单",
                 [2] = _t"难",
                 [3] = _t"非常难",
                 [4] = _t"超级难",},
         question2 = _t"你觉得尧尧长得帅不帅？",
         question2_answer = {
                 [1] = _t"鬼哭神号",
                 [2] = _t"难以形容",
                 [3] = _t"惨绝人寰",
                 [4] = _t"惊天动地",},
         question3 = _t"你觉得圣斗士好不好玩？",
         question3_answer = {
                 [1] = _t"好玩",
                 [2] = _t"特别好玩",
                 [3] = _t"非常好玩",
                 [4] = _t"没见过这么好玩的",},
         question4 = _t"你觉得星矢跟谁最配？",
         question4_answer = {
                 [1] = _t"紫龙",
                 [2] = _t"冰河",
                 [3] = _t"瞬",
                 [4] = _t"一辉",},
         question5 = _t"如果你面前掉了100块要怎么办？",
         question5_answer = {
                 [1] = _t"走过去",
                 [2] = _t"跑过去",},
         question6 = _t"如果满分是10，你觉得自己应该得几分？",
         question6_answer = {
                 [1] = _t"1",
                 [2] = _t"2",
                 [3] = _t"3",
                 [4] = _t"4",
                 [5] = _t"5",
                 [6] = _t"6",
                 [7] = _t"7",
                 [8] = _t"8",
                 [9] = _t"9",
                 [10] = _t"10",
                },
         question7 = _t"上一个问题其实是蠢的满分是10，你选的是哪个呢？现在给你一次重新选的机会",
         question7_answer = {
                 [1] = _t"10分",},

    }
QuestionaireDB[36950]=
    {
         welcome = _t"这里是期待已久的问卷2",
         award   = {
                 [1] = 2170, -- 奖励1 id
                 [2] = 1, -- 奖励1 num
                 [3] = 2171, -- 奖励2 id
                 [4] = 1, -- 奖励2 num
                 [5] = 2172, -- 奖励3 id
                 [6] = 1, -- 奖励3 num
                 [7] = 2173, -- 奖励4 id
                 [8] = 1, -- 奖励4 num
                 [9] = 2174, -- 奖励1 id
                 [10] = 1, -- 奖励1 num
                 [11] = 2175, -- 奖励2 id
                 [12] = 1, -- 奖励2 num
                 [13] = 2176, -- 奖励3 id
                 [14] = 1, -- 奖励3 num
                 [15] = 2177, -- 奖励4 id
                 [16] = 1, -- 奖励4 num
                 },
         questionnum = 2, -- 问题数量
         question1 = _t"奖励怎么样？",
         question1_answer = {
                 [1] = _t"好",
                 [2] = _t"不好",
                 [3] = _t"还不够",
                 [4] = _t"太多了",},
         question2 = _t"1234567？",
         question2_answer = {
                 [1] = _t"1",
                 [2] = _t"23",
                 [3] = _t"45",
                 [4] = _t"67",},
    }

QuestionaireDB[36951]=
    {
         welcome = _t"感谢您参与圣斗士星矢Online第一次问卷调查，您的回复将作为重要参考，可以让我们为您提供更好的服务。\r    今天请您回答第一部分——基本信息",
         award   = {
                 [1] = 42057, -- 奖励1 id
                 [2] = 1, -- 奖励1 num
                 [3] = 34696, -- 奖励2 id
                 [4] = 4, -- 奖励2 num
                 },
         questionnum = 9, -- 问题数量
         question1 = _t"请问您的性别是？",
         question1_answer = {
                 [1] = _t"男",
                 [2] = _t"女",},
         question2 = _t"请问您出生在哪个年代？",
         question2_answer = {
                 [1] = _t"70年以前",
                 [2] = _t"70-79年",
                 [3] = _t"80-89年",
                 [4] = _t"90-99年",
                 [5] = _t"00年以后",},
         question3 = _t"请问您的最高学历是？",
         question3_answer = {
                 [1] = _t"初中及以下",
                 [2] = _t"高中/中专",
                 [3] = _t"大学专科",
                 [4] = _t"大学本科",
                 [5] = _t"研究生及更高",},
         question4 = _t"请问您的职业是？",
         question4_answer = {
                 [1] = _t"政府机关公务员",
                 [2] = _t"国有企事业单位员工",
                 [3] = _t"私营企业上班族",
                 [4] = _t"工农业从业者",
                 [5] = _t"商业服务业人员",
                 [6] = _t"个体/私营企业主",
                 [7] = _t"自由职业者",
                 [8] = _t"学生(高中，中专及以下)",
                 [9] = _t"学生(大专，本科及以上)",
                 [10] = _t"其他",},
         question5 = _t"请问您目前大致月收入是？",
         question5_answer = {
                 [1] = _t"无固定收入",
                 [2] = _t"500元以下",
                 [3] = _t"501-2000元",
                 [4] = _t"2001-5000元",
                 [5] = _t"5000-8000元",
                 [6] = _t"8000元以上",},
         question6 = _t"请问您最近半年生活时间最长的城市是？",
         question6_answer = {
                 [1] = _t"北京\\上海\\广州\\深圳",
                 [2] = _t"港澳台地区",
                 [3] = _t"各省会城市(含天津,重庆)",
                 [4] = _t"地级城市",
                 [5] = _t"县级城市",
                 [6] = _t"乡镇农村",
                 [7] = _t"国外",
                 },
         question7 = _t"您平均每月在网络游戏中的花费如何？",
         question7_answer = {
                 [1] = _t"50元以下",
                 [2] = _t"51-150元",
                 [3] = _t"151-300元",
                 [4] = _t"301-1000元",
                 [5] = _t"1000元以上",},
         question8 = _t"您通常在哪个时间段玩游戏？",
         question8_answer = {
                 [1] = _t"8-12点",
                 [2] = _t"12-14点",
                 [3] = _t"14-18点",
                 [4] = _t"18-22点",
                 [5] = _t"22-8点",
                 [6] = _t"24小时全天在线",
                 [7] = _t"没有规律",},
         question9 = _t"您是否看过《圣斗士星矢》的漫画或动画",
         question9_answer = {
                 [1] = _t"看过",
                 [2] = _t"听说过但没看过",
                 [3] = _t"没看过也没听说过",},
    }

QuestionaireDB[36952]=
    {
         welcome = _t"今天请您回答问卷的第二部分，再次感谢您参与调查。",
         award   = {
                 [1] = 42057, -- 奖励1 id
                 [2] = 1, -- 奖励1 num
                 [3] = 30706, -- 奖励2 id
                 [4] = 1, -- 奖励2 num
                 },
         questionnum = 10, -- 问题数量
         question1 = _t"您玩游戏时最在乎哪些东西？",
         question1_answer = {
                 [1] = _t"是否有朋友一起",
                 [2] = _t"游戏的题材和风格",
                 [3] = _t"原著化程度和剧情设计",
                 [4] = _t"游戏的画面是否精美",
                 [5] = _t"PVP内容是否足够丰富",
                 [6] = _t"游戏的平衡性",
                 [7] = _t"游戏里的花费",},
         question2 = _t"以下会吸引你进入一款游戏的最重要要素是？",
         question2_answer = {
                 [1] = _t"网络广告",
                 [2] = _t"好友推荐",
                 [3] = _t"游戏相关新闻报道",
                 [4] = _t"报纸杂志广告",
                 [5] = _t"网吧海报宣传",
                 [6] = _t"看到其他人在玩",
                 [7] = _t"包机活动",
                 [8] = _t"公会进驻",
                 },
         question3 = _t"一旦离开一款玩了很久的游戏后，什么会吸引您重回这款游戏？",
         question3_answer = {
                 [1] = _t"玩过别的，感觉不如这款好",
                 [2] = _t"有了新玩法和新游戏内容",
                 [3] = _t"朋友召唤",
                 [4] = _t"老玩家回归有优厚奖励",},
         question4 = _t"如果您已经回到了一款玩过的游戏，什么会促使您再次留下来？",
         question4_answer = {
                 [1] = _t"新玩法很有意思",
                 [2] = _t"以前的朋友还在",
                 [3] = _t"赠送了很多回归礼品",
                 [4] = _t"回归后成长变快了",},
         question5 = _t"假如曾经一起玩同款游戏的朋友已经离开了，什么会促使您尝试说服他回来？",
         question5_answer = {
                 [1] = _t"觉得新游戏内容很好",
                 [2] = _t"看到怀旧的东西勾起了回忆",
                 [3] = _t"召唤朋友回归奖励丰富",
                 [4] = _t"新玩法需要靠谱的队友",},
         question6 = _t"以下类型的任务，您的偏好是？",
         question6_answer = {
                 [1] = _t"故事剧情类",
                 [2] = _t"副本挑战类",
                 [3] = _t"团队协作类",
                 [4] = _t"强对抗性PVP任务",
                },
         question7 = _t"《圣斗士星矢》最吸引您的是？",
         question7_answer = {
                 [1] = _t"神秘的希腊神话故事背景",
                 [2] = _t"独具魅力的人物",
                 [3] = _t"绚丽多彩的圣衣",
                 [4] = _t"气势磅礴的场景",
                 [5] = _t"无限提升的小宇宙",
                 [6] = _t"经典华丽的招式",
                 [7] = _t"跌宕起伏的情节",
                 [8] = _t"优美激昂的音乐",
                 },
         question8 = _t"您在网络游戏中主要追求什么？",
         question8_answer = {
                 [1] = _t"在游戏中交友，恋爱",
                 [2] = _t"和现实生活中的朋友增进感情",
                 [3] = _t"增加经验等级，得到认可和崇拜",
                 [4] = _t"获得经济收入",
                 [5] = _t"娱乐放松，调剂生活",
                 [6] = _t"PVP的刺激",
                 [7] = _t"在讨论游戏的话题上不落后",
                 [8] = _t"锻炼智力和操作反应",
                 [9] = _t"只是为了打发空闲时间",
                },
         question9 = _t"关于圣斗士，您比较关注哪类二次元信息？",
         question9_answer = {
                 [1] = _t"同人作品",
                 [2] = _t"吐槽恶搞",
                 [3] = _t"单幅插画",
                 [4] = _t"精美COS",
                },
         question10 = _t"以下哪类活动或奖励能吸引你拉上好友一起玩《圣斗士星矢》？",
         question10_answer = {
                 [1] = _t"丰厚奖励（礼包和点卡）",
                 [2] = _t"基友系统",
                 [3] = _t"美女陪玩",
                 [4] = _t"玩家见面会",
                },
    }

QuestionaireDB[36953]=
    {
         welcome = _t"今天请您回答问卷的第三部分，感谢您参与调查。",
         award   = {
                 [1] = 42057, -- 奖励1 id
                 [2] = 1, -- 奖励1 num
                 [3] = 34345, -- 奖励2 id
                 [4] = 1, -- 奖励2 num
                 },
         questionnum = 8, -- 问题数量
         question1 = _t"您对哪方面的游戏活动更感兴趣？",
         question1_answer = {
                 [1] = _t"比赛类（如跨服PK）",
                 [2] = _t"经验类（如多倍经验）",
                 [3] = _t"发放游戏特权",
                 [4] = _t"冲级类活动",
                 [5] = _t"线上互动",
                 [6] = _t"线下活动",
                 [7] = _t"促销奖励",
                 [8] = _t"抽奖活动",
                 [9] = _t"游戏评选（选美，才艺大赛）",
                 [10] = _t"大型会展",},
         question2 = _t"您平常主要通过什么途径了解游戏资讯？",
         question2_answer = {
                 [1] = _t"官方网站和论坛",
                 [2] = _t"非官方游戏论坛",
                 [3] = _t"专业游戏网站",
                 [4] = _t"门户网站的游戏频道",
                 [5] = _t"微博",
                 [6] = _t"视频网站",
                 [7] = _t"游戏杂志报纸",
                 [8] = _t"电视游戏频道",
                 [9] = _t"网吧广告活动",
                 [10] = _t"朋友推荐",},
         question3 = _t"您是从哪个渠道得知《圣斗士星矢》相关信息的？",
         question3_answer = {
                 [1] = _t"官方网站和论坛",
                 [2] = _t"非官方游戏论坛",
                 [3] = _t"专业游戏网站",
                 [4] = _t"门户网站的游戏频道",
                 [5] = _t"微博",
                 [6] = _t"视频网站",
                 [7] = _t"游戏杂志报纸",
                 [8] = _t"电视游戏频道",
                 [9] = _t"网吧广告活动",
                 [10] = _t"朋友推荐",},
         question4 = _t"您对一下那种关于《圣斗士星矢Online》的信息感兴趣",
         question4_answer = {
                 [1] = _t"圣斗士主题展",
                 [2] = _t"圣斗士电视广告",
                 [3] = _t"圣斗士网络广告",
                 [4] = _t"圣斗士银行卡",
                 [5] = _t"圣斗士动画漫画",
                 [6] = _t"圣斗士COS",},
         question5 = _t"看到一款游戏的宣传视频后，您会因为什么去尝试？",
         question5_answer = {
                 [1] = _t"题材",
                 [2] = _t"世界观的内涵",
                 [3] = _t"画面视觉效果",
                 [4] = _t"畅爽的战斗",
                 [5] = _t"游戏内可以获得大笔财富",
                 [6] = _t"丰富的社交功能",},
         question6 = _t"您最常用的社交网站是？",
         question6_answer = {
                 [1] = _t"几乎不去社交网站",
                 [2] = _t"新浪微博",
                 [3] = _t"腾讯微博和QQ空间",
                 [4] = _t"网易微博",
                 [5] = _t"人人网",
                 [6] = _t"豆瓣",
                 [7] = _t"天涯",
                 [8] = _t"猫扑",
                 [9] = _t"51",
                 [10] = _t"知乎",
                },
         question7 = _t"您平时会在哪些网站观看动画视频？",
         question7_answer = {
                 [1] = _t"不怎么看视频",
                 [2] = _t"优酷",
                 [3] = _t"土豆",
                 [4] = _t"爱奇艺",
                 [5] = _t"乐视",
                 [6] = _t"迅雷看看",
                 [7] = _t"酷6",
                 [8] = _t"ACFUN",
                 [9] = _t"bilibili",
                 [10] = _t"其他",},
         question8 = _t"您平时会在哪些网站看漫画？",
         question8_answer = {
                 [1] = _t"不怎么看视频",
                 [2] = _t"有妖气",
                 [3] = _t"爱漫画",
                 [4] = _t"漫客栈",
                 [5] = _t"微漫画",
                 [6] = _t"KUKU动漫",
                 [7] = _t"动漫屋",},

    }

QuestionaireDB[36954]=
    {
         welcome = _t"今天请您回答本次问卷调查的最后一部分，感谢您的参与。",
         award   = {
                 [1] = 42057, -- 奖励1 id
                 [2] = 1, -- 奖励1 num
                 [3] = 13066, -- 奖励2 id
                 [4] = 2, -- 奖励2 num
                 [5] = 42090, -- 奖励2 id
                 [6] = 1, -- 奖励2 num
                 },
         questionnum = 7, -- 问题数量
         question1 = _t"最近除了圣斗士星矢之外，您还玩过其他游戏吗？",
         question1_answer = {
                 [1] = _t"玩过",
                 [2] = _t"最近只玩圣斗士",},
         question2 = _t"您最喜欢什么类型的游戏",
         question2_answer = {
                 [1] = _t"大型多人在线角色扮演游戏",
                 [2] = _t"横版格斗游戏",
                 [3] = _t"大型休闲游戏",
                 [4] = _t"单机/局域网互联游戏",
                 [5] = _t"卡牌和棋牌类游戏",
                 [6] = _t"网页游戏",
                 [7] = _t"电视游戏及掌机游戏",
                 [8] = _t"手机游戏",},
         question3 = _t"您会关注户外广告吗？",
         question3_answer = {
                 [1] = _t"有意识地注意",
                 [2] = _t"感兴趣的信息会注意",
                 [3] = _t"一般不会注意",
                 [4] = _t"刻意回避",},
         question4 = _t"您最能接受的游戏广告地点是？",
         question4_answer = {
                 [1] = _t"楼宇电梯",
                 [2] = _t"地铁公交",
                 [3] = _t"灯箱广告",
                 [4] = _t"商场超市广告牌",},
         question5 = _t"请问您最常看的电视台是？",
         question5_answer = {
                 [1] = _t"湖南卫视",
                 [2] = _t"江苏卫视",
                 [3] = _t"东方卫视",
                 [4] = _t"北京卫视",
                 [5] = _t"天津卫视",
                 [6] = _t"安徽卫视",
                 [7] = _t"央视",},
         question6 = _t"请问您平时在什么时间段看电视",
         question6_answer = {
                 [1] = _t"8-12点",
                 [2] = _t"12-14点",
                 [3] = _t"14-18点",
                 [4] = _t"18-22点",
                 [5] = _t"22-8点",
                 [6] = _t"没有规律",
                },
         question7 = _t"请问您喜欢什么类型的电视广告",
         question7_answer = {
                 [1] = _t"温暖型广告",
                 [2] = _t"深情型广告",
                 [3] = _t"亲情型广告",
                 [4] = _t"悬疑型广告",
                 [5] = _t"炫丽型广告",
                 [6] = _t"很刺激的广告",
                 [7] = _t"高效型的广告",},

    }
QuestionaireDB[42863]=
    {
         welcome = _t"感谢您参与圣斗士星矢Online的第二次问卷调查，您的回复将作为重要参考，可以让我们为您提供更好的服务。",
         award   = {
                 [1] = 42057, -- 奖励1 id
                 [2] = 1, -- 奖励1 num
                 [3] = 34696, -- 奖励2 id
                 [4] = 4, -- 奖励2 num
                 },
         questionnum = 10, -- 问题数量
         question1 = _t"在参与本调查前，您对《女神的圣逗士》这部动画有多大的了解",
         question1_answer = {
                 [1] = _t"感觉有趣，一直在追剧",
                 [2] = _t"看过，闲暇时会关注",
                 [3] = _t"听朋友说起过，有兴趣",
                 [4] = _t"之前没听说过",},
         question2 = _t"您对《女神的圣逗士》的评价如何呢？",
         question2_answer = {
                 [1] = _t"搞笑幽默，很有爱",
                 [2] = _t"原剧+恶搞，很不错",
                 [3] = _t"剧情笑点需优化",
                 [4] = _t"此动画片完全没爱",
                 },
         question3 = _t"您一般是从哪些渠道，来观看《女神的圣逗士》的？",
         question3_answer = {
                 [1] = _t"视频门户网站",
                 [2] = _t"游戏类媒体",
                 [3] = _t"朋友介绍后，主动搜索",
                 [4] = _t"之前没有看过",},
         question4 = _t"您是通过何种渠道，看到《女神的圣逗士》的",
         question4_answer = {
                 [1] = _t"搜索引擎",
                 [2] = _t"视频网站内部搜索",
                 [3] = _t"微博的朋友转发或搜索",
                 [4] = _t"网站的视频推荐",
                 [5] = _t"不会去主动搜索",},
         question5 = _t"《女神的圣逗士》这部动画片，对于《圣斗士星矢ONLINE》的宣传起到的作用是",
         question5_answer = {
                 [1] = _t"能够引起题材的关注",
                 [2] = _t"能够引导搜索游戏",
                 [3] = _t"激发对相关ACG兴趣",
                 [4] = _t"没有任何作用",},
         question6 = _t"你认为《女神的圣逗士》如何可以更好引起玩家对《圣斗士星矢ONLINE》的关注？",
         question6_answer = {
                 [1] = _t"结合游戏事件制作剧情",
                 [2] = _t"讲述知名战队的趣闻",
                 [3] = _t"恶搞游戏内名人的剧情",
                 [4] = _t"对游戏内职业恶搞讲解",
                },
         question7 = _t"请在下列选项中选出，可以令动画片的剧情与游戏更加紧密结合的方式？",
         question7_answer = {
                 [1] = _t"采用玩家征稿的方式",
                 [2] = _t"游戏内玩法趣味吐槽",
                 [3] = _t"游戏内场景的植入",
                 [4] = _t"恶搞新奇道具与时装",
                 },
         question8 = _t"看过《女神的圣逗士》之后，你对这部动画片有怎样的期待？",
         question8_answer = {
                 [1] = _t"新剧放出日期更加固定",
                 [2] = _t"希望剧情更加丰富搞笑",
                 [3] = _t"希望此片以系列播放",
                 [4] = _t"更好的平衡游戏和原著",
                },
         question9 = _t"你认为《女神的圣逗士》怎样改进，会得到更多人对的关注？",
         question9_answer = {
                 [1] = _t"结合社会热点吐槽剧情",
                 [2] = _t"对原著剧情的适当翻新",
                 [3] = _t"更多无节操元素的加入",
                 [4] = _t"没看过，不知如何建议",
                },
         question10 = _t"如果你是通过本次问卷了解到《女神的圣逗士》，是否有兴趣继续追看？",
         question10_answer = {
                 [1] = _t"会追看",
                 [2] = _t"会偶尔关注",
                 [3] = _t"一般",
                 [4] = _t"不会",
                },
    }