---------------------------------------------------------------
--  created:   2013.4.20
--  author:    chenfudun
--
--  竞技场相关配置
---------------------------------------------------------------	

Arena_Award = 
{
	[0] = 						-- [0]是参考例子，编号顺序排列，编号[1]及以后的有效
	{
		level_section = {0,0},		-- 排名段
		cur_fight = { {26403,1}, },	-- 当前排名段当场奖励物品及个数
		cur_week =  { {0,0}, {0,0}, {0,0}, {0,0}, {0,0}, {0,0}, }, 	-- 当前排名段周结算奖励物品及个数,目前都是6个
		cur_title = _t"银河斗技场",
	},
	[1] = 
	{
		level_section = {1,2},
		cur_fight = { {26403,3}, },
		cur_week =  { {27520,10}, {13066,20},{11776,30},{18075,50},{0,0},{0,0}, },
		cur_title = _t"^ff3339达成！银河的制霸",	
	},
	[2] = 
	{
		level_section = {2,3},
		cur_fight = { {26403,3}, },
		cur_week =  {{27520,8}, {13066,16},{11776,24},{18075,40},{0,0},{0,0}, },
		cur_title = _t"^ff3339无情！恐怖的死神",	
	},
	[3] = 
	{
		level_section = {3,4},
		cur_fight = { {26403,3},  },
		cur_week =  { {27520,6}, {13066,12},{11776,18},{18075,30},{0,0},{0,0}, },
		cur_title = _t"^ff3339不屈！热血的战神",	
	},
	[4] = 
	{
		level_section = {4,11},
		cur_fight = { {26403,3},  },
		cur_week =  {{27520,4}, {13066,8},{11776,12},{18075,20},{0,0},{0,0},  },
		cur_title = _t"^ff3339闪耀的小宇宙",	
	},
	[5] = 
	{
		level_section = {11,26},
		cur_fight = { {26403,3},  },
		cur_week =  { {27520,3}, {13066,6},{11776,8},{18075,10},{0,0},{0,0}, },
		cur_title = _t"^ff3339战斗的达人",	
	},
	[6] = 
	{
		level_section = {26,51},
		cur_fight = { {26403,3},  },
		cur_week =  { {27520,2}, {13066,4},{11776,5},{18075,5},{0,0},{0,0}, },
		cur_title = _t"^ff3339无",	
	},
	[7] = 
	{
		level_section = {51,101},
		cur_fight = { {26403,3},  },
		cur_week =  {{27520,1}, {13066,2},{9838,20},{9839,20},{0,0},{0,0}, },
		cur_title = _t"^ff3339无",	
	},
	[8] = 
	{
		level_section = {101,301},
		cur_fight = { {26403,3},  },
		cur_week =  { {13066,1}, {9838,10},{9839,10},{0,0},{0,0},{0,0},  },
		cur_title = _t"^ff3339无",	
	},
	[9] = 
	{
		level_section = {301,501},
		cur_fight = { {26403,3},  },
		cur_week =  { {9838,5}, {9839,5},{0,0},{0,0},{0,0},{0,0}, },
		cur_title = _t"^ff3339无",	
	},
	[10] = 
	{
		level_section = {501,0},
		cur_fight = { {26403,3},  },
		cur_week =  { {0,0}, {0,0},{0,0},{0,0},{0,0},{0,0}, },
		cur_title = _t"^ff3339无",	
	},
}