--[[--------------------------------------------
-- 分线信息配置
-- Created by Fengbo
-- @i18n config
--]]
local _t = require("i18n").context("config")

line_info = {}

--[[
按地图分别配置各线的显示名称
没有进行配置的地图将默认认为无法换线。
-----------------------------------

配置格式如下：
line_info[1] = "群星之地${line}"		-- 配置方式1：玩家在1号地图的所有线显示为“群星之地X”，通配符${line}表示线号

line_info[2] =							-- 配置方式2：为2号地图手动配置每条线的名称。未在这里配置的线将不会出现在游戏中
{
	[1] = "圣域1",						-- 2号地图的1线
	[2] = "圣域2",						-- 2号地图的2线
	[3] = "圣域3",
	[4] = "圣域4",
}
]]

line_info[1] =
{
	[15] = _t"群星之地1",
	[14] = _t"群星之地2",
	[13] = _t"群星之地3",
	[12] = _t"群星之地4",
	[11] = _t"群星之地5",
	[10] = _t"群星之地6",
	[9] = _t"群星之地7",
	[8] = _t"群星之地8",
	[7] = _t"群星之地9",
	[6] = _t"群星之地10",
	[5] = _t"群星之地11",
	[4] = _t"群星之地12",
	[3] = _t"群星之地13",
	[2] = _t"群星之地14",
	[1] = _t"群星之地15",
}

line_info[2] =
{
	[1] = _t"圣域1",
	[2] = _t"圣域2",
	[3] = _t"圣域3",
	[4] = _t"圣域4",
	[5] = _t"圣域5",
	[6] = _t"圣域6",
	[7] = _t"圣域7",
	[8] = _t"圣域8",
	[9] = _t"圣域9",
	[10] = _t"圣域10",
	[11] = _t"圣域11",
	[12] = _t"圣域12",
	[13] = _t"圣域13",
	[14] = _t"圣域14",
	[15] = _t"圣域15",
}

line_info[3] =
{
	[8] = _t"庐山1",
	[7] = _t"庐山2",
	[6] = _t"庐山3",
	[5] = _t"庐山4",
	[4] = _t"庐山5",
	[3] = _t"庐山6",
	[2] = _t"庐山7",
	[1] = _t"庐山8",
}

line_info[4] =
{
	[11] = _t"银河竞技场1",
	[12] = _t"银河竞技场2",
	[13] = _t"银河竞技场3",
	[14] = _t"银河竞技场4",
	[15] = _t"银河竞技场5",
	[9] = _t"银河竞技场6",
	[10] = _t"银河竞技场7",
}

line_info[5] =
{
	[4] = _t"遗忘之路1",
	[5] = _t"遗忘之路2",
	[6] = _t"遗忘之路3",
	[7] = _t"遗忘之路4",
	[8] = _t"遗忘之路5",
	[9] = _t"遗忘之路6",
}

line_info[6] =
{
	[7] = _t"死亡皇后岛1",
	[8] = _t"死亡皇后岛2",
	[9] = _t"死亡皇后岛3",
	[10] = _t"死亡皇后岛4",
	[11] = _t"死亡皇后岛5",
	[12] = _t"死亡皇后岛6",
}

line_info[7] =
{
	[13] = _t"东西伯利亚1",
	[14] = _t"东西伯利亚2",
	[15] = _t"东西伯利亚3",
	[10] = _t"东西伯利亚4",
	[11] = _t"东西伯利亚5",
	[12] = _t"东西伯利亚6",
}

line_info[8] =
{
	[3] = _t"亚特兰蒂斯1",
	[13] = _t"亚特兰蒂斯2",
	[14] = _t"亚特兰蒂斯3",
	[15] = _t"亚特兰蒂斯4",
	[1] = _t"亚特兰蒂斯5",
	[2] = _t"亚特兰蒂斯6",
}
line_info[9] =
{
	[7] = _t"仙女岛1",
	[8] = _t"仙女岛2",
	[9] = _t"仙女岛3",
}

line_info[10] =
{
	[10] = _t"哈迪斯城1",
	[11] = _t"哈迪斯城2",
	[12] = _t"哈迪斯城3",
}

line_info[11] =
{
	[13] = _t"冥界地狱1",
	[14] = _t"冥界地狱2",
	[15] = _t"冥界地狱3",
}

line_info[12] =
{
	[1] = _t"极乐净土1",
	[8] = _t"极乐净土2",
	[9] = _t"极乐净土3",
	[13] = _t"极乐净土4",
	[14] = _t"极乐净土5",
	[15] = _t"极乐净土6",
}

line_info[25] =
{
	[1] = _t"爱琴湾1",
	[2] = _t"爱琴湾2",
	[3] = _t"爱琴湾3",
	[4] = _t"爱琴湾4",
	[5] = _t"爱琴湾5",
	[6] = _t"爱琴湾6",
	[7] = _t"爱琴湾7",
	[8] = _t"爱琴湾8",
	[9] = _t"爱琴湾9",
	[10] = _t"爱琴湾10",
	[11] = _t"爱琴湾11",
	[12] = _t"爱琴湾12",
	[13] = _t"爱琴湾13",
	[14] = _t"爱琴湾14",
	[15] = _t"爱琴湾15",
}

line_info[31] =
{
	[1] = _t"试炼幻境一(1线)",
	[2] = _t"试炼幻境一(2线)",
	[3] = _t"试炼幻境一(3线)",
	[4] = _t"试炼幻境一(4线)",
	[5] = _t"试炼幻境一(5线)",
	[6] = _t"试炼幻境一(6线)",
	[7] = _t"试炼幻境一(7线)",
	[8] = _t"试炼幻境一(8线)",
	[9] = _t"试炼幻境一(9线)",
	[10] = _t"试炼幻境一(10线)",
	[11] = _t"试炼幻境一(11线)",
	[12] = _t"试炼幻境一(12线)",
	[13] = _t"试炼幻境一(13线)",
	[14] = _t"试炼幻境一(14线)",
	[15] = _t"试炼幻境一(15线)",
}

line_info[26] =
{
	[1] = _t"试炼幻境二(1线)",
	[2] = _t"试炼幻境二(2线)",
	[3] = _t"试炼幻境二(3线)",
	[4] = _t"试炼幻境二(4线)",
	[5] = _t"试炼幻境二(5线)",
	[6] = _t"试炼幻境二(6线)",
	[7] = _t"试炼幻境二(7线)",
	[8] = _t"试炼幻境二(8线)",
	[9] = _t"试炼幻境二(9线)",
	[10] = _t"试炼幻境二(10线)",
	[11] = _t"试炼幻境二(11线)",
	[12] = _t"试炼幻境二(12线)",
	[13] = _t"试炼幻境二(13线)",
	[14] = _t"试炼幻境二(14线)",
	[15] = _t"试炼幻境二(15线)",
}


line_info[27] =
{
	[1] = _t"试炼幻境三(1线)",
	[2] = _t"试炼幻境三(2线)",
	[3] = _t"试炼幻境三(3线)",
	[4] = _t"试炼幻境三(4线)",
	[5] = _t"试炼幻境三(5线)",
	[6] = _t"试炼幻境三(6线)",
	[7] = _t"试炼幻境三(7线)",
	[8] = _t"试炼幻境三(8线)",
	[9] = _t"试炼幻境三(9线)",
	[10] = _t"试炼幻境三(10线)",
	[11] = _t"试炼幻境三(11线)",
	[12] = _t"试炼幻境三(12线)",
	[13] = _t"试炼幻境三(13线)",
	[14] = _t"试炼幻境三(14线)",
	[15] = _t"试炼幻境三(15线)",
}

line_info[28] =
{
	[1] = _t"试炼幻境四(1线)",
	[2] = _t"试炼幻境四(2线)",
	[3] = _t"试炼幻境四(3线)",
	[4] = _t"试炼幻境四(4线)",
	[5] = _t"试炼幻境四(5线)",
	[6] = _t"试炼幻境四(6线)",
	[7] = _t"试炼幻境四(7线)",
	[8] = _t"试炼幻境四(8线)",
	[9] = _t"试炼幻境四(9线)",
	[10] = _t"试炼幻境四(10线)",
	[11] = _t"试炼幻境四(11线)",
	[12] = _t"试炼幻境四(12线)",
	[13] = _t"试炼幻境四(13线)",
	[14] = _t"试炼幻境四(14线)",
	[15] = _t"试炼幻境四(15线)",
}

line_info[29] =
{
	[1] = _t"试炼幻境五(1线)",
	[2] = _t"试炼幻境五(2线)",
	[3] = _t"试炼幻境五(3线)",
	[4] = _t"试炼幻境五(4线)",
	[5] = _t"试炼幻境五(5线)",
	[6] = _t"试炼幻境五(6线)",
	[7] = _t"试炼幻境五(7线)",
	[8] = _t"试炼幻境五(8线)",
	[9] = _t"试炼幻境五(9线)",
	[10] = _t"试炼幻境五(10线)",
	[11] = _t"试炼幻境五(11线)",
	[12] = _t"试炼幻境五(12线)",
	[13] = _t"试炼幻境五(13线)",
	[14] = _t"试炼幻境五(14线)",
	[15] = _t"试炼幻境五(15线)",
}

line_info[30] =
{
	[1] = _t"试炼幻境六(1线)",
	[2] = _t"试炼幻境六(2线)",
	[3] = _t"试炼幻境六(3线)",
	[4] = _t"试炼幻境六(4线)",
	[5] = _t"试炼幻境六(5线)",
	[6] = _t"试炼幻境六(6线)",
	[7] = _t"试炼幻境六(7线)",
	[8] = _t"试炼幻境六(8线)",
	[9] = _t"试炼幻境六(9线)",
	[10] = _t"试炼幻境六(10线)",
	[11] = _t"试炼幻境六(11线)",
	[12] = _t"试炼幻境六(12线)",
	[13] = _t"试炼幻境六(13线)",
	[14] = _t"试炼幻境六(14线)",
	[15] = _t"试炼幻境六(15线)",
}

line_info[38] =
{
	[1] = _t"试炼幻境1",
	[2] = _t"试炼幻境2",
	[3] = _t"试炼幻境3",
	[4] = _t"试炼幻境4",
	[5] = _t"试炼幻境5",
	[6] = _t"试炼幻境6",
	[7] = _t"试炼幻境7",
	[8] = _t"试炼幻境8",
	[9] = _t"试炼幻境9",
	[10] = _t"试炼幻境10",
	[11] = _t"试炼幻境11",
	[12] = _t"试炼幻境12",
	[13] = _t"试炼幻境13",
	[14] = _t"试炼幻境14",
	[15] = _t"试炼幻境15",
}




line_info[40] = _t"雅典娜神殿${line}"

line_info[47] =
{
	[2] = _t"幻境",
}

line_info[48] =
{
	[2] = _t"幻境",
}

line_info[49] =
{
	[2] = _t"幻境",
}

line_info[50] = _t"女神之殿${line}"

line_info[61] =
{
	[3] = _t"亚特兰蒂斯1",
	[13] = _t"亚特兰蒂斯2",
	[14] = _t"亚特兰蒂斯3",
	[15] = _t"亚特兰蒂斯4",
	[1] = _t"亚特兰蒂斯5",
	[2] = _t"亚特兰蒂斯6",
}

line_info[62] =
{
	[5] = _t"终焉之地1",
	[6] = _t"终焉之地2",
	[7] = _t"终焉之地3",
	[8] = _t"终焉之地4",
	[9] = _t"终焉之地5",
	[10] = _t"终焉之地6",
}
