---------------------------------------------------------------
--  created:   2013.4.17
--  author:    chenfudun
--
--  VIP相关配置
---------------------------------------------------------------

VIP_AUTHORITY_DESC =
{
    [0] = _t"充值1元，就可以晋升到VIP1级哦！",	-- [0]是参考例子，编号顺序排列，编号[1]及以后的有效
    [1] = _t"1.  开启随身仓库服务\r2.  开启随身聚能服务",
    [2] = _t"1.  开启随身符文服务\r2.  尊享随身仓库服务\r3.  尊享随身聚能服务",
    [3] = _t"1.  开启随身邮件服务    2.  开启VIP特权商城\r3.  尊享随身符文服务    4.  尊享随身仓库服务\r5.  尊享随身聚能服务",
    [4] = _t"1.  开启随身拍卖服务\r2.  尊享随身邮件服务    3.  尊享随身符文服务\r4.  尊享随身仓库服务    5.  尊享随身聚能、VIP特权商城",
    [5] = _t"拥有永久生效属性称号“钱包鼓鼓的”\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [6] = _t"拥有永久生效属性称号“与金币跳舞”\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [7] = _t"拥有永久生效属性称号“勇往直前的淘金者”\r开启VIP频道使用权限\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [8] = _t"拥有永久生效属性称号“快乐的小土豪”\r尊享VIP频道使用权限\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [9] = _t"拥有永久生效属性称号“疯狂敛财者”\r尊享VIP频道使用权限\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [10] = _t"拥有永久生效属性称号“财富永不停息”\r尊享VIP频道使用权限\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [11] = _t"拥有永久生效属性称号“璀璨钻石大亨”\r尊享VIP频道使用权限\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [12] = _t"拥有永久生效属性称号“全球超级大富翁”\r尊享VIP频道使用权限\r尊享随身邮件、符文、仓库、聚能、VIP特权商城服务",
    [13] = _t"感谢您对圣斗士星矢OL的支持！",
}


MVIP_AUTHORITY_DESC =
{
    [0] = _t"当月充值1元，下月就可以晋升到月度MVIP1级哦！", -- [0]是参考例子，编号顺序排列，编号[1]及以后的有效
    [1] = _t"月度返还福利200星券",
    [2] = _t"月度返还福利400星券",
    [3] = _t"月度返还福利600星券",
    [4] = _t"月度返还福利2000星券",
    [5] = _t"月度返还福利3200星券",
    [6] = _t"1.  月度返还福利4000星券\r2.  尊享MVIP尊贵标识",
    [7] = _t"1.  月度返还福利5000星券\r2.  尊享MVIP尊贵标识",
    [8] = _t"1.  月度返还福利8500星券\r2.  尊享MVIP尊贵标识",
    [9] = _t"1.  月度返还福利14000星券\r2.  尊享MVIP尊贵标识",
    [10] = _t"1.  月度返还福利24000星券\r2.  尊享MVIP尊贵标识",
    [11] = _t"1.  月度返还福利32000星券\r2.  尊享MVIP尊贵标识",
    [12] = _t"1.  月度返还福利40000星券\r2.  尊享MVIP尊贵标识",
    [13] = _t"1.  月度返还福利60000星券\r2.  尊享MVIP尊贵标识",
    [14] = _t"1.  月度返还福利80000星券\r2.  尊享MVIP尊贵标识",
    [15] = _t"1.  月度返还福利126000星券\r2.  尊享MVIP尊贵标识",
    [16] = _t"1.  月度返还福利180000星券\r2.  尊享MVIP尊贵标识",
    [17] = _t"1.  月度返还福利280000星券\r2.  尊享MVIP尊贵标识",
    [18] = _t"1.  月度返还福利415000星券\r2.  尊享MVIP尊贵标识",
	[19] = _t"感谢您对圣斗士星矢OL的支持！",
}
