--------------------------------------------
-- 任务追踪过滤器配置 
-- Created by Fengbo
--[[
在本文件中可以特定条件下，任务追踪列表中允许显示的任务。
目前仅支持按当前地图编号过滤。
配置方式如下：

filter_by_map =				-- 按地图编号过滤
{
	[1] = {123, 456},		-- 在1号地图时只显示123, 456这两个任务。
	[2] = {},				-- 在2号地图不显示任何任务，即隐藏任务追踪界面
	[3] = {"additional-1"}	-- 在3号地图时只显示id为1的任务附加追踪。附加追踪的配置参见additional_trace.lua
}
--]]
--------------------------------------------

filter_by_map =
{
	[206] = {},  --十风穴（35级以上）
	[207] = {},  --射手之心（45级以上）
	[208] = {5714},  --黄金十二宫(始)（55级以上）
	[209] = {},  --冰海神殿（70级以上）
	[210] = {},  --粉碎！七大洋巨柱(前.后)（80级以上）
	[211] = {},  --黄金十二宫(续)（60级以上）
	[212] = {},  --黄金十二宫(终)（68级以上）
	[213] = {},  --女神的挽歌(前)（90级以上）
	[214] = {},  --女神的挽歌(后)（90级以上）
	[215] = {},  --黄金十二宫(余)（68级以上）
	[216] = {},  --英雄十风穴（80级以上）
	[217] = {},  --英雄射手之心（80级以上）
    [218] = {},  --蓝冰堡
    [219] = {},  --哈迪斯城
	[32] = {4094},  --雪人抢亲
	[36] = {9096,9111,9301,9302,9303,9304,9305,9412}, --[地宫]中秋月饼炸弹活动	
	[37] = {8384,8385,8386,8465,8466,8467,8390,8391,8504,8505,8506,8443},  --月度活动：激斗！狮子的獠牙！
	[64] = {12408,12607,12661,12416},  --服务器事件：冥王之怒
	[301] = {7236, "additional-3"},  --个人挑战副本
	[302] = {3525,79},  --黄泉之井的镇魂曲
	[303] = {80},  --激斗！黄金十二宫
	[304] = {444},  --战斗！银河擂台赛
	[305] = {441},  --决战！十风穴的死斗
	[306] = {872},  --决裂！龙与虎
	[307] = {1092},  --逃离比良坂（未完成）
	[308] = {2226},  --回忆！十三年前的真相
	[309] = {2412},  --阴谋！欺瞒神的男人
	[310] = {2197},  --再战！重返观星楼
	[311] = {},  --开始！圣衣竞技赛
	[312] = {2915},  --[剧本]异次元空间
	[313] = {2926},  --[剧本]异次元空间
	[314] = {2937},  --[剧本]异次元空间
	[315] = {2948},  --[剧本]异次元空间
	[316] = {2959},  --[剧本]异次元空间
	[317] = {3568},  --危急！狮子的困境
	[318] = {4152},  --回忆！新生的凤凰
	[319] = {3986,4002,4013,4019,4026,4034,4035,4036,4037},  --凤凰幻魔拳
	[320] = {4552},  --[剧本]崩坏！七海之柱！
	[321] = {5085},  --[剧本]回忆！正义的极光惩罚
	[322] = {6271}, --[剧本]白羊
	[323] = {8512}, --[剧本]金牛
	[324] = {9104}, --[剧本]双子
	[325] = {8799}, --[剧本]巨蟹
	[326] = {9880}, --[剧本]狮子
	[327] = {9830}, --[剧本]处女
	[328] = {9996}, --[剧本]天秤 
	[329] = {10067}, --[剧本]天蝎 
	[330] = {10451}, --[剧本]射手
	[331] = {11067}, --[剧本]摩羯
	[332] = {10539}, --[剧本]水瓶
	[333] = {11475}, --[剧本]双鱼 
	[334] = {}, --[剧本]教皇厅 
	[335] = {}, --[多人活动本]仲夏节活动 
	[336] = {}, --[多人活动本]仲夏节活动60+ 
	[337] = {8315,8316,8317,9555}, --[剧本]天魔降伏的考验 
	[338] = {}, --[多人活动本]七夕节活动 
	[339] = {}, --[月度活动]觉醒！沙加的六道
	[340] = {}, --[月度活动]天秤！童虎的回忆
	[341] = {}, --[月度活动]突破！天蝎的试炼
	[342] = {}, --[月度活动]逼近！射手的危机
	[343] = {}, --[圣诞节活动]大雪！保卫圣诞树
	[344] = {}, --[月度活动]摩羯！修罗的剑道
	[345] = {}, --[月度活动]水瓶！最强的绝招
	[346] = {}, --[月度活动]双鱼！玫瑰对魔花
	[347] = {}, --[月度活动]白羊！师徒大作战
	[348] = {}, --[月度活动]善恶！异次元空间
	[349] = {12216,12217}, --[儿童节战场]缩小吧！少年
	[350] = {12314}, ----[剧本]异次元空间——海龙
	[66] = {12978,12979,12980,12981}, ----[月度活动]巨蟹！僵尸来了！
    [401] = {}, --危急！纱织守护者(25-100) 危急！女神近卫军(60-100)
    [402] = {}, --圣战回忆（18级以上）
    [403] = {}, --传承！双鱼试炼（30-100）
    [404] = {}, --传承！狮子试炼（30-100）
    [405] = {}, --传承！天秤试炼（30-100）
    [406] = {}, --集结!十二宫危机（20-100）
    [407] = {}, --风暴！亚特兰蒂斯（25-100）
    [408] = {}, --复活！圣域镇魂歌（60-100）
    [409] = {}, --深渊！魔星的末日（60-100）
    [410] = {}, --大反攻（一）！冰火深渊（60-100）
    [411] = {}, --大反攻（二）！巨狼雪山（60-100）
    [412] = {}, --大反攻（三）！冰国邪神（60-100）
	[415] = {}, --攻破！复仇者联盟（60-100）
	[416] = {10030,11133, "additional-4"}, --孵化！冥蝶巢穴（90-150）
	[417] = {}, --哀嚎！地狱奏鸣曲（90-150）
	[418] = {}, --复生！死去的斗士（90-150）
    [421] = {}, --赶紧进入魔盒空间（20-35）
	[422] = {}, --逆流！三环双鱼（90-150）
	[423] = {}, --逆流！三环狮子（90-150）
	[424] = {}, --逆流！三环天秤（90-150）
	[425] = {}, --逆流！亚特兰蒂斯（90-150）
	[426] = {}, --逆流！十二宫危机（90-150）
    [26]  = {9326,9113}, --55挂机地宫
    [27]  = {9327,9115}, --65挂机地宫
    [28]  = {9328,9116}, --75挂机地宫
    [29]  = {9329,9117}, --85挂机地宫
    [30]  = {9330,9118}, --95挂机地宫
    [31]  = {9331,9208}, --45挂机地宫
	[501]  = {7881,9220,9170}, --40大众战场
	[502]  = {7881,9218,9170}, --80混沌战场
	[419] = {}, --危急！女神近卫军(60-100)
	[602] = {"additional-5"}, --组队跨服竞技长
    [504]  = {12310,12312,12658}, --60熔岩战场
    [505]  = {12310,12312,12659}, --60飞行战场
    [506]  = {13042,13043,13112}, --60飞行战场
}
