--------------------------------------------
-- 屏幕后处理特效状态配置
-- Created by Fengbo
--[[
在此配置中当满足某一特定条件时，会开启对应的后处理特效。
所有条件都不满足时，恢复正常显示。

目前可以公开的情报：
----------------------------
支持以下条件：
buff
个人声望
----------------------------
支持以下后处理特效：
old_time				怀旧老照片
death					死亡
keep_blue				突出蓝色，其余颜色为灰度
inverse					反色效果
gray					灰度效果
warp 					水下扭曲
warp(scale, speed) 		带参数的水下扭曲，scale为扭曲程度(0~0.1)，speed为扭曲速度(0~4)
dream					梦境
blood					僵尸视角
----------------------------
如果需要进一步扩展请与我联系

配置格式如下：

post_effect =
{
	{ buff = 123, repu_id = 1, repu_value = 1; "old_time" },	-- 玩家获得buff 123，且声望1的值为1时，开启老照片效果
	{ repu_id = 1, repu_value = 2; "death" },					-- 玩家声望2的值为2时，开启死亡效果
}
--]]
--------------------------------------------

post_effect =
{
	{ buff = 2252; "old_time" },    --剧情副本变身奥路菲、紫龙1、艾欧罗斯开启回忆效果
	{ buff = 2253; "old_time" },    --剧情副本变身紫龙2开启回忆效果
	{ buff = 2254, repu_id = 88, repu_value = 1; "death" },  --主线青木原树海特殊屏幕效果
	{ buff = 2269; "old_time" },    --月度活动天秤，童虎记忆开启回忆效果
	{ buff = 2327; "dream" },    --天蝎宫冰河梦境效果
    { buff = 2398; "old_time" },    --剧情副本变身奥路菲、紫龙1、艾欧罗斯开启回忆效果
    { buff = 2356; "dream" },    --海魔女圣衣技能状态
    { buff = 2548; "warp(0.02,0.5)" },    --剧情十二宫天蝎宫夺走五感
    { buff = 2549; "warp(0.025,0.5)" },    --剧情十二宫天蝎宫夺走五感
    { buff = 2550; "warp(0.03,0.5)" },    --剧情十二宫天蝎宫夺走五感
    { buff = 2551; "warp(0.035,0.5)" },    --剧情十二宫天蝎宫夺走五感
    { buff = 2552; "warp(0.5,0.5)" },    --剧情十二宫天蝎宫夺走五感
	{ buff = 2978; "blood" },    --僵尸视野
}









