--[[ @i18n quest ]]
local _t = require("i18n").context("quest")

TASK_ERROR_TABLE_DEFAULT ={
   [0] = _t"成功",
   [1] = _t"未知的任务错误",
   [2] = _t"不是根任务",
   [3] = _t"已有相同任务",
   [4] = _t"任务列表空间已满",
   [5] = _t"达到已接受任务上限",
   [6] = _t"不能重复做此任务",
   [7] = _t"级别不够",
   [8] = _t"超出级别",
   [9] = _t"无所需物品",
   [10] = _t"您的个人声望不满足要求",
   [11] = _t"公会不满足要求",
   [12] = _t"性别不满足要求",
   [13] = _t"守护星座不满足要求",
   [14] = _t"没有达到所需修真阶段",
   [15] = _t"前提任务不满足",
   [16] = _t"任务已到达接收者上限",
   [17] = _t"钱数不够",
   [18] = _t"无此任务",
   [19] = _t"任务要求队长",
   [20] = _t"组队成员不满足要求",
   [21] = _t"发放任务的时间段不对",
   [22] = _t"无此子任务",
   [23] = _t"互斥任务不满足要求",
   [24] = _t"不在要求的区域",
   [25] = _t"错误的子任务",
   [26] = _t"队员距离过远",
   [27] = _t"包裹空间不够",
   [28] = _t"生活技能不满足要求",
   [29] = _t"特殊奖励不满足要求",
   [30] = _t"PK值不满足要求",
   [32] = _t"友好度不满足要求",
   [33] = _t"称谓不满足要求",
   [34] = _t"公会贡献度不满足要求",
   [35] = _t"任务要求军团成员",
   [36] = _t"您的军团职务不符合任务要求",
   [37] = _t"您的军团等级不符合任务要求",
   [38] = _t"军团技能熟练度不满足要求",
   [39] = _t"记录不满足要求",
   [40] = _t"法宝血炼值不满足要求",
   [41] = _t"完成次数已达上限",
   [42] = _t"战场积分不满足要求",
   [43] = _t"变身种族不满足要求",
   [44] = _t"变身形象不满足要求",
   [45] = _t"种族不满足要求",
   [46] = _t"关联任务不满足要求",
   [47] = _t"生日任务日期不满足要求",
   [48] = _t"目前还不能领取任务",  --全局参数和场景参数不满足
   [49] = _t"技能不满足",
   [50] = _t"该任务目前不能接取",  -- 试图接取没刷出来的库任务
   [51] = _t"状态不满足要求",
   [52] = _t"不满足圣衣前提要求",
   [53] = _t"跑商任务不满足要求",
   [54] = _t"前提成就不满足要求",
   [55] = _t"金券不足",
   [56] = _t"脚本判断失败",
   [57] = _t"创建副本失败",
   [58] = _t"进入副本失败",
   [59] = nil, --"状态异常，不能完成任务，请退回人物选择画面或者更新您的游戏版本",
   [60] = _t"还没有开启指定地图",
   [61] = _t"团队不在副本中",
   [62] = _t"任务状态异常，可能是客户端判定和服务器不一致",
   [63] = _t"小宇宙等级不足",
   [64] = _t"小宇宙等级过高",
   [65] = _t"内部错误:脚本参数错误",
   [66] = _t"创建副本失败：已经创建了一个单人/组队副本",
   [67] = _t"进入副本失败：对应副本还未创建",
   [68] = _t"您的多倍经验时间已超过要求",
   [69] = _t"玩家背包大小已达到扩充上限",
   [70] = _t"玩家仓库大小已达到扩充上限",
   [71] = _t"队员不满足任务条件",
   [72] = _t"队伍中有队员离线或与队长不在同一条线",
   [73] = _t"玩家星座不满足要求",
   [74] = _t"缺少必要的图鉴",
   [75] = _t"超过军团计数上限",
   [76] = _t"您的图鉴点数不满足要求",
   [77] = _t"您的成就点数不满足要求",
   [78] = _t"在团队中时无法接取该任务",
   [79] = _t"您不是团队长，无法接取任务",
   [80] = _t"您已经接取了过多的同类任务", -- 达到了库的接取上限
   [81] = _t"战斗力不足，无法接取该任务",
   [82] = _t"目前无法接取此任务", -- 军团长尚未开启该任务库
   [83] = _t"您的VIP等级不符合要求",
   [84] = _t"您的月度VIP等级不符合要求",
   [85] = _t"您在星辰的史诗的攻略进度不符合要求", -- 个人挑战副本层数不满足条件
   [86] = _t"该任务已被禁用",
   [87] = _t"您的帐号没有使用任何密保措施",
   [88] = _t"军团声望不满足条件",
   [89] = _t"帐号声望不满足条件",
   [90] = _t"组队声望不满足条件",
   [91] = _t"跨服状态时无法接取该任务",
   [92] = _t"玩家推广人不满足条件",
   [93] = _t"前提任务完成次数不满足条件",
   [94] = _t"观星等级不满足条件",
   [95] = _t"您的本月充值数量不符合要求",
   [96] = _t"您输入的序列码无效或者有误，请检查并重新输入",
   [97] = _t"您输入的任务码已经被使用过了",
   [98] = _t"请先完成当前正在进行的抽奖",

   [100] = _t"普通或者任务包裹已满，无法奖励物品",
   [101] = _t"跨服状态时无法完成该任务",
   [102] = _t"不满足完成条件：级别不够",
   [103] = _t"不满足完成条件：种族不符",
   [104] = _t"不满足完成条件：变身形象不符",
   [105] = _t"不满足完成条件：目前无法完成该任务",
   [106] = _t"玩家目前处于特殊状态，无法完成任务",
   [107] = _t"玩家尚未达成任务完成条件",
   [108] = _t"该任务只能由队长完成",
   [109] = _t"任务状态异常，无法完成",
   [111] = _t"内部错误：Lua调用失败，可能是参数类型不符",

   [150] = _t"分享任务失败",
   [151] = _t"未找到该任务",
   [152] = _t"该任务不能被分享",
   [153] = _t"该任务已经被分享过，不能再次分享",
   [154] = _t"您必须在队伍中才能分享任务",

   [1000] = _t"目前状态下不能进行此操作",

   [9999] = _t"，任务无法完成",   --特殊错误码，用于任务面板内
   [10000] = _t"：\r\r",           --错误详细分割符
   [10001] = _t"%s：%s\r",           --用于显示队友的任务错误信息

}

--以任务id为索引
TASK_ERROR_TABLE={}
TASK_ERROR_TABLE[1571] = {
   [10] =_t"队员不满足对应任务步骤",
   [88] =_t"队员不满足对应任务步骤",
   [89] =_t"队员不满足对应任务步骤",
   [90] =_t"队员不满足对应任务步骤",
}
TASK_ERROR_TABLE[1569] = {
   [10] =_t"队员不满足对应任务步骤",
   [88] =_t"队员不满足对应任务步骤",
   [89] =_t"队员不满足对应任务步骤",
   [90] =_t"队员不满足对应任务步骤",
}
TASK_ERROR_TABLE[1573] = {
   [10] =_t"队员不满足对应任务步骤",
   [88] =_t"队员不满足对应任务步骤",
   [89] =_t"队员不满足对应任务步骤",
   [90] =_t"队员不满足对应任务步骤",
}
TASK_ERROR_TABLE[3416] = {
   [10] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [88] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [89] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [90] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [23] =_t"你有一个低等级周限次任务尚未完成，建议放弃低级任务并接取与当前等级匹配的周限次任务。"
}
TASK_ERROR_TABLE[3418] = {
   [10] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [88] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [89] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [90] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [23] =_t"你有一个低等级周限次任务尚未完成，建议放弃低级任务并接取与当前等级匹配的周限次任务。"
}
TASK_ERROR_TABLE[4208] = {
   [10] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [88] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [89] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [90] =_t"你完成的周限次任务次数已达到上限，本周无法再做周限次任务了",
   [23] =_t"你有一个低等级周限次任务尚未完成，建议放弃低级任务并接取与当前等级匹配的周限次任务。"
}
TASK_ERROR_TABLE[4183] = {
   [9] =_t"需要物品：纱织的邀请信。",
}
TASK_ERROR_TABLE[4129] = {
   [10] =_t"不满足报名条件",
   [88] =_t"不满足报名条件",
   [89] =_t"不满足报名条件",
   [90] =_t"不满足报名条件",
}
TASK_ERROR_TABLE[1001] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1002] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1003] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1004] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1005] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1006] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1007] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1008] = {
   [10] =_t"军团资源不足",
   [88] =_t"军团资源不足",
   [89] =_t"军团资源不足",
   [90] =_t"军团资源不足",
   [9] =_t"缺少女神护佑信物",
}
TASK_ERROR_TABLE[1379] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1380] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1381] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1382] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1383] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1384] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1385] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[1386] = {
   [10] =_t"军团资源不足或间隔时间未到",
   [88] =_t"军团资源不足或间隔时间未到",
   [89] =_t"军团资源不足或间隔时间未到",
   [90] =_t"军团资源不足或间隔时间未到",
}
TASK_ERROR_TABLE[965] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[966] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[967] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[1009] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[1010] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[1011] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[1012] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3543] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3544] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3545] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3546] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3547] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3548] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3549] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[3550] = {
   [10] =_t"接取<命运的试炼>次数已用尽",
   [88] =_t"接取<命运的试炼>次数已用尽",
   [89] =_t"接取<命运的试炼>次数已用尽",
   [90] =_t"接取<命运的试炼>次数已用尽",
   [50] =_t"接取等级不满足",
}
TASK_ERROR_TABLE[2168] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2169] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2170] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2171] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2172] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2173] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2174] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2175] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2176] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2177] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2178] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2179] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2180] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2181] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2182] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2183] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2184] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2185] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2186] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2187] = {
   [6] =_t"该礼包只能使用一次",
   [7] =_t"未达到打开物品的等级",
}
TASK_ERROR_TABLE[2316] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[2268] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1480] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1481] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1482] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1483] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1484] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1485] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1486] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1487] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}
TASK_ERROR_TABLE[1488] = {
   [68] =_t"您已经无法携带更多的双倍时间了",
}

TASK_ERROR_TABLE[3351] = {
   [7] =_t"需要等级达到30级",
}

TASK_ERROR_TABLE[3352] = {
   [7] =_t"需要等级达到30级",
}

TASK_ERROR_TABLE[3353] = {
   [7] =_t"需要等级达到30级",
}

TASK_ERROR_TABLE[3354] = {
   [7] =_t"需要等级达到30级",
}

TASK_ERROR_TABLE[3481] = {
   [7] =_t"需要等级达到30级",
}

TASK_ERROR_TABLE[12561] = {
   [7] =_t"需要等级达到30级",
}

TASK_ERROR_TABLE[3355] = {
   [7] =_t"需要等级达到50级",
   [52] =_t"需要获得圣衣：盾牌座",
}

TASK_ERROR_TABLE[3356] = {
   [7] =_t"需要等级达到50级",
   [52] =_t"需要获得圣衣：六分仪座",
}

TASK_ERROR_TABLE[3357] = {
   [7] =_t"需要等级达到50级",
   [52] =_t"需要获得圣衣：箭鱼座",
}

TASK_ERROR_TABLE[3358] = {
   [7] =_t"需要等级达到50级",
   [52] =_t"需要获得圣衣：巨蛇座",
}

TASK_ERROR_TABLE[3482] = {
   [7] =_t"需要等级达到50级",
   [52] =_t"需要获得圣衣：船尾座",
}

TASK_ERROR_TABLE[12557] = {
   [7] =_t"需要等级达到50级",
   [52] =_t"需要获得圣衣：鹿豹座",
}

TASK_ERROR_TABLE[5186] = {
   [7] =_t"需要等级达到60级",
}

TASK_ERROR_TABLE[5187] = {
   [7] =_t"需要等级达到60级",
}

TASK_ERROR_TABLE[5188] = {
   [7] =_t"需要等级达到60级",
}

TASK_ERROR_TABLE[5189] = {
   [7] =_t"需要等级达到60级",
}

TASK_ERROR_TABLE[5190] = {
   [7] =_t"需要等级达到60级",
}

TASK_ERROR_TABLE[12564] = {
   [7] =_t"需要等级达到60级",
}

TASK_ERROR_TABLE[5191] = {
   [7] =_t"需要等级达到75级",
}

TASK_ERROR_TABLE[5192] = {
   [7] =_t"需要等级达到75级",
}

TASK_ERROR_TABLE[5193] = {
   [7] =_t"需要等级达到75级",
}

TASK_ERROR_TABLE[5194] = {
   [7] =_t"需要等级达到75级",
}

TASK_ERROR_TABLE[5195] = {
   [7] =_t"需要等级达到75级",
}

TASK_ERROR_TABLE[12567] = {
   [7] =_t"需要等级达到75级",
}


TASK_ERROR_TABLE[3424] = {
   [7] =_t"40级以上才可以领取",
   [10] =_t"需要50点军团贡献",
   [88] =_t"需要50点军团贡献",
   [89] =_t"需要50点军团贡献",
   [90] =_t"需要50点军团贡献",
}
TASK_ERROR_TABLE[3425] = {
   [7] =_t"40级以上才可以领取",
   [10] =_t"需要50点军团贡献",
   [88] =_t"需要50点军团贡献",
   [89] =_t"需要50点军团贡献",
   [90] =_t"需要50点军团贡献",
}
TASK_ERROR_TABLE[3426] = {
   [7] =_t"40级以上才可以领取",
   [10] =_t"需要50点军团贡献",
   [88] =_t"需要50点军团贡献",
   [89] =_t"需要50点军团贡献",
   [90] =_t"需要50点军团贡献",
}
TASK_ERROR_TABLE[3419] = {
   [10] =_t"只有5名军团副团长才可以领取哦",
   [88] =_t"只有5名军团副团长才可以领取哦",
   [89] =_t"只有5名军团副团长才可以领取哦",
   [90] =_t"只有5名军团副团长才可以领取哦",
}
TASK_ERROR_TABLE[3420] = {
   [10] =_t"只有5名军团副团长才可以领取哦",
   [88] =_t"只有5名军团副团长才可以领取哦",
   [89] =_t"只有5名军团副团长才可以领取哦",
   [90] =_t"只有5名军团副团长才可以领取哦",
}
TASK_ERROR_TABLE[3421] = {
   [10] =_t"只有5名军团副团长才可以领取哦",
   [88] =_t"只有5名军团副团长才可以领取哦",
   [89] =_t"只有5名军团副团长才可以领取哦",
   [90] =_t"只有5名军团副团长才可以领取哦",
}
TASK_ERROR_TABLE[3422] = {
   [10] =_t"只有5名军团副团长才可以领取哦",
   [88] =_t"只有5名军团副团长才可以领取哦",
   [89] =_t"只有5名军团副团长才可以领取哦",
   [90] =_t"只有5名军团副团长才可以领取哦",
}
TASK_ERROR_TABLE[3423] = {
   [10] =_t"只有5名军团副团长才可以领取哦",
   [88] =_t"只有5名军团副团长才可以领取哦",
   [89] =_t"只有5名军团副团长才可以领取哦",
   [90] =_t"只有5名军团副团长才可以领取哦",
}
TASK_ERROR_TABLE[2416] = {
   [10] =_t"军团上周活跃度需要到达10920",
   [88] =_t"军团上周活跃度需要到达10920",
   [89] =_t"军团上周活跃度需要到达10920",
   [90] =_t"军团上周活跃度需要到达10920",
}
TASK_ERROR_TABLE[2417] = {
   [10] =_t"军团上周活跃度需要到达22930",
   [88] =_t"军团上周活跃度需要到达22930",
   [89] =_t"军团上周活跃度需要到达22930",
   [90] =_t"军团上周活跃度需要到达22930",
}
TASK_ERROR_TABLE[2418] = {
   [10] =_t"军团上周活跃度需要到达36030",
   [88] =_t"军团上周活跃度需要到达36030",
   [89] =_t"军团上周活跃度需要到达36030",
   [90] =_t"军团上周活跃度需要到达36030",
}
TASK_ERROR_TABLE[2419] = {
   [10] =_t"军团上周活跃度需要到达50230",
   [88] =_t"军团上周活跃度需要到达50230",
   [89] =_t"军团上周活跃度需要到达50230",
   [90] =_t"军团上周活跃度需要到达50230",
}
TASK_ERROR_TABLE[3512] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3513] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3514] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3515] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3516] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3517] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3518] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[3519] = {
   [41] =_t"今天你已经使用过了",
}

TASK_ERROR_TABLE[1232] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1199] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1239] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1074] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1225] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1249] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1193] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1212] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1244] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1219] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1205] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1068] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[1256] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2472] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2484] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2500] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2495] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2505] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2477] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2512] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2466] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2489] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2460] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}

TASK_ERROR_TABLE[2519] = {
   [10] =_t"今日接取传记任务的次数已用尽",
   [88] =_t"今日接取传记任务的次数已用尽",
   [89] =_t"今日接取传记任务的次数已用尽",
   [90] =_t"今日接取传记任务的次数已用尽",
}
TASK_ERROR_TABLE[4080] = {
   [10] =_t"您已经无法携带更多的军团贡献了",
   [88] =_t"您已经无法携带更多的军团贡献了",
   [89] =_t"您已经无法携带更多的军团贡献了",
   [90] =_t"您已经无法携带更多的军团贡献了",
}
TASK_ERROR_TABLE[3981] = {
   [10] =_t"您已经无法携带更多的军团贡献了",
   [88] =_t"您已经无法携带更多的军团贡献了",
   [89] =_t"您已经无法携带更多的军团贡献了",
   [90] =_t"您已经无法携带更多的军团贡献了",
}
TASK_ERROR_TABLE[1313] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[1315] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[1314] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2278] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2279] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2280] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2281] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2283] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2284] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2285] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2286] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2368] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2369] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2370] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2371] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2372] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2373] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2374] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2376] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2377] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2378] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2379] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2380] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2381] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2382] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2383] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2384] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2385] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2386] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2387] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2388] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2389] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4194] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4195] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4196] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4197] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4198] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4199] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4200] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4201] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4202] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4203] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4204] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4205] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4206] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4207] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4208] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4209] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4210] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4211] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4212] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4213] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[4214] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5094] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5095] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5096] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5097] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5098] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5099] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5100] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5101] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5102] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5103] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5104] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5105] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5106] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5107] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5108] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[5109] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6077] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6078] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6079] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6080] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6081] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6082] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6083] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[6084] = {
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2140] = {
   [10] =_t"军团黄金资源已到上限",
   [88] =_t"军团黄金资源已到上限",
   [89] =_t"军团黄金资源已到上限",
   [90] =_t"军团黄金资源已到上限",
}
TASK_ERROR_TABLE[2141] = {
   [10] =_t"军团蜜酒资源已到上限",
   [88] =_t"军团蜜酒资源已到上限",
   [89] =_t"军团蜜酒资源已到上限",
   [90] =_t"军团蜜酒资源已到上限",
}
TASK_ERROR_TABLE[2142] = {
   [10] =_t"军团象牙资源已到上限",
   [88] =_t"军团象牙资源已到上限",
   [89] =_t"军团象牙资源已到上限",
   [90] =_t"军团象牙资源已到上限",
}
TASK_ERROR_TABLE[2143] = {
   [10] =_t"军团青铜资源已到上限",
   [88] =_t"军团青铜资源已到上限",
   [89] =_t"军团青铜资源已到上限",
   [90] =_t"军团青铜资源已到上限",
}
TASK_ERROR_TABLE[2089] = {
   [3] =_t"正在使用中",
   [41] =_t"已达到今日使用次数上限",
}
TASK_ERROR_TABLE[2052] = {
   [46] =_t"请先在神秘祭司处接取任务“危急！纱织守护者”，然后我才能送您去希望沙滩。",
}
TASK_ERROR_TABLE[4388] = {
   [10] =_t"已参加15次“传承！黄金试炼”，不能继续参加。",
   [88] =_t"已参加15次“传承！黄金试炼”，不能继续参加。",
   [89] =_t"已参加15次“传承！黄金试炼”，不能继续参加。",
   [90] =_t"已参加15次“传承！黄金试炼”，不能继续参加。",
}
TASK_ERROR_TABLE[4387] = {
   [10] =_t"已接取或已完成命运的试练。",
   [88] =_t"已接取或已完成命运的试练。",
   [89] =_t"已接取或已完成命运的试练。",
   [90] =_t"已接取或已完成命运的试练。",
}
TASK_ERROR_TABLE[4418] = {
   [46] = _t"需要在军团管理员处领取：军团创建！守护信念之章任务",
   [21] = _t"每隔10分钟队长可召唤1次考验目标",
}
TASK_ERROR_TABLE[4448] = {
   [46] = _t"需要在军团管理员处领取：军团创建！守护信念之章任务",
}
TASK_ERROR_TABLE[3981] = {
   [41] = _t"一周只能开启一次",
}
TASK_ERROR_TABLE[5603] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5604] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5605] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5433] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5437] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5448] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5452] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5455] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
   }
TASK_ERROR_TABLE[5458] = {
   [10] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [88] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [89] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [90] =_t"队员进入黄金试炼或大反攻系列副本的次数已用尽",
   [23] =_t"队员未上交任务，建议上交任务或离队重新加入",
}
TASK_ERROR_TABLE[5597] = {
   [10] =_t"已参加15次“大反攻！冰国邪神”，不能继续参加。",
   [88] =_t"已参加15次“大反攻！冰国邪神”，不能继续参加。",
   [89] =_t"已参加15次“大反攻！冰国邪神”，不能继续参加。",
   [90] =_t"已参加15次“大反攻！冰国邪神”，不能继续参加。",
}
TASK_ERROR_TABLE[4335] = {
   [10] =_t"本周已开启过此活动任务，请下周再开启。",
   [88] =_t"本周已开启过此活动任务，请下周再开启。",
   [89] =_t"本周已开启过此活动任务，请下周再开启。",
   [90] =_t"本周已开启过此活动任务，请下周再开启。",
}
TASK_ERROR_TABLE[4336] = {
   [10] =_t"本周已开启过此活动任务，请下周再开启。",
   [88] =_t"本周已开启过此活动任务，请下周再开启。",
   [89] =_t"本周已开启过此活动任务，请下周再开启。",
   [90] =_t"本周已开启过此活动任务，请下周再开启。",
}
TASK_ERROR_TABLE[4337] = {
   [10] =_t"本周已开启过此活动任务，请下周再开启。",
   [88] =_t"本周已开启过此活动任务，请下周再开启。",
   [89] =_t"本周已开启过此活动任务，请下周再开启。",
   [90] =_t"本周已开启过此活动任务，请下周再开启。",
}
TASK_ERROR_TABLE[4338] = {
   [10] =_t"本周已开启过此活动任务，请下周再开启。",
   [88] =_t"本周已开启过此活动任务，请下周再开启。",
   [89] =_t"本周已开启过此活动任务，请下周再开启。",
   [90] =_t"本周已开启过此活动任务，请下周再开启。",
}
TASK_ERROR_TABLE[1373] = {
   [10] =_t"本日已开启过此活动任务，请明日再开启。",
   [88] =_t"本日已开启过此活动任务，请明日再开启。",
   [89] =_t"本日已开启过此活动任务，请明日再开启。",
   [90] =_t"本日已开启过此活动任务，请明日再开启。",
}
TASK_ERROR_TABLE[7139] = {
   [10] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [88] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [89] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [90] =_t"您中途加入了“传承！黄金试炼”",
}
TASK_ERROR_TABLE[7140] = {
   [10] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [88] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [89] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [90] =_t"您中途加入了“大反攻！冰国邪神”",
}
TASK_ERROR_TABLE[7141] = {
   [10] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [88] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [89] =_t"本日进入黄金试炼或大反攻系列副本的次数已用尽。",
   [90] =_t"您中途加入了“大反攻！冰国邪神”",
}
TASK_ERROR_TABLE[7278] = {
   [23] =_t"已接取或已完成梦神的诡计任务",
}
TASK_ERROR_TABLE[7279] = {
   [23] =_t"已接取或已完成梦神的诡计任务",
}
TASK_ERROR_TABLE[7152] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7153] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7155] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7212] = {
   [10] =_t"您的系统双倍声望超过84点，无法领取",
}
TASK_ERROR_TABLE[7156] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7157] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7174] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7213] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7246] = {
   [10] =_t"您已达到当前等级福利领取次数上限，请努力升级",
}
TASK_ERROR_TABLE[7892] = {
   [10] =_t"您已有神战点超过30点，无法继续使用神战卡",
   [41] =_t"您本周已使用神战卡10次，无法继续使用",
}
TASK_ERROR_TABLE[7995] = {
   [18] =_t"通关[副本]十风穴后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[7996] = {
   [18] =_t"通关[副本]射手之心后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[7997] = {
   [18] =_t"通关[副本]黄金十二宫(始)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[7998] = {
   [18] =_t"通关[副本]黄金十二宫(续)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[7999] = {
   [18] =_t"通关[副本]黄金十二宫(终)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[8000] = {
   [18] =_t"通关[副本]黄金十二宫(余)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[8001] = {
   [18] =_t"通关[副本]冰海神殿后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[8002] = {
   [18] =_t"通关[副本]七大洋巨柱(前)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[8003] = {
   [18] =_t"通关[副本]七大洋巨柱(后)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[8178] = {
   [41] =_t"每周只可开启一次哦",
}
TASK_ERROR_TABLE[8180] = {
   [10] =_t"已接取或已完成“战火！巨蟹的前线！”任务",
   [23] =_t"已接取或已完成“战火！巨蟹的前线！”任务",
}
TASK_ERROR_TABLE[8181] = {
   [10] =_t"已接取或已完成“战火！巨蟹的前线！”任务",
   [23] =_t"已接取或已完成“战火！巨蟹的前线！”任务",
}
TASK_ERROR_TABLE[8241] = {
   [7] =_t"等级大于等于80级可使用",
   [10] =_t"已获得超过30点英雄点，无法再使用",
}
TASK_ERROR_TABLE[8465] = {
   [10] =_t"已完成“进击中的黑暗”任务",
   [23] =_t"已接取或已完成“进击中的黑暗”任务",
}
TASK_ERROR_TABLE[8466] = {
   [10] =_t"已完成“进击中的黑暗”任务",
   [23] =_t"已接取或已完成“进击中的黑暗”任务",
}
TASK_ERROR_TABLE[8467] = {
   [10] =_t"已完成“进击中的黑暗”任务",
   [23] =_t"已接取或已完成“进击中的黑暗”任务",
}
TASK_ERROR_TABLE[8390] = {
   [10] =_t"已完成“进击中的黑暗”任务",
   [23] =_t"已接取或已完成“进击中的黑暗”任务",
}
TASK_ERROR_TABLE[8391] = {
   [10] =_t"已完成“进击中的黑暗”任务",
   [23] =_t"已接取或已完成“进击中的黑暗”任务",
}
TASK_ERROR_TABLE[1269] = {
   [3] =_t"刷新慢一点，对待老人要有耐心和爱心",
}
TASK_ERROR_TABLE[8855] = {
   [36] =_t"军团长才可以接受该任务",
   [88] =_t"前任军团长已接取过该任务",
}
TASK_ERROR_TABLE[8959] = {
   [21] =_t"等待春丽准备草药",
}
TASK_ERROR_TABLE[9336] = {
   [10] =_t"您的活跃度不足",
}
TASK_ERROR_TABLE[9341] = {
   [10] =_t"您的活跃度不足",
}
TASK_ERROR_TABLE[9452] = {
   [10] =_t"您的充值积分不足",
}
TASK_ERROR_TABLE[9453] = {
   [10] =_t"您的充值积分不足",
}
TASK_ERROR_TABLE[9566] = {
   [21] =_t"还未到开启时间",
}
TASK_ERROR_TABLE[9892] = {
   [18] =_t"通关[英雄]十风穴后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[9893] = {
   [18] =_t"通关[英雄]射手之心后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[9898] = {
   [18] =_t"通关[英雄]女神的挽歌(前)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}
TASK_ERROR_TABLE[9899] = {
   [18] =_t"通关[英雄]女神的挽歌(后)后才能使用",
   [21] =_t"每次通关副本只能使用一次本物品",
}

TASK_ERROR_TABLE[9910] = {
   [10] =_t"免费双倍经验声望不足",
   [51] =_t"您已经获得免费双倍经验了，无法叠加",
}

TASK_ERROR_TABLE[9911] = {
   [10] =_t"免费双倍经验声望不足",
   [51] =_t"您已经获得免费双倍经验了，无法叠加",
}

TASK_ERROR_TABLE[9972] = {
   [6] =_t"您已使用过天蝎座赠礼（顶级），无法继续使用",
   [7] = _t"到达40级后可以开启",
}

TASK_ERROR_TABLE[9973] = {
   [6] =_t"您已使用过天蝎座赠礼（至尊），无法继续使用",
   [7] = _t"到达40级后可以开启",
}
TASK_ERROR_TABLE[10481] = {
   [10] =_t"您的活跃度不足",
}
TASK_ERROR_TABLE[10101] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10102] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10103] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10104] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10105] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10106] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10107] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10108] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10109] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10110] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10111] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10112] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10113] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10114] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10115] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10116] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10117] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10118] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10119] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10120] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10121] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10122] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10123] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10124] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10125] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10126] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10127] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10128] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10129] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10130] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10131] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10132] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10133] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10134] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10135] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10136] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10137] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10138] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10139] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10140] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10141] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10142] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10143] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10144] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10145] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10146] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10147] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10148] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10149] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10150] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10151] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10152] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10153] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10154] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10155] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10156] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10157] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10158] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10159] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10160] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10161] = {
   [6] =_t"已报名第一届跨服竞技赛，不可重复报名",
}
TASK_ERROR_TABLE[10702] = {
   [6] =_t"您已使用过射手座赠礼（顶级），无法继续使用",
   [7] = _t"到达40级后可以开启",
}

TASK_ERROR_TABLE[10703] = {
   [6] =_t"您已使用过射手座赠礼（至尊），无法继续使用",
   [7] = _t"到达40级后可以开启",
}

TASK_ERROR_TABLE[10939] = {
   [7] = _t"到达40级后可以开启",
   [41] = _t"您已使用过20次感恩节特别礼包，无法继续使用",
}

TASK_ERROR_TABLE[11010] = {
   [10] =_t"免费双倍经验声望不足",
   [51] =_t"您已经获得免费双倍经验了，无法叠加",
}

TASK_ERROR_TABLE[11227] = {
   [15] =_t"没有获得参加第一届跨服竞技赛的资格",
}
TASK_ERROR_TABLE[11290] = {
   [10] =_t"您的活跃度不足",
}
TASK_ERROR_TABLE[11291] = {
   [10] =_t"您的活跃度不足",
}
TASK_ERROR_TABLE[11038] = {
   [20] = _t"要求队长是男生，队员是女生，双方为好友，且友好度达到10000"
}
TASK_ERROR_TABLE[11042] = {
   [48] = _t"当前有新人正在举行婚礼，请在婚礼结束后再开启",
}
TASK_ERROR_TABLE[11294] = {
   [21] = _t"1月21日至2月28日，玩家可直接使用冰雪节日装饰获得奖励",
}
TASK_ERROR_TABLE[11425] = {
   [17] = _t"背包金币大于十五亿，使用后会超过上限，无法获得奖励",
}
TASK_ERROR_TABLE[11477] = {
   [21] = _t"2014年2月以后才可以开启获得奖励",
}
TASK_ERROR_TABLE[11478] = {
   [21] = _t"2014年3月以后才可以开启获得奖励",
}
TASK_ERROR_TABLE[11489] = {
   [7] =_t"60级以上才可以领取",
}
TASK_ERROR_TABLE[11503] = {
   [7] =_t"60级以上才可以领取",
}
TASK_ERROR_TABLE[11648] = {
   [21] = _t"兑换任务于2月10后开启,兑换不消耗该道具",
}
TASK_ERROR_TABLE[11644] = {
   [10] =_t"您的活跃度不足",
}
TASK_ERROR_TABLE[11614] = {
   [1] =_t"必须是夫妻才可以领取该任务",
}

TASK_ERROR_TABLE[11914] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11915] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11916] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11917] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11918] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11925] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11932] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11939] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11946] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11997] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[11999] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12001] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12003] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12005] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12007] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12009] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12105] = {
   [21] =_t"2014年3月18日-2014年12月31日间可以开启",
}

TASK_ERROR_TABLE[12148] = {
   [41] =_t"今天已不能再开启该礼包",
}

TASK_ERROR_TABLE[12445] = {
   [7] =_t"30级以上才能领奖",
   [48] =_t"本周上交的神意奖牌不足50，无法领奖",
}

TASK_ERROR_TABLE[12417] = {
   [48] =_t"本服冥王之怒事件尚未完成，无法参加宇宙争霸赛",
}

TASK_ERROR_TABLE[12418] = {
   [48] =_t"本服冥王之怒事件尚未完成，无法参加宇宙争霸赛",
}

TASK_ERROR_TABLE[12419] = {
   [48] =_t"本服冥王之怒事件尚未完成，无法参加宇宙争霸赛",
}

TASK_ERROR_TABLE[12420] = {
   [9] =_t"需要持有任意神域入场券才能获得奖励",
}

TASK_ERROR_TABLE[12421] = {
   [9] =_t"需要持有任意神域入场券才能获得奖励",
}


TASK_ERROR_TABLE[12382] = {
   [9] =_t"进入神域需要持有任意神域入场券",
   [48] =_t"本服冥王之怒事件尚未完成，无法进入神域",
}

TASK_ERROR_TABLE[12383] = {
   [9] =_t"进入神域需要持有任意神域入场券",
   [48] =_t"本服冥王之怒事件尚未完成，无法进入神域",
}

TASK_ERROR_TABLE[12384] = {
   [9] =_t"进入神域需要持有任意神域入场券",
   [48] =_t"本服冥王之怒事件尚未完成，无法进入神域",
}

TASK_ERROR_TABLE[12707] = {
   [6] =_t"本周已经获得过一张入场券，无法重复获得",
   [7] =_t"30级以上才可以兑换神域入场券",
   [23] =_t"本周已经获得过一张入场券，无法重复获得",
}

TASK_ERROR_TABLE[12708] = {
   [6] =_t"本周已经获得过一张入场券，无法重复获得",
   [7] =_t"30级以上才可以兑换神域入场券",
   [23] =_t"本周已经获得过一张入场券，无法重复获得",
}

TASK_ERROR_TABLE[12709] = {
   [6] =_t"本周已经获得过一张入场券，无法重复获得",
   [7] =_t"30级以上才可以兑换神域入场券",
   [23] =_t"本周已经获得过一张入场券，无法重复获得",
}

TASK_ERROR_TABLE[12585] = {
   [21] =_t"使用物品时效已过",
}

TASK_ERROR_TABLE[12586] = {
   [21] =_t"使用物品时效已过",
}

TASK_ERROR_TABLE[12587] = {
   [21] =_t"使用物品时效已过",
}

TASK_ERROR_TABLE[12588] = {
   [21] =_t"使用物品时效已过",
}

TASK_ERROR_TABLE[13110] = {
   [41] =_t"一天后可继续使用",
}

TASK_ERROR_TABLE[13241] = {
   [41] =_t"一天后可继续使用",
}
------------------以下不修改------------------------------------------------
function TASK_ERROR_TABLE:GetString(iErrorCode, iTaskID)
    if TASK_ERROR_TABLE[iTaskID] == nil then
        return TASK_ERROR_TABLE_DEFAULT[iErrorCode]
    end

    if TASK_ERROR_TABLE[iTaskID][iErrorCode] == nil then
        return TASK_ERROR_TABLE_DEFAULT[iErrorCode]
    end

    do return TASK_ERROR_TABLE[iTaskID][iErrorCode] end
end

