---------------------------------------------------------------
--  created:   2009.10.28
--  author:    liudong, liuyuan 
--	modified:  2010.3.9
--  客户端C封装的lua函数 (GameAPI)。 
--  部分API标示为暂时无效，请不要使用 
---------------------------------------------------------------


-------------------------------------------------------------
----------------------------工具-----------------------------
-------------------------------------------------------------
--使传入的func函数在经过timeout毫秒（不是非常精确）后执行。
--set_timeout(func, timeout)





-------------------------------------------------------------
----------------------------界面-----------------------------
-------------------------------------------------------------

--显示播放动画时的黑边
--[params] callback 当黑边显示动画结束后会调用该回调函数
--GameUI.ShowAnimationMask(callback)

--隐藏播放动画时的黑边
--[params] callback 当黑边隐藏动画结束后会调用该回调函数
--GameUI.HideAnimationMask(callback)



-------------------------------------------------------------
--------------------------UI动画-----------------------------
-------------------------------------------------------------

--以下函数中opt参数如果传function类型，则动画结束后会调用该函数
--若opt为table类型，则可以传递以下值（均为可选项）：
--{
--  duration = 2000, -- 动画持续时间，默认为1000ms
--  oncomplete = function() end, -- 动画结束时调用的回调函数
--}

--游戏界面从黑屏淡入、淡出到黑屏
--ani.screen.fade_in(opt)
--ani.screen.fade_out(opt)

--窗口淡入、淡出
--ani.dialog.fade_in(dlg_name, opt)
--ani.dialog.fade_out(dlg_name, opt)

--窗口控件淡入、淡出
--ani.object.fade_in(dlg_name, obj_name, opt)
--ani.object.fade_out(dlg_name, obj_name, opt)

--自定义动画
--函数接受一个table作为参数
--ani:new{
--  start_state = 0,                             -- 初始值
--  end_state = 255,                             -- 结束值
--  easing = "swing",                            -- 可选，取值为"linear"和"swing"，默认为"swing"
--  duration = 2000,                             -- 可选，动画持续时间，默认值为1000ms
--  oninit = function(self) end                  -- 可选，必须为一个function，可进行一些初始化工作
--  onpopulate = function(self, state) end       -- 必须为一个function，动画每一帧时调用，此时应该将得到的state赋值给需要动画的对象
--  oncomplete = function(self) end              -- 可选，必须为一个function，动画结束时调用
--}




-------------------------------------------------------------
----------------------------控制台-----------------------------
-------------------------------------------------------------

--执行控制台命令 
--console.run(cmd)

--在控制台打印文字, color 可选，字符串 "rrggbb",  例 "ff0000"
--console.info(string  [,color] )

--在控制台打印错误信息，显示为红色
--console.error(string)






